
icc2_shell> sh rm /home/ICer/SerDes/pnr/setup/script/SerDes.dlib/SerDes_pl/design.ndm.lock
Error: rm: cannot remove '/home/ICer/SerDes/pnr/setup/script/SerDes.dlib/SerDes_pl/design.ndm.lock': No such file or directory
        Use error_info for more info. (CMD-013)
icc2_shell> set design SerDes
SerDes
icc2_shell> 
icc2_shell> set design_lib_path /home/ICer/SerDes/pnr/setup/script
/home/ICer/SerDes/pnr/setup/script
icc2_shell> open_block $design_lib_path/${design}.dlib:${design}_pl.design
Information: User units loaded from library 'saed90nm_max' (LNK-040)
Opening block 'SerDes.dlib:SerDes_pl.design' in edit mode
Information: loading PG routing via master rules, patterns, strategies and strategy via rules.
{SerDes.dlib:SerDes_pl.design}
icc2_shell> copy_block -from_block ${design}.dlib:${design}_pl.design -to_block ${design}_cts
{SerDes.dlib:SerDes_cts.design}
icc2_shell> current_block ${design}_cts.design
{SerDes.dlib:SerDes_cts.design}
icc2_shell> 
icc2_shell> set_host_options -max_cores 8
1
icc2_shell> 
icc2_shell> # Pre-CTS checks
icc2_shell> check_design -checks pre_clock_tree_stage
****************************************
 Report : check_design 
 Options: { pre_clock_tree_stage }
 Design : system
 Version: O-2018.06-SP1
 Date   : Tue Aug 26 08:26:24 2025
****************************************

Running mega-check 'pre_clock_tree_stage': 
    Running atomic-check 'design_mismatch'
    Running atomic-check 'scan_chain'
    Running atomic-check 'mv_design'
    Running atomic-check 'legality'
    Running atomic-check 'design_extraction'
    Running atomic-check 'timing'
    Running atomic-check 'clock_trees'
    Running atomic-check 'hier_pre_clock_tree'

  *** EMS Message summary ***
  ----------------------------------------------------------------------------------------------------
  Rule         Type   Count      Message
  ----------------------------------------------------------------------------------------------------
  CTS-905      Warn   1          Clock %clock(%mode) with no sinks.
  TCK-001      Warn   206        The reported endpoint '%endpoint' is unconstrained. Reason: '%re...
  TCK-012      Warn   7          The input port '%port' has no clock_relative delay specified. Mo...
  ----------------------------------------------------------------------------------------------------
  Total 214 EMS messages : 0 errors, 214 warnings, 0 info.
  ----------------------------------------------------------------------------------------------------

  *** Non-EMS message summary ***
  ----------------------------------------------------------------------------------------------------
  Rule         Type   Count      Message
  ----------------------------------------------------------------------------------------------------
  CTS-101             1          %s will work on the following scenarios.
  CTS-107             1          %s will work on all clocks in active scenarios, including %d mas...
  LNK-064             1          In library %s, no block views exist for block %s.
  PDC-003             2          Routing direction of metal layer %s is neither "horizontal" nor ...
  PVT-032             1          Corner %s: no PVT mismatches.
  ----------------------------------------------------------------------------------------------------
  Total 6 non-EMS messages : 0 errors, 3 warnings, 3 info.
  ----------------------------------------------------------------------------------------------------

Information: EMS database is saved to file 'check_design.ems'.
Information: Non-EMS messages are saved into file 'check_design2025Aug26082624.log'.
1
icc2_shell> # --- Reset all option and configration for skew and latency
icc2_shell> set_ignored_layers -max_routing_layer M8 -min_routing_layer M1
1
icc2_shell> 
icc2_shell> remove_clock_tree_options -all -target_skew -target_latency
1
icc2_shell> # --- Clock sources
icc2_shell> report_clocks
****************************************
Report : clock
Design : system
Mode   : default
Version: O-2018.06-SP1
Date   : Tue Aug 26 08:26:24 2025
****************************************


Attributes:
    p - Propagated clock
    G - Generated  clock
    U - Unexpanded generated clock

Clock          Period   Waveform            Attrs     Sources
--------------------------------------------------------------------------------
fun_pclk       250.00   {0 125}                       {fun_pclk}
fun_sclk        25.00   {0 12.5}                      {fun_sclk}
scan_clk       500.00   {0 250}                       {scan_clk}

1
icc2_shell> report_clock_qor -type structure
****************************************
Report : report clock qor
        -type structure
Design : system
Version: O-2018.06-SP1
Date   : Tue Aug 26 08:26:24 2025
****************************************

C0 is corner default

Printing structure of fun_sclk at root pin fun_sclk:
(0) fun_sclk [in Port] [Location (123.19, 188.18)] [Net: fun_sclk] [Fanout: 1] 
 (1) sclk_mux/U1:IN1->Q [Ref: saed90nm_max/MUX21X2] [Location (57.88, 164.76)] [Net: sclk_mux/out] [Fanout: 19] 
  (2) receiver/ds/bit_count_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (46.18, 140.09)] [SINK PIN] 
  (2) transmitter/serial/data_out_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (44.90, 117.05)] [SINK PIN] 
  (2) transmitter/serial/counter_reg[1]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (31.14, 117.05)] [SINK PIN] 
  (2) transmitter/serial/counter_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (45.86, 85.75)] [SINK PIN] 
  (2) transmitter/serial/counter_reg[2]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (32.10, 111.29)] [SINK PIN] 
  (2) transmitter/serial/counter_reg[3]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (31.78, 82.49)] [SINK PIN] 
  (2) receiver/ds/datout_reg[1]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (66.02, 103.03)] [SINK PIN] 
  (2) receiver/ds/datout_reg[7]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (66.98, 94.01)] [SINK PIN] 
  (2) receiver/ds/datout_reg[8]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (46.50, 154.87)] [SINK PIN] 
  (2) receiver/ds/datout_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (47.14, 163.13)] [SINK PIN] 
  (2) receiver/ds/datout_reg[9]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (47.46, 120.31)] [SINK PIN] 
  (2) receiver/ds/datout_reg[5]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (53.22, 91.51)] [SINK PIN] 
  (2) receiver/ds/datout_reg[4]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (52.90, 99.77)] [SINK PIN] 
  (2) receiver/ds/bit_count_reg[3]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (66.02, 151.61)] [SINK PIN] 
  (2) receiver/ds/datout_reg[2]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (52.58, 111.29)] [SINK PIN] 
  (2) receiver/ds/datout_reg[6]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (66.34, 111.29)] [SINK PIN] 
  (2) receiver/ds/datout_reg[3]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (80.10, 111.29)] [SINK PIN] 
  (2) receiver/ds/bit_count_reg[1]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (47.46, 134.33)] [SINK PIN] 
  (2) receiver/ds/bit_count_reg[2]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (80.10, 126.07)] [SINK PIN] 

Printing structure of fun_pclk at root pin fun_pclk:
(0) fun_pclk [in Port] [Location (104.63, 188.18)] [Net: fun_pclk] [Fanout: 1] 
 (1) pclk_mux/U1:IN1->Q [Ref: saed90nm_max/MUX21X2] [Location (66.52, 170.52)] [Net: pclk_mux/out] [Fanout: 59] 
  (2) receiver/dec/ctrl/rdispout_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (112.74, 168.89)] [SINK PIN] 
  (2) transmitter/enc/kin_ff/q_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (31.78, 122.81)] [SINK PIN] 
  (2) transmitter/enc/k_err_ff/q_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (91.62, 137.59)] [SINK PIN] 
  (2) transmitter/enc/curr_dis_ff/q_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (38.82, 59.45)] [SINK PIN] 
  (2) transmitter/enc/data_ff/q_reg[7]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (125.54, 117.05)] [SINK PIN] 
  (2) transmitter/enc/data_ff/q_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (110.50, 30.65)] [SINK PIN] 
  (2) transmitter/enc/data_ff/q_reg[6]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (124.26, 30.65)] [SINK PIN] 
  (2) transmitter/enc/data_ff/q_reg[5]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (123.94, 33.91)] [SINK PIN] 
  (2) transmitter/enc/data_ff/q_reg[2]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (110.50, 36.41)] [SINK PIN] 
  (2) transmitter/enc/data_ff/q_reg[3]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (108.58, 74.23)] [SINK PIN] 
  (2) transmitter/enc/data_ff/q_reg[4]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (108.90, 53.69)] [SINK PIN] 
  (2) transmitter/enc/data_ff/q_reg[1]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (57.38, 76.73)] [SINK PIN] 
  (2) transmitter/enc/dataout_ff/q_reg[9]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (24.10, 143.35)] [SINK PIN] 
  (2) transmitter/enc/dataout_ff/q_reg[8]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (18.66, 120.31)] [SINK PIN] 
  (2) transmitter/enc/dataout_ff/q_reg[7]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (18.66, 134.33)] [SINK PIN] 
  (2) transmitter/enc/dataout_ff/q_reg[6]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (18.66, 128.57)] [SINK PIN] 
  (2) transmitter/enc/dataout_ff/q_reg[5]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (18.66, 114.55)] [SINK PIN] 
  (2) transmitter/enc/dataout_ff/q_reg[4]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (18.66, 70.97)] [SINK PIN] 
  (2) transmitter/enc/dataout_ff/q_reg[3]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (18.66, 74.23)] [SINK PIN] 
  (2) transmitter/enc/dataout_ff/q_reg[2]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (19.30, 56.95)] [SINK PIN] 
  (2) transmitter/enc/dataout_ff/q_reg[1]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (31.78, 70.97)] [SINK PIN] 
  (2) transmitter/enc/dataout_ff/q_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (18.66, 140.09)] [SINK PIN] 
  (2) transmitter/enc/valid_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (32.42, 140.09)] [SINK PIN] 
  (2) transmitter/enc/counter_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (33.70, 149.11)] [SINK PIN] 
  (2) receiver/dec/dff_data_in/q_reg[6]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (80.42, 94.01)] [SINK PIN] 
  (2) receiver/dec/dff_data_in/q_reg[2]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (81.38, 117.05)] [SINK PIN] 
  (2) receiver/dec/dff_data_in/q_reg[3]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (87.14, 131.83)] [SINK PIN] 
  (2) receiver/dec/dff_data_in/q_reg[1]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (66.98, 91.51)] [SINK PIN] 
  (2) receiver/dec/dff_data_in/q_reg[9]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (81.06, 85.75)] [SINK PIN] 
  (2) receiver/dec/dff_data_in/q_reg[7]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (90.66, 74.23)] [SINK PIN] 
  (2) receiver/dec/dff_data_in/q_reg[5]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (41.06, 53.69)] [SINK PIN] 
  (2) receiver/dec/dff_data_in/q_reg[4]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (79.78, 103.03)] [SINK PIN] 
  (2) receiver/dec/dff_data_in/q_reg[8]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (79.78, 79.99)] [SINK PIN] 
  (2) receiver/dec/dff_data_in/q_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (63.78, 160.63)] [SINK PIN] 
  (2) receiver/dec/dff_rdispin/q_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (46.50, 70.97)] [SINK PIN] 
  (2) receiver/dec/dec_4b_3b/code_err1_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (66.34, 166.39)] [SINK PIN] 
  (2) receiver/dec/dec_4b_3b/kout1_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (115.62, 163.13)] [SINK PIN] 
  (2) receiver/dec/dec_4b_3b/datout_reg[1]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (111.46, 145.85)] [SINK PIN] 
  (2) receiver/dec/dec_4b_3b/datout_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (112.10, 149.11)] [SINK PIN] 
  (2) receiver/dec/dec_4b_3b/datout_reg[2]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (100.90, 143.35)] [SINK PIN] 
  (2) receiver/dec/dec_6b_5b/kout2_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (39.78, 45.43)] [SINK PIN] 
  (2) receiver/dec/dec_6b_5b/datout_reg[3]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (110.18, 45.43)] [SINK PIN] 
  (2) receiver/dec/dec_6b_5b/datout_reg[2]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (42.98, 62.71)] [SINK PIN] 
  (2) receiver/dec/dec_6b_5b/datout_reg[1]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (79.14, 140.09)] [SINK PIN] 
  (2) receiver/dec/dec_6b_5b/code_err2_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (61.22, 154.87)] [SINK PIN] 
  (2) receiver/dec/dec_6b_5b/disp_err_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (38.18, 39.67)] [SINK PIN] 
  (2) receiver/dec/dec_6b_5b/datout_reg[4]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (106.02, 70.97)] [SINK PIN] 
  (2) receiver/dec/dec_6b_5b/datout_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (66.34, 79.99)] [SINK PIN] 
  (2) receiver/dec/dff_disp_err/q_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (52.90, 79.99)] [SINK PIN] 
  (2) receiver/dec/dff_data_out/q_reg[6]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (122.34, 140.09)] [SINK PIN] 
  (2) receiver/dec/dff_data_out/q_reg[5]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (126.50, 126.07)] [SINK PIN] 
  (2) receiver/dec/dff_data_out/q_reg[3]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (127.14, 56.95)] [SINK PIN] 
  (2) receiver/dec/dff_data_out/q_reg[2]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (130.66, 47.93)] [SINK PIN] 
  (2) receiver/dec/dff_data_out/q_reg[1]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (124.58, 143.35)] [SINK PIN] 
  (2) receiver/dec/dff_data_out/q_reg[0]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (122.34, 74.23)] [SINK PIN] 
  (2) receiver/dec/dff_data_out/q_reg[4]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (122.02, 76.73)] [SINK PIN] 
  (2) receiver/dec/dff_data_out/q_reg[7]/CLK [Ref: saed90nm_max/SDFFARX1] [Location (122.02, 134.33)] [SINK PIN] 
  (2) receiver/dec/ctrl/kout_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (125.86, 172.15)] [SINK PIN] 
  (2) receiver/dec/ctrl/code_err_reg/CLK [Ref: saed90nm_max/SDFFARX1] [Location (79.46, 172.15)] [SINK PIN] 

Printing structure of scan_clk at root pin scan_clk:
(0) scan_clk [in Port] [Location (85.75, 188.18)] [Net: scan_clk] [IMPLICIT IGNORE PIN] [Fanout: 1] 
1
icc2_shell> 
icc2_shell> # ================================================ #
icc2_shell> # ================= Transitions ================== #
icc2_shell> # ================================================ #
icc2_shell> # set_driving_cell -lib_cell */*_BUF_2 -pin Z [get_ports clk_i]
icc2_shell> set_input_transition -rise 0.2 {fun_sclk scan_clk}
1
icc2_shell> set_input_transition -rise 0.3 {fun_pclk}
1
icc2_shell> set_input_transition -fall 0.2 {fun_sclk fun_pclk scan_clk}
1
icc2_shell> 
? ? 
icc2_shell> set_clock_groups -asynchronous     -group {fun_sclk}     -group {fun_pclk}
Warning: Clock groups with same clocks are already set in 'fun_sclk_1'. (UIC-030)
0
icc2_shell> 
icc2_shell> set_false_path -from [get_clocks fun_sclk] -to [get_clocks fun_pclk]
Information: From and to clocks are exclusive or asynchronous clocks. (CSTR-007)
1
icc2_shell> set_false_path -from [get_clocks fun_pclk] -to [get_clocks fun_sclk]
Information: From and to clocks are exclusive or asynchronous clocks. (CSTR-007)
1
icc2_shell> # ================================================ #
icc2_shell> # ============== Clock_Exceptions ================ #
icc2_shell> # ================================================ #
icc2_shell> set_lib_cell_purpose -exclude cts [get_lib_cells -of [get_cells *]]
Information: The design specific attribute override for lib_cell 'saed90nm_max:DELLN2X2.timing' is set in the current block 'SerDes_cts', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed90nm_max:INVX0.timing' is set in the current block 'SerDes_cts', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed90nm_max:INVX32.timing' is set in the current block 'SerDes_cts', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed90nm_max:NAND2X2.timing' is set in the current block 'SerDes_cts', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed90nm_max:INVX1.timing' is set in the current block 'SerDes_cts', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed90nm_max:TIEL.timing' is set in the current block 'SerDes_cts', because the actual library setting may not be overwritten. (ATTR-12)
1
icc2_shell> 
icc2_shell> # ================================================ #
icc2_shell> # ================= CTS_Cells ==================== #
icc2_shell> # ================================================ #
icc2_shell> # ----- Prefred ( High drive strength and INV Cells )
icc2_shell> # ----- INV Prefred to resisitance of wire interconnect and trainstions
icc2_shell> set_lib_cell_purpose -include cts */INVX2 ; # This prefred Cell high Drive strength
Information: The design specific attribute override for lib_cell 'saed90nm_max:INVX2.timing' is set in the current block 'SerDes_cts', because the actual library setting may not be overwritten. (ATTR-12)
1
icc2_shell> set_lib_cell_purpose -include cts */INVX4
Information: The design specific attribute override for lib_cell 'saed90nm_max:INVX4.timing' is set in the current block 'SerDes_cts', because the actual library setting may not be overwritten. (ATTR-12)
1
icc2_shell> set_lib_cell_purpose -include cts */*INVX8 ;
Information: The design specific attribute override for lib_cell 'saed90nm_max:INVX8.timing' is set in the current block 'SerDes_cts', because the actual library setting may not be overwritten. (ATTR-12)
1
icc2_shell> set_lib_cell_purpose -include cts */*INVX16 ;
Information: The design specific attribute override for lib_cell 'saed90nm_max:INVX16.timing' is set in the current block 'SerDes_cts', because the actual library setting may not be overwritten. (ATTR-12)
1
icc2_shell> # ================================================ #
icc2_shell> # ================ Skew & Latency ================ #
icc2_shell> # ================================================ #
icc2_shell> set_clock_tree_options -target_skew 0.1 -clocks [get_clocks {fun_sclk scan_clk}]
1
icc2_shell> set_clock_tree_options -target_skew 0.15 -clocks [get_clocks {fun_pclk}]
1
icc2_shell> set_clock_tree_options -target_latency 0.7  -clocks [get_clocks {fun_pclk scan_clk}]
1
icc2_shell> set_clock_tree_options -target_latency 0.8 -clocks [get_clocks {fun_sclk}]
1
icc2_shell> set_max_capacitance 5 [get_clocks *]
1
icc2_shell> #report_clock_trees
icc2_shell> 
icc2_shell> # ================================================ #
icc2_shell> # ====================== NDR ===================== #
icc2_shell> # ================================================ #
icc2_shell> # defines non-default routing rules in the design.
icc2_shell> create_routing_rule clk_network_NDR -multiplier_spacing 2 -multiplier_width 2
{clk_network_NDR}
icc2_shell> # ----- root:from port to first buffer
icc2_shell> set_clock_routing_rules -net_type root -rules clk_network_NDR -max_routing_layer M7 -min_routing_layer M2
1
icc2_shell> # ----- internal : from first buffer to last buffer before sink
icc2_shell> set_clock_routing_rules -net_type internal -rules clk_network_NDR -max_routing_layer M7 -min_routing_layer M2
1
icc2_shell> # ----- Sink >> from last buffer to sink(leaf) without NDR
icc2_shell> set_clock_routing_rules -net_type sink -default_rule -max_routing_layer M7 -min_routing_layer M2
1
icc2_shell> 
icc2_shell> # over all Rules
icc2_shell> report_routing_rules -verbose
Name     WidthMltplr SpacingMltplr TaperDist DriverTaperDist TaperOverPinLayers TaperUnderPinLayers DriverTaperOverPinLayers DriverTaperUnderPinLayers ParallelWireLayers
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
clk_network_NDR
         2           2

         --------------------------------------------------------------------------------------
         Layer     Width     ShieldWth ShieldSpc Snap2Trck RdlTaperDist RdlTaperWidth Mask
         --------------------------------------------------------------------------------------

         M1        0.28

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.28      hard      0.00

         M2        0.32

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.32      hard      0.00

         M3        0.32

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.32      hard      0.00

         M4        0.32

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.32      hard      0.00

         M5        0.32

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.32      hard      0.00

         M6        0.32

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.32      hard      0.00

         M7        0.32

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.32      hard      0.00

         M8        0.32

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.32      hard      0.00

         M9        0.90

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.90      hard      0.00
1
icc2_shell> # Special Clock net all Rules
icc2_shell> report_clock_routing_rules
****************************************
 Report : clock routing rules
 Design : system
 Date   : Tue Aug 26 08:26:24 2025
****************************************
   Design Base; Net Type: sink;     Rule: default rule; Min Layer: M2; Max Layer: M7
   Design Base; Net Type: internal; Rule: clk_network_NDR; Min Layer: M2; Max Layer: M7
   Design Base; Net Type: root;     Rule: clk_network_NDR; Min Layer: M2; Max Layer: M7

icc2_shell> 
icc2_shell> 
icc2_shell> # ================================================ #
icc2_shell> # ================== DRC/Options ================= #
icc2_shell> # ================================================ #
icc2_shell> set_max_transition -clock_path 0.500 [get_clocks {fun_pclk} ]
1
icc2_shell> set_max_transition -clock_path 0.300 [get_clocks {fun_sclk scan_clk} ]
1
icc2_shell> set_app_options -name cts.common.user_instance_name_prefix -value "CTS_"
cts.common.user_instance_name_prefix CTS_
icc2_shell> # ================================================ #
icc2_shell> # ====================== CRP ===================== #
icc2_shell> # ================================================ #
icc2_shell> # --- To reduce On-Chip Variation (OCV) effects, clock trees try to share as many buffers as possible.
icc2_shell> set_app_options -name time.remove_clock_reconvergence_pessimism -value true
time.remove_clock_reconvergence_pessimism true
icc2_shell> #set_app_options -name cts.compile.e
icc2_shell> report_clock_settings
****************************************
 Report : clock settings
 Design : SerDes_cts
 Date   : Tue Aug 26 08:26:25 2025
****************************************


======================================
Configurations 
======================================

##Global
  Corner = default
    Max transition: 2.000
    Max capacitance: 2.000
    Target skew: 0 (default)
    Target latency: Not specified

##fun_sclk
  Corner = default
    Max transition: 0.300
    Max capacitance: 5.000
    Target skew: 0.100
    Target latency: 0.800

##fun_pclk
  Corner = default
    Max transition: 0.500
    Max capacitance: 5.000
    Target skew: 0.150
    Target latency: 0.700

##scan_clk
  Corner = default
    Max transition: 0.300
    Max capacitance: 5.000
    Target skew: 0.100
    Target latency: 0.700


======================================
Routing Rules 
======================================

##Global
Routing rule for sink nets: Default Min Layer:M2 Max Layer:M7
Routing rule for internal nets: clk_network_NDR  Min Layer:M2 Max Layer:M7
Routing rule for root nets: clk_network_NDR  Min Layer:M2 Max Layer:M7
Routing rule for all nets: Not specified
Net-based routing rules (by set_clock_routing_rule): Not specified
Net-based routing rules (by set_routing_rule): Not specified

##fun_sclk
Routing rule for sink nets: Not specified
Routing rule for internal nets: Not specified
Routing rule for root nets: Not specified
Routing rule for all nets: Not specified
Net-based routing rules (by set_clock_routing_rule): Not specified
Net-based routing rules (by set_routing_rule): Not specified

##fun_pclk
Routing rule for sink nets: Not specified
Routing rule for internal nets: Not specified
Routing rule for root nets: Not specified
Routing rule for all nets: Not specified
Net-based routing rules (by set_clock_routing_rule): Not specified
Net-based routing rules (by set_routing_rule): Not specified

##scan_clk
Routing rule for sink nets: Not specified
Routing rule for internal nets: Not specified
Routing rule for root nets: Not specified
Routing rule for all nets: Not specified
Net-based routing rules (by set_clock_routing_rule): Not specified
Net-based routing rules (by set_routing_rule): Not specified


======================================
Buffers and Inverters 
======================================

##Buffers
Name                                   Area      Max Transition       Max Load
------------------------------------------------------------------------------
saed90nm_max/DELLN1X2                14.746               1.024        416.000
saed90nm_max/DELLN3X2                22.118               1.024        416.000
saed90nm_max/NBUFFX16                26.726               1.024         48.000
saed90nm_max/NBUFFX2                  5.530               1.024         48.000
saed90nm_max/NBUFFX32                55.296               2.048        768.000
saed90nm_max/NBUFFX4                 10.138               1.024         48.000
saed90nm_max/NBUFFX8                 14.746               1.024         48.000
saed90nm_max/AOBUFX1                 22.118               1.024        208.000
saed90nm_max/AOBUFX2                 22.118               1.024        416.000
saed90nm_max/AOBUFX4                 27.648               1.024        832.000

##Inverters
Name                                   Area      Max Transition       Max Load
------------------------------------------------------------------------------
saed90nm_max/IBUFFX16                31.334               1.024       3328.000
saed90nm_max/IBUFFX2                 10.138               1.024        416.000
saed90nm_max/IBUFFX32                56.218               1.024       6656.000
saed90nm_max/IBUFFX4                 12.902               1.024        832.000
saed90nm_max/IBUFFX8                 18.432               1.024       1664.000
saed90nm_max/INVX16                  25.805               1.024       3328.000
saed90nm_max/INVX2                    6.451               1.024        416.000
saed90nm_max/INVX4                    9.216               1.024        832.000
saed90nm_max/INVX8                   14.746               1.024       1664.000
saed90nm_max/AOINVX1                 22.118               1.024        208.000
saed90nm_max/AOINVX2                 22.118               1.024        416.000
saed90nm_max/AOINVX4                 18.432               1.024        832.000


======================================
Spacing Rules 
======================================

##By design
No by design spacing rule is specified

##By clock
No by clock spacing rule is specified

##By libcell
No by libcell spacing rule is specified

##By clock and libcell
No by clock and libcell spacing rule is specified
1
icc2_shell> 
icc2_shell> # ================================================ #
icc2_shell> # ====================== Opt ===================== #
icc2_shell> # ======
icc2_shell> 
icc2_shell> clock_opt -from build_clock -to build_clock
Use advanced legalizer engine : 0
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Information: Design Average RC for design SerDes_cts  (NEX-011)
Information: r = 0.565053 ohm/um, via_r = 0.900000 ohm/cut, c = 0.085266 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.900000 ohm/cut, c = 0.098625 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (150000 150000) (1750000 1734000)
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 2

Running clock synthesis step.

Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (150000 150000) (1750000 1734000)
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 2
remove buffers/inverters in clock fun_pclk:
  no buffer or inverter has been removed
remove buffers/inverters in clock fun_sclk:
  no buffer or inverter has been removed
remove buffers/inverters in clock scan_clk:
  no buffer or inverter has been removed

No buffer or inverter has been removed.
Remove clock trees finished successfully
synthesize_clock_trees
************************************************************
* CTS STEP: Design Initialization for Clock Synthesis
************************************************************
Information: All clock objects will be converted from ideal to propagated clock during CTS. (CTS-105)
Information: CTS will work on the following scenarios. (CTS-101)
   default      (Mode: default; Corner: default)
Information: CTS will work on all clocks in active scenarios, including 3 master clocks and 0 generated clocks. (CTS-107)
Information: Clock derating is disabled

CTS related app options set by user:
   cts.common.user_instance_name_prefix = CTS_

Buffer/Inverter reference list for clock tree synthesis:
   saed90nm_max/DELLN1X2
   saed90nm_max/DELLN3X2
   saed90nm_max/NBUFFX16
   saed90nm_max/NBUFFX2
   saed90nm_max/NBUFFX32
   saed90nm_max/NBUFFX4
   saed90nm_max/NBUFFX8
   saed90nm_max/AOBUFX1
   saed90nm_max/AOBUFX2
   saed90nm_max/AOBUFX4
   saed90nm_max/IBUFFX16
   saed90nm_max/IBUFFX2
   saed90nm_max/IBUFFX32
   saed90nm_max/IBUFFX4
   saed90nm_max/IBUFFX8
   saed90nm_max/INVX16
   saed90nm_max/INVX2
   saed90nm_max/INVX4
   saed90nm_max/INVX8
   saed90nm_max/AOINVX1
   saed90nm_max/AOINVX2
   saed90nm_max/AOINVX4
There is no CTS reference for ICG cells
Information: 'default' is identified as primary corner for initial clock tree building. (CTS-103)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (150000 150000) (1750000 1734000)
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 2
CTS NDR rule list:
   Design Base; Net Type: sink;     Rule: default rule; Min Layer: M2; Max Layer: M7
   Design Base; Net Type: internal; Rule: clk_network_NDR; Min Layer: M2; Max Layer: M7
   Design Base; Net Type: root;     Rule: clk_network_NDR; Min Layer: M2; Max Layer: M7

Clock cell spacing rule list:
   No clock cell spacing rule is found.
Information: The run time for design initialization is 0 hr : 0 min : 0.07 sec, cpu time is 0 hr : 0 min : 0.11 sec. (CTS-104)
************************************************************
* CTS STEP: Existing Clock Tree Removal
************************************************************

No buffer or inverter has been removed.
Information: The run time for existing clock tree removal is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.00 sec. (CTS-104)
************************************************************
* CTS STEP: Clock Tree Initialization
************************************************************
Use advanced legalizer engine : 0
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 56 total shapes.
Layer M2: cached 0 shapes out of 0 total shapes.
Cached 728 vias out of 2693 total vias.
Information: Legalizer's PDC rule check is enabled
Information: Legalizer's advanced rule check is enabled
 Inserted 1 buffer(s)/inverter(s) to separate data paths from clock trees.

Start Auto-Exception Derivations...
 No internal pin was found.
 No conflict pin was found.
 No macro pin was found for clock balance point settings.
 No macro pin was found for disabling self arcs.
Information: The run time for clock tree initialization is 0 hr : 0 min : 0.10 sec, cpu time is 0 hr : 0 min : 0.10 sec. (CTS-104)
Drc Mode Option: auto
Enable multi-thread Tasks, number of thread is 8
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Information: The RC mode used is VR for design 'system'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1509, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 2, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
************************************************************
* CTS STEP: Clock Cell Relocation
************************************************************
Information: Relocated the clock cell 'pclk_mux/U1' from (66.52, 170.52) to (74.52, 101.40). (CTS-106)
Information: Relocated the clock cell 'sclk_mux/U1' from (57.88, 164.76) to (55.64, 124.44). (CTS-106)
A total of 2 clock cells have been relocated
Information: The run time for clock cell relocation is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.00 sec. (CTS-104)
Information: The run time for enable resynthesis is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.00 sec. (CTS-104)
************************************************************
* CTS STEP: Gate-By-Gate Clock Tree Synthesis
************************************************************
-------------------------------------------------------------
 Gate level 2 clock tree synthesis
 driving pin = pclk_mux/U1/Q
 Clocks:
     fun_pclk (default)
 Design rule constraints:
     max transition  = 0.500000
     max capacitance = 2.000000
 Number of load sinks = 59
 Number of ignore points = 0
Information: The RC mode used is VR for design 'system'. (NEX-022)
-------------------------------------------------------------
 Gate level 1 clock tree synthesis
 driving pin = fun_pclk
 Clocks:
     fun_pclk (default)
 Design rule constraints:
     max transition  = 0.500000
     max capacitance = 2.000000
 Number of load sinks = 0
 Number of ignore points = 0
 Number of gates with existing phase delay = 1
    1. Phase delay = (max r/f: 0.785942/__ min r/f: 0.782032/__) : skew = 0.003910 : pclk_mux/U1/IN1
-------------------------------------------------------------
 Gate level 2 clock tree synthesis
 driving pin = sclk_mux/U1/Q
 Clocks:
     fun_sclk (default)
 Design rule constraints:
     max transition  = 0.300000
     max capacitance = 2.000000
 Number of load sinks = 19
 Number of ignore points = 0
-------------------------------------------------------------
 Gate level 1 clock tree synthesis
 driving pin = fun_sclk
 Clocks:
     fun_sclk (default)
 Design rule constraints:
     max transition  = 0.300000
     max capacitance = 2.000000
 Number of load sinks = 0
 Number of ignore points = 0
 Number of gates with existing phase delay = 1
    1. Phase delay = (max r/f: 0.489540/__ min r/f: 0.489120/__) : skew = 0.000420 : sclk_mux/U1/IN1
Information: The run time for gate-by-gate clock tree synthesis is 0 hr : 0 min : 7.50 sec, cpu time is 0 hr : 0 min : 7.52 sec. (CTS-104)
************************************************************
* CTS STEP: DRC Fixing Beyond Exceptions
************************************************************
Information: The run time for DRC fixing beyond exceptions is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.00 sec. (CTS-104)
There are 1 buffers and 0 inverters added (total area 55.30) by Clock Tree Synthesis.
************************************************************
* CTS STEP: Clock Net Global Routing
************************************************************
Warning: Ignore contact DIFFCON. (ZRT-015)
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M8
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Warning: Contact VIA89's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 pitch 0.320 may be too small: wire/via-down 0.315, wire/via-up 0.330. (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 pitch 0.320 may be too small: wire/via-down 0.360, wire/via-up 0.320. (ZRT-026)
Performing initial clock net global routing ...
Loading parastics information to the router ...
parastics information loaded to the router.
Information: The net parasitics of block system are cleared. (TIM-123)
Total number of global routed clock nets: 5
Information: The run time for clock net global routing is 0 hr : 0 min : 0.13 sec, cpu time is 0 hr : 0 min : 0.21 sec. (CTS-104)
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Information: Design SerDes_cts has 1511 nets, 5 global routed, 0 detail routed. (NEX-024)
Information: The RC mode used is CTO for design 'system'. (NEX-022)
Information: Design Average RC for design SerDes_cts  (NEX-011)
Information: r = 0.565053 ohm/um, via_r = 0.900000 ohm/cut, c = 0.085266 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.900000 ohm/cut, c = 0.098625 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1509, routed nets = 5, across physical hierarchy nets = 0, parasitics cached nets = 5, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
************************************************************
* CTS STEP: Pre-Optimization DRC Fixing
************************************************************
-------------------------------------------------------------
Fixing clock: fun_sclk mode: default root: fun_sclk

Clock QoR Before Fixing Clock Tree DRC Violation ...
Clock: fun_sclk, Mode: default, Root: fun_sclk
Information: CTS QoR Pre Initial DRC Fixing: GlobalSkew = 0.0004; ID = 0.4749; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_sclk; Mode = default; Corner = default; ClockRoot = fun_sclk. (CTS-037)

Starting fixing clock tree DRC Violation ...
Resized 0 cell(s), relocated 0 cell(s), cloned 0 cell(s) and inserted 0 buffer(s)/inverter(s)
Cloned 0 non-repeater gate(s)
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock QoR After Fixing Pre-Opt DRC Violation:
Clock: fun_sclk, Mode: default, Root: fun_sclk
Information: CTS QoR Post Initial DRC Fixing: GlobalSkew = 0.0004; ID = 0.4749; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_sclk; Mode = default; Corner = default; ClockRoot = fun_sclk. (CTS-037)
The elapsed time for fixing DRC violation is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.01 sec.
-------------------------------------------------------------
Fixing clock: fun_pclk mode: default root: fun_pclk

Clock QoR Before Fixing Clock Tree DRC Violation ...
Clock: fun_pclk, Mode: default, Root: fun_pclk
Information: CTS QoR Pre Initial DRC Fixing: GlobalSkew = 0.0031; ID = 0.7467; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_pclk; Mode = default; Corner = default; ClockRoot = fun_pclk. (CTS-037)

Starting fixing clock tree DRC Violation ...
Resized 0 cell(s), relocated 0 cell(s), cloned 0 cell(s) and inserted 0 buffer(s)/inverter(s)
Cloned 0 non-repeater gate(s)
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock QoR After Fixing Pre-Opt DRC Violation:
Clock: fun_pclk, Mode: default, Root: fun_pclk
Information: CTS QoR Post Initial DRC Fixing: GlobalSkew = 0.0031; ID = 0.7467; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_pclk; Mode = default; Corner = default; ClockRoot = fun_pclk. (CTS-037)
The elapsed time for fixing DRC violation is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.00 sec.
Information: The run time for pre-optimization DRC fixing is 0 hr : 0 min : 0.01 sec, cpu time is 0 hr : 0 min : 0.01 sec. (CTS-104)
************************************************************
* CTS STEP: Skew Latency Optimization and Area Recovery
************************************************************
-------------------------------------------------------------
Optimizing clock tree
clock: fun_sclk mode: default root: fun_sclk
Clock QoR Before Optimization:
Clock: fun_sclk, Mode: default, Root: fun_sclk
Information: CTS QoR Pre Optimization: GlobalSkew = 0.0004; ID = 0.4749; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_sclk; Mode = default; Corner = default; ClockRoot = fun_sclk. (CTS-037)

Begin Network Flow Based Optimization:
Default network flow optimizer made 0 successful improvements out of 0 iterations
Resized 0, relocated 0, deleted 0, inserted 0, sizeUp Relocated 0 cells
The elapsed time for network flow optimization is 0 hr : 0 min : 0.13 sec, cpu time is 0 hr : 0 min : 0.13 sec.
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock Qor After Network Flow Optimization:
Clock: fun_sclk, Mode: default, Root: fun_sclk
Information: CTS QoR Post Optimization: GlobalSkew = 0.0004; ID = 0.4749; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_sclk; Mode = default; Corner = default; ClockRoot = fun_sclk. (CTS-037)

Begin Layer Optimization:

Beginning layer optimization ...
Clock fun_sclk: 1 nets unchanged because there is no cap variation on their layers
All clocks: total net count: 1
All clocks: total committed/restored net count: 0/0
All clocks: total count of nets with two layers: 0 (skipped)
All clocks: total count of nets with unchanged layers: 1

Ending layer optimization ...

The elapsed time for layer optimization is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.00 sec.
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock Qor After Layer Optimization:
Clock: fun_sclk, Mode: default, Root: fun_sclk
Information: CTS QoR Post Optimization: GlobalSkew = 0.0004; ID = 0.4749; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_sclk; Mode = default; Corner = default; ClockRoot = fun_sclk. (CTS-037)

Begin Area Recovery Buffer Removal:
AR: deleted 0 cell(s)
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock QoR After Area Recovery Removal:
Clock: fun_sclk, Mode: default, Root: fun_sclk
Information: CTS QoR Post Area Recovery: GlobalSkew = 0.0004; ID = 0.4749; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_sclk; Mode = default; Corner = default; ClockRoot = fun_sclk. (CTS-037)

Begin Area Recovery Resizing:
AR: resized 0 out of 1 cell(s)
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock QoR After Area Recovery Resizing:
Clock: fun_sclk, Mode: default, Root: fun_sclk
Information: CTS QoR Post Area Recovery: GlobalSkew = 0.0004; ID = 0.4749; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_sclk; Mode = default; Corner = default; ClockRoot = fun_sclk. (CTS-037)
The elapsed time for area recovery is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.01 sec.
setting userMargin to 0.020000
 After adding delay, the latency is followings.
 The latency of clock fun_sclk (default mode) in default corner is 0.761566
The elapsed time for optimization of clock tree is 0 hr : 0 min : 0.36 sec, cpu time is 0 hr : 0 min : 0.66 sec.
-------------------------------------------------------------
Optimizing clock tree
clock: fun_pclk mode: default root: fun_pclk
Clock QoR Before Optimization:
Clock: fun_pclk, Mode: default, Root: fun_pclk
Information: CTS QoR Pre Optimization: GlobalSkew = 0.0031; ID = 0.7467; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_pclk; Mode = default; Corner = default; ClockRoot = fun_pclk. (CTS-037)

Begin Network Flow Based Optimization:
Default network flow optimizer made 0 successful improvements out of 0 iterations
Resized 0, relocated 0, deleted 0, inserted 0, sizeUp Relocated 0 cells
The elapsed time for network flow optimization is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.00 sec.
Ran incremental ZGR 14 time(s) for 31 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock Qor After Network Flow Optimization:
Clock: fun_pclk, Mode: default, Root: fun_pclk
Information: CTS QoR Post Optimization: GlobalSkew = 0.0031; ID = 0.7467; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_pclk; Mode = default; Corner = default; ClockRoot = fun_pclk. (CTS-037)

Begin Layer Optimization:

Beginning layer optimization ...
Clock fun_pclk: 1 nets unchanged because there is no cap variation on their layers
All clocks: total net count: 1
All clocks: total committed/restored net count: 0/0
All clocks: total count of nets with two layers: 0 (skipped)
All clocks: total count of nets with unchanged layers: 1

Ending layer optimization ...

The elapsed time for layer optimization is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.00 sec.
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock Qor After Layer Optimization:
Clock: fun_pclk, Mode: default, Root: fun_pclk
Information: CTS QoR Post Optimization: GlobalSkew = 0.0031; ID = 0.7467; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_pclk; Mode = default; Corner = default; ClockRoot = fun_pclk. (CTS-037)

Begin Area Recovery Buffer Removal:
AR: deleted 0 cell(s)
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock QoR After Area Recovery Removal:
Clock: fun_pclk, Mode: default, Root: fun_pclk
Information: CTS QoR Post Area Recovery: GlobalSkew = 0.0031; ID = 0.7467; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_pclk; Mode = default; Corner = default; ClockRoot = fun_pclk. (CTS-037)

Begin Area Recovery Resizing:
AR: resized 0 out of 1 cell(s)
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock QoR After Area Recovery Resizing:
Clock: fun_pclk, Mode: default, Root: fun_pclk
Information: CTS QoR Post Area Recovery: GlobalSkew = 0.0031; ID = 0.7467; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_pclk; Mode = default; Corner = default; ClockRoot = fun_pclk. (CTS-037)
The elapsed time for area recovery is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.01 sec.
The elapsed time for optimization of clock tree is 0 hr : 0 min : 0.01 sec, cpu time is 0 hr : 0 min : 0.02 sec.
Information: The run time for skew latency optimization is 0 hr : 0 min : 0.37 sec, cpu time is 0 hr : 0 min : 0.68 sec. (CTS-104)
************************************************************
* CTS STEP: Post-Optimization DRC Fixing
************************************************************
-------------------------------------------------------------
Fixing clock: fun_sclk mode: default root: fun_sclk
Resized 0 cell(s), relocated 0 cell(s), cloned 0 cell(s) and inserted 0 buffer(s)/inverter(s)
Cloned 0 non-repeater gate(s)
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock QoR After Fixing Post-Opt DRC Violation:
Clock: fun_sclk, Mode: default, Root: fun_sclk
Information: CTS QoR Post Final DRC Fixing: GlobalSkew = 0.0004; ID = 0.7619; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 55.2960; ClockCellArea = 68.1984; Clock = fun_sclk; Mode = default; Corner = default; ClockRoot = fun_sclk. (CTS-037)
The elapsed time for fixing DRC violation is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.01 sec.
-------------------------------------------------------------
Fixing clock: fun_pclk mode: default root: fun_pclk
Resized 0 cell(s), relocated 0 cell(s), cloned 0 cell(s) and inserted 0 buffer(s)/inverter(s)
Cloned 0 non-repeater gate(s)
Ran incremental ZGR 0 time(s) for 0 net(s) and restored ZGR 0 time(s) for 0 net(s)
Clock QoR After Fixing Post-Opt DRC Violation:
Clock: fun_pclk, Mode: default, Root: fun_pclk
Information: CTS QoR Post Final DRC Fixing: GlobalSkew = 0.0031; ID = 0.7467; NetsWithDRC = 0; Worst Tran/Cap cost = 0.0000/0.0000; ClockBufArea = 0.0000; ClockCellArea = 12.9024; Clock = fun_pclk; Mode = default; Corner = default; ClockRoot = fun_pclk. (CTS-037)
The elapsed time for fixing DRC violation is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.00 sec.
Information: The run time for post-optimization DRC fixing is 0 hr : 0 min : 0.00 sec, cpu time is 0 hr : 0 min : 0.01 sec. (CTS-104)
All together, ran incremental ZGR 14 time(s) for 31 net(s) and restoring ZGR invoked 0 time(s) for 0 net(s)
There are 1 buffers added and 0 inverters added by Clock Tree Optimization.
************************************************************
* CTS STEP: Postlude
************************************************************
Mark clock trees...
Marking clock synthesized attributes

nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 92 total shapes.
Layer M2: cached 0 shapes out of 3 total shapes.
Cached 728 vias out of 2977 total vias.

Legalizing Top Level Design system ... 
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
       25344         1484        Yes DEFAULT_VA

Warning: max_legality_failures=5000 ignored.
        To use it, set limit_legality_checks to true.
Warning: max_legality_check_range=500 ignored.
        To use it, set limit_legality_checks to true.
Starting legalizer.
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (0 sec)
Legalization complete (0 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                   1484
number of references:                41
number of site rows:                 55
number of locations attempted:    17916
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

number of cells aggregated:        1392 (10743 total sites)
avg row height over cells:        2.880 um
rms cell displacement:            0.278 um ( 0.10 row height)
rms weighted cell displacement:   0.278 um ( 0.10 row height)
max cell displacement:            3.036 um ( 1.05 row height)
avg cell displacement:            0.031 um ( 0.01 row height)
avg weighted cell displacement:   0.031 um ( 0.01 row height)
number of cells moved:               23
number of large displacements:        0
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: transmitter/enc/enc_inst_3b/U162 (INVX0)
  Input location: (98.52,133.08)
  Legal location: (99.48,130.2)
  Displacement:   3.036 um ( 1.05 row height)
Cell: transmitter/enc/enc_inst_3b/U10 (INVX0)
  Input location: (102.36,133.08)
  Legal location: (101.4,135.96)
  Displacement:   3.036 um ( 1.05 row height)
Cell: receiver/dec/dec_4b_3b/U73 (XNOR2X2)
  Input location: (95.96,170.52)
  Legal location: (96.6,167.64)
  Displacement:   2.950 um ( 1.02 row height)
Cell: receiver/ds/U83 (INVX0)
  Input location: (56.28,124.44)
  Legal location: (55.96,121.56)
  Displacement:   2.898 um ( 1.01 row height)
Cell: receiver/dec/dec_4b_3b/U50 (INVX0)
  Input location: (93.08,170.52)
  Legal location: (92.76,167.64)
  Displacement:   2.898 um ( 1.01 row height)
Cell: receiver/dec/dec_4b_3b/U70 (XNOR2X2)
  Input location: (89.24,167.64)
  Legal location: (89.24,164.76)
  Displacement:   2.880 um ( 1.00 row height)
Cell: receiver/dec/dec_4b_3b/U67 (INVX0)
  Input location: (83.16,167.64)
  Legal location: (83.16,170.52)
  Displacement:   2.880 um ( 1.00 row height)
Cell: transmitter/enc/enc_inst_3b/U108 (INVX0)
  Input location: (105.24,133.08)
  Legal location: (105.24,135.96)
  Displacement:   2.880 um ( 1.00 row height)
Cell: receiver/dec/ctrl/U13 (INVX0)
  Input location: (90.2,170.52)
  Legal location: (90.2,167.64)
  Displacement:   2.880 um ( 1.00 row height)
Cell: receiver/dec/dec_4b_3b/U18 (INVX0)
  Input location: (80.28,167.64)
  Legal location: (80.28,164.76)
  Displacement:   2.880 um ( 1.00 row height)

 Successfully legalize placement.
Information: The run time for postlude is 0 hr : 0 min : 0.29 sec, cpu time is 0 hr : 0 min : 0.29 sec. (CTS-104)
************************************************************
* CTS STEP: Summary report
************************************************************
There are 5 flat clock tree nets.
There are 9 non-sink instances (total area 184.32) on clock trees including 0 instances dont_touch.
Clock tree synthesize and optimization added 2 buffers and 0 inverters (total area 110.59).
 Compilation of clock trees finished successfully
 Run time for cts 00:00:08.57u 00:00:00.75s 00:00:08.62e: 

Summary of messages during CTS:
===============================================================
  Tag   Count  Type           Description
---------------------------------------------------------------
 No error or warning message.
1

No clock balance group was found, so skip the balance
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (150000 150000) (1750000 1734000)
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 2
Use advanced legalizer engine : 0
Information: Current block utilization is '0.51230', effective utilization is '0.51542'. (OPT-055)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1510, routed nets = 6, across physical hierarchy nets = 0, parasitics cached nets = 14, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)

    Scenario default  WNS = 0.000000, TNS = 0.000000, NVP = 0

     ELAPSED  WORST NEG TOTAL NEG              MAX       MAX     BUFFER    INVERTER   LVTH      LVTH      PEAK   
      TIME      SLACK     SLACK     AREA    TRAN COST CAP COST    COUNT     COUNT     COUNT    PERCENT   MEMORY  
    --------- --------- --------- --------- --------- --------- --------- --------- --------- --------- ---------
      0:00:15     0.000     0.000 13062.758     0.000     0.000        15      1023         0     0.000       423 



Information: Running auto PG connection. (NDM-099)
1
icc2_shell> 
icc2_shell> clock_opt -from route_clock -to rou
Use advanced legalizer engine : 0
Error: Invalid "-to" option rou
Run "clock_opt -list_only" for ordered list of valid clock_opt sub-steps

Information: Running auto PG connection. (NDM-099)
Error: 0
        Use error_info for more info. (CMD-013)
icc2_shell> 
icc2_shell> clock_opt -from route_clock -to final_opto
Use advanced legalizer engine : 0
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (150000 150000) (1750000 1734000)
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 2

Running clock routing step.
set_app_options -as_user_default -list {route.global.global_route_topology_style 1}
route.global.global_route_topology_style 1
route_group -all_clock_nets -reuse_existing_global_route true
Warning: Ignore contact DIFFCON. (ZRT-015)
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M8
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Warning: Contact VIA89's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 pitch 0.320 may be too small: wire/via-down 0.315, wire/via-up 0.330. (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 pitch 0.320 may be too small: wire/via-down 0.360, wire/via-up 0.320. (ZRT-026)
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used   72  Alloctr   73  Proc 1657 
GR will route in ATREE-style.
Printing options for 'route.common.*'

Printing options for 'route.global.*'
global.deterministic                                    :        off                 
global.global_route_topology_style                      :        1                   
global.placement_timing_driven_mode                     :        false               
global.timing_driven                                    :        false               

Begin global routing.
Loading parastics information to the router ...
parastics information loaded to the router.
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00,0.00,190.00,188.40)
Number of routing layers = 9
layer M1, dir Hor, min width = 0.14, min space = 0.14 pitch = 0.32
layer M2, dir Ver, min width = 0.16, min space = 0.16 pitch = 0.32
layer M3, dir Hor, min width = 0.16, min space = 0.16 pitch = 0.64
layer M4, dir Ver, min width = 0.16, min space = 0.16 pitch = 0.64
layer M5, dir Hor, min width = 0.16, min space = 0.16 pitch = 1.28
layer M6, dir Ver, min width = 0.16, min space = 0.16 pitch = 1.28
layer M7, dir Hor, min width = 0.16, min space = 0.16 pitch = 2.56
layer M8, dir Ver, min width = 0.16, min space = 0.16 pitch = 3.84
layer M9, dir Hor, min width = 0.45, min space = 0.45 pitch = 5.12
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Tech Data] Total (MB): Used   73  Alloctr   74  Proc 1657 
Net statistics:
Total number of nets     = 1518
Number of nets to route  = 6
Number of single or zero port nets = 6
Number of nets with min-layer-mode soft = 5
Number of nets with min-layer-mode soft-cost-medium = 5
Number of nets with max-layer-mode hard = 5
6 nets are fully connected,
 of which 0 are detail routed and 6 are global routed.
3 nets have non-default rule clk_network_NDR
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   73  Alloctr   75  Proc 1657 
Average gCell capacity  4.35     on layer (1)    M1
Average gCell capacity  8.38     on layer (2)    M2
Average gCell capacity  4.30     on layer (3)    M3
Average gCell capacity  4.20     on layer (4)    M4
Average gCell capacity  2.16     on layer (5)    M5
Average gCell capacity  2.13     on layer (6)    M6
Average gCell capacity  1.09     on layer (7)    M7
Average gCell capacity  0.56     on layer (8)    M8
Average gCell capacity  0.38     on layer (9)    M9
Average number of tracks per gCell 9.06  on layer (1)    M1
Average number of tracks per gCell 9.00  on layer (2)    M2
Average number of tracks per gCell 4.55  on layer (3)    M3
Average number of tracks per gCell 4.52  on layer (4)    M4
Average number of tracks per gCell 2.29  on layer (5)    M5
Average number of tracks per gCell 2.27  on layer (6)    M6
Average number of tracks per gCell 1.15  on layer (7)    M7
Average number of tracks per gCell 0.77  on layer (8)    M8
Average number of tracks per gCell 0.58  on layer (9)    M9
Number of gCells = 38610
Current Stage stats:
[End of Build Congestion map] Elapsed real time: 0:00:00 
[End of Build Congestion map] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Congestion map] Stage (MB): Used    1  Alloctr    1  Proc    0 
[End of Build Congestion map] Total (MB): Used   74  Alloctr   76  Proc 1657 
Information: RC layer preference is turned on for this design. (ZRT-613)
Total stats:
[End of Build Data] Elapsed real time: 0:00:00 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Data] Stage (MB): Used    2  Alloctr    2  Proc    0 
[End of Build Data] Total (MB): Used   74  Alloctr   76  Proc 1657 
Current Stage stats:
[End of Blocked Pin Detection] Elapsed real time: 0:00:00 
[End of Blocked Pin Detection] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Blocked Pin Detection] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Blocked Pin Detection] Total (MB): Used   74  Alloctr   76  Proc 1657 
Information: Using 8 threads for routing. (ZRT-444)
multi gcell levels ON

Start GR phase 0
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:00 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Initial Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Initial Routing] Total (MB): Used   74  Alloctr   76  Proc 1657 
Initial. Routing result:
Initial. Both Dirs: Overflow =     0 Max = 0 GRCs =     0 (0.00%)
Initial. H routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. V routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M1         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 1266.79
Initial. Layer M1 wire length = 21.41
Initial. Layer M2 wire length = 3.04
Initial. Layer M3 wire length = 516.88
Initial. Layer M4 wire length = 651.08
Initial. Layer M5 wire length = 74.39
Initial. Layer M6 wire length = 0.00
Initial. Layer M7 wire length = 0.00
Initial. Layer M8 wire length = 0.00
Initial. Layer M9 wire length = 0.00
Initial. Total Number of Contacts = 284
Initial. Via VIA12C count = 85
Initial. Via VIA23C count = 88
Initial. Via VIA34C count = 105
Initial. Via VIA45C count = 6
Initial. Via VIA56C count = 0
Initial. Via VIA67C count = 0
Initial. Via VIA78C count = 0
Initial. Via VIA89C count = 0
Initial. completed.

Start GR phase 1
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used   74  Alloctr   76  Proc 1657 
phase1. Routing result:
phase1. Both Dirs: Overflow =     0 Max = 0 GRCs =     0 (0.00%)
phase1. H routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. V routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M1         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 1266.79
phase1. Layer M1 wire length = 21.41
phase1. Layer M2 wire length = 3.04
phase1. Layer M3 wire length = 516.88
phase1. Layer M4 wire length = 651.08
phase1. Layer M5 wire length = 74.39
phase1. Layer M6 wire length = 0.00
phase1. Layer M7 wire length = 0.00
phase1. Layer M8 wire length = 0.00
phase1. Layer M9 wire length = 0.00
phase1. Total Number of Contacts = 284
phase1. Via VIA12C count = 85
phase1. Via VIA23C count = 88
phase1. Via VIA34C count = 105
phase1. Via VIA45C count = 6
phase1. Via VIA56C count = 0
phase1. Via VIA67C count = 0
phase1. Via VIA78C count = 0
phase1. Via VIA89C count = 0
phase1. completed.

Start GR phase 2
Current Stage stats:
[End of Phase2 Routing] Elapsed real time: 0:00:00 
[End of Phase2 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase2 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase2 Routing] Total (MB): Used   74  Alloctr   76  Proc 1657 
phase2. Routing result:
phase2. Both Dirs: Overflow =     0 Max = 0 GRCs =     0 (0.00%)
phase2. H routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. V routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M1         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase2. Total Wire Length = 1266.79
phase2. Layer M1 wire length = 21.41
phase2. Layer M2 wire length = 3.04
phase2. Layer M3 wire length = 516.88
phase2. Layer M4 wire length = 651.08
phase2. Layer M5 wire length = 74.39
phase2. Layer M6 wire length = 0.00
phase2. Layer M7 wire length = 0.00
phase2. Layer M8 wire length = 0.00
phase2. Layer M9 wire length = 0.00
phase2. Total Number of Contacts = 284
phase2. Via VIA12C count = 85
phase2. Via VIA23C count = 88
phase2. Via VIA34C count = 105
phase2. Via VIA45C count = 6
phase2. Via VIA56C count = 0
phase2. Via VIA67C count = 0
phase2. Via VIA78C count = 0
phase2. Via VIA89C count = 0
phase2. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:00 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Whole Chip Routing] Stage (MB): Used    2  Alloctr    2  Proc    0 
[End of Whole Chip Routing] Total (MB): Used   74  Alloctr   76  Proc 1657 

Information: Global Routing terminated early: true (ZRT-103)

Congestion utilization per direction:
Average vertical track utilization   =  0.53 %
Peak    vertical track utilization   = 50.00 %
Average horizontal track utilization =  0.55 %
Peak    horizontal track utilization = 28.57 %

Current Stage stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used    0  Alloctr    0  Proc    0 
[GR: Done] Total (MB): Used   74  Alloctr   75  Proc 1657 
GR Total stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used    1  Alloctr    1  Proc    0 
[GR: Done] Total (MB): Used   74  Alloctr   75  Proc 1657 
Updating congestion ...
Updating congestion ...
Final total stats:
[End of Global Routing] Elapsed real time: 0:00:00 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Global Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Global Routing] Total (MB): Used   72  Alloctr   74  Proc 1657 

Start track assignment

Printing options for 'route.common.*'

Printing options for 'route.track.*'
track.timing_driven                                     :        false               

Information: Using 8 threads for routing. (ZRT-444)
Information: RC layer preference is turned on for this design. (ZRT-613)

[Track Assign: Read routes] Elapsed real time: 0:00:00 
[Track Assign: Read routes] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Track Assign: Read routes] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Track Assign: Read routes] Total (MB): Used   68  Alloctr   70  Proc 1657 

Start initial assignment

Assign Horizontal partitions, iteration 0
Routed partition 1/65      
Routed partition 3/65      
Routed partition 5/65      
Routed partition 7/65      
Routed partition 8/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 10/65     
Routed partition 11/65     
Routed partition 12/65     
Routed partition 13/65     
Routed partition 14/65     
Routed partition 15/65     
Routed partition 16/65     
Routed partition 17/65     
Routed partition 18/65     
Routed partition 19/65     
Routed partition 20/65     
Routed partition 21/65     
Routed partition 22/65     
Routed partition 23/65     
Routed partition 24/65     
Routed partition 25/65     
Routed partition 26/65     
Routed partition 27/65     
Routed partition 28/65     
Routed partition 29/65     
Routed partition 30/65     
Routed partition 31/65     
Routed partition 32/65     
Routed partition 33/65     
Routed partition 34/65     
Routed partition 35/65     
Routed partition 36/65     
Routed partition 37/65     
Routed partition 38/65     
Routed partition 39/65     
Routed partition 40/65     
Routed partition 41/65     
Routed partition 42/65     
Routed partition 43/65     
Routed partition 44/65     
Routed partition 45/65     
Routed partition 46/65     
Routed partition 47/65     
Routed partition 48/65     
Routed partition 49/65     
Routed partition 50/65     
Routed partition 51/65     
Routed partition 52/65     
Routed partition 53/65     
Routed partition 54/65     
Routed partition 55/65     
Routed partition 56/65     
Routed partition 57/65     
Routed partition 58/65     
Routed partition 59/65     
Routed partition 60/65     
Routed partition 61/65     
Routed partition 62/65     
Routed partition 63/65     
Routed partition 64/65     
Routed partition 65/65     

Assign Vertical partitions, iteration 0
Routed partition 1/66      
Routed partition 3/66      
Routed partition 5/66      
Routed partition 5/66      
Routed partition 5/66      
Routed partition 6/66      
Routed partition 7/66      
Routed partition 8/66      
Routed partition 9/66      
Routed partition 10/66     
Routed partition 11/66     
Routed partition 12/66     
Routed partition 13/66     
Routed partition 14/66     
Routed partition 15/66     
Routed partition 16/66     
Routed partition 17/66     
Routed partition 18/66     
Routed partition 19/66     
Routed partition 20/66     
Routed partition 21/66     
Routed partition 22/66     
Routed partition 23/66     
Routed partition 24/66     
Routed partition 25/66     
Routed partition 26/66     
Routed partition 27/66     
Routed partition 28/66     
Routed partition 29/66     
Routed partition 30/66     
Routed partition 31/66     
Routed partition 32/66     
Routed partition 33/66     
Routed partition 34/66     
Routed partition 35/66     
Routed partition 36/66     
Routed partition 37/66     
Routed partition 38/66     
Routed partition 39/66     
Routed partition 40/66     
Routed partition 41/66     
Routed partition 42/66     
Routed partition 43/66     
Routed partition 44/66     
Routed partition 45/66     
Routed partition 46/66     
Routed partition 47/66     
Routed partition 48/66     
Routed partition 49/66     
Routed partition 50/66     
Routed partition 51/66     
Routed partition 52/66     
Routed partition 53/66     
Routed partition 54/66     
Routed partition 55/66     
Routed partition 56/66     
Routed partition 57/66     
Routed partition 58/66     
Routed partition 59/66     
Routed partition 60/66     
Routed partition 61/66     
Routed partition 62/66     
Routed partition 63/66     
Routed partition 64/66     
Routed partition 65/66     
Routed partition 66/66     

Number of wires with overlap after iteration 0 = 105 of 364


[Track Assign: Iteration 0] Elapsed real time: 0:00:02 
[Track Assign: Iteration 0] Elapsed cpu  time: sys=0:00:02 usr=0:00:06 total=0:00:08
[Track Assign: Iteration 0] Stage (MB): Used    0  Alloctr    0  Proc  262 
[Track Assign: Iteration 0] Total (MB): Used   69  Alloctr   70  Proc 1920 

Reroute to fix overlaps

Assign Horizontal partitions, iteration 1
Routed partition 1/65      
Routed partition 3/65      
Routed partition 5/65      
Routed partition 7/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 10/65     
Routed partition 14/65     
Routed partition 14/65     
Routed partition 14/65     
Routed partition 14/65     
Routed partition 15/65     
Routed partition 16/65     
Routed partition 17/65     
Routed partition 18/65     
Routed partition 19/65     
Routed partition 20/65     
Routed partition 21/65     
Routed partition 22/65     
Routed partition 23/65     
Routed partition 24/65     
Routed partition 25/65     
Routed partition 26/65     
Routed partition 27/65     
Routed partition 28/65     
Routed partition 32/65     
Routed partition 32/65     
Routed partition 32/65     
Routed partition 32/65     
Routed partition 33/65     
Routed partition 34/65     
Routed partition 35/65     
Routed partition 36/65     
Routed partition 37/65     
Routed partition 38/65     
Routed partition 39/65     
Routed partition 40/65     
Routed partition 41/65     
Routed partition 42/65     
Routed partition 43/65     
Routed partition 44/65     
Routed partition 45/65     
Routed partition 46/65     
Routed partition 47/65     
Routed partition 48/65     
Routed partition 49/65     
Routed partition 50/65     
Routed partition 51/65     
Routed partition 52/65     
Routed partition 53/65     
Routed partition 54/65     
Routed partition 55/65     
Routed partition 56/65     
Routed partition 57/65     
Routed partition 58/65     
Routed partition 59/65     
Routed partition 60/65     
Routed partition 61/65     
Routed partition 62/65     
Routed partition 63/65     
Routed partition 64/65     
Routed partition 65/65     

Assign Vertical partitions, iteration 1
Routed partition 1/66      
Routed partition 4/66      
Routed partition 5/66      
Routed partition 5/66      
Routed partition 5/66      
Routed partition 6/66      
Routed partition 7/66      
Routed partition 8/66      
Routed partition 9/66      
Routed partition 10/66     
Routed partition 11/66     
Routed partition 12/66     
Routed partition 13/66     
Routed partition 14/66     
Routed partition 15/66     
Routed partition 16/66     
Routed partition 17/66     
Routed partition 18/66     
Routed partition 19/66     
Routed partition 20/66     
Routed partition 21/66     
Routed partition 22/66     
Routed partition 23/66     
Routed partition 24/66     
Routed partition 25/66     
Routed partition 26/66     
Routed partition 27/66     
Routed partition 28/66     
Routed partition 29/66     
Routed partition 30/66     
Routed partition 31/66     
Routed partition 32/66     
Routed partition 33/66     
Routed partition 34/66     
Routed partition 35/66     
Routed partition 36/66     
Routed partition 37/66     
Routed partition 38/66     
Routed partition 39/66     
Routed partition 40/66     
Routed partition 41/66     
Routed partition 42/66     
Routed partition 43/66     
Routed partition 44/66     
Routed partition 45/66     
Routed partition 46/66     
Routed partition 47/66     
Routed partition 48/66     
Routed partition 49/66     
Routed partition 50/66     
Routed partition 51/66     
Routed partition 52/66     
Routed partition 53/66     
Routed partition 54/66     
Routed partition 55/66     
Routed partition 56/66     
Routed partition 57/66     
Routed partition 58/66     
Routed partition 59/66     
Routed partition 60/66     
Routed partition 61/66     
Routed partition 62/66     
Routed partition 63/66     
Routed partition 64/66     
Routed partition 65/66     
Routed partition 66/66     

[Track Assign: Iteration 1] Elapsed real time: 0:00:02 
[Track Assign: Iteration 1] Elapsed cpu  time: sys=0:00:02 usr=0:00:09 total=0:00:11
[Track Assign: Iteration 1] Stage (MB): Used    0  Alloctr    0  Proc  262 
[Track Assign: Iteration 1] Total (MB): Used   69  Alloctr   70  Proc 1920 

Number of wires with overlap after iteration 1 = 18 of 272


Wire length and via report:
---------------------------
Number of M1 wires: 18           POLYCON: 0
Number of M2 wires: 54           VIA12C: 85
Number of M3 wires: 116                  VIA23C: 88
Number of M4 wires: 81           VIA34C: 105
Number of M5 wires: 3            VIA45C: 7
Number of M6 wires: 0            VIA56C: 0
Number of M7 wires: 0            VIA67C: 0
Number of M8 wires: 0            VIA78C: 0
Number of M9 wires: 0            VIA89C: 0
Total number of wires: 272               vias: 285

Total M1 wire length: 3.6
Total M2 wire length: 25.0
Total M3 wire length: 553.4
Total M4 wire length: 644.0
Total M5 wire length: 73.6
Total M6 wire length: 0.0
Total M7 wire length: 0.0
Total M8 wire length: 0.0
Total M9 wire length: 0.0
Total wire length: 1299.6

Longest M1 wire length: 0.2
Longest M2 wire length: 1.6
Longest M3 wire length: 42.5
Longest M4 wire length: 83.8
Longest M5 wire length: 44.2
Longest M6 wire length: 0.0
Longest M7 wire length: 0.0
Longest M8 wire length: 0.0
Longest M9 wire length: 0.0


[Track Assign: Done] Elapsed real time: 0:00:02 
[Track Assign: Done] Elapsed cpu  time: sys=0:00:02 usr=0:00:09 total=0:00:11
[Track Assign: Done] Stage (MB): Used    0  Alloctr    0  Proc  262 
[Track Assign: Done] Total (MB): Used   68  Alloctr   69  Proc 1920 
Printing options for 'route.common.*'

Printing options for 'route.detail.*'
detail.force_end_on_preferred_grid                      :        true                
detail.timing_driven                                    :        false               

Printing options for 'route.auto_via_ladder.*'

Information: RC layer preference is turned on for this design. (ZRT-613)
[Dr init] Elapsed real time: 0:00:00 
[Dr init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Dr init] Stage (MB): Used    5  Alloctr    5  Proc    0 
[Dr init] Total (MB): Used   74  Alloctr   75  Proc 1920 
Total number of nets = 1518, of which 0 are not extracted
Total number of open nets = 1506, of which 0 are frozen
Information: Using 8 threads for routing. (ZRT-444)
Start DR iteration 0: uniform partition
Routed  3/49 Partitions, Violations =   0
Routed  5/49 Partitions, Violations =   0
Routed  6/49 Partitions, Violations =   0
Routed  7/49 Partitions, Violations =   0
Routed  9/49 Partitions, Violations =   0
Routed  10/49 Partitions, Violations =  0
Routed  12/49 Partitions, Violations =  2
Routed  13/49 Partitions, Violations =  1
Routed  16/49 Partitions, Violations =  4
Routed  17/49 Partitions, Violations =  4
Routed  20/49 Partitions, Violations =  4
Routed  21/49 Partitions, Violations =  4
Routed  22/49 Partitions, Violations =  4
Routed  23/49 Partitions, Violations =  4
Routed  24/49 Partitions, Violations =  4
Routed  25/49 Partitions, Violations =  4
Routed  27/49 Partitions, Violations =  5
Routed  31/49 Partitions, Violations =  5
Routed  35/49 Partitions, Violations =  5
Routed  40/49 Partitions, Violations =  5
Routed  41/49 Partitions, Violations =  5
Routed  42/49 Partitions, Violations =  6
Routed  43/49 Partitions, Violations =  4
Routed  44/49 Partitions, Violations =  4
Routed  45/49 Partitions, Violations =  4
Routed  46/49 Partitions, Violations =  4
Routed  47/49 Partitions, Violations =  4
Routed  48/49 Partitions, Violations =  4
Routed  49/49 Partitions, Violations =  4

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      4
        Diff net spacing : 4

[Iter 0] Elapsed real time: 0:00:00 
[Iter 0] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Iter 0] Stage (MB): Used   14  Alloctr   14  Proc    0 
[Iter 0] Total (MB): Used   83  Alloctr   84  Proc 1920 

End DR iteration 0 with 49 parts

Start DR iteration 1: non-uniform partition
Routed  1/4 Partitions, Violations =    3
Routed  2/4 Partitions, Violations =    2
Routed  3/4 Partitions, Violations =    1
Routed  4/4 Partitions, Violations =    0

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      0

[Iter 1] Elapsed real time: 0:00:00 
[Iter 1] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Iter 1] Stage (MB): Used   14  Alloctr   14  Proc    0 
[Iter 1] Total (MB): Used   83  Alloctr   84  Proc 1920 

End DR iteration 1 with 4 parts

Finish DR since reached 0 DRC

Information: Detail Routing terminated early because DRCs were not converging: false (ZRT-312)
[DR] Elapsed real time: 0:00:00 
[DR] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DR] Stage (MB): Used    0  Alloctr    0  Proc    0 
[DR] Total (MB): Used   68  Alloctr   70  Proc 1920 
[DR: Done] Elapsed real time: 0:00:00 
[DR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DR: Done] Stage (MB): Used    0  Alloctr    0  Proc    0 
[DR: Done] Total (MB): Used   68  Alloctr   70  Proc 1920 

DR finished with 0 open nets, of which 0 are frozen

DR finished with 0 violations

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      0



Total Wire Length =                    1302 micron
Total Number of Contacts =             281
Total Number of Wires =                268
Total Number of PtConns =              32
Total Number of Routed Wires =       268
Total Routed Wire Length =           1295 micron
Total Number of Routed Contacts =       281
        Layer          M1 :          0 micron
        Layer          M2 :         38 micron
        Layer          M3 :        547 micron
        Layer          M4 :        644 micron
        Layer          M5 :         74 micron
        Layer          M6 :          0 micron
        Layer          M7 :          0 micron
        Layer          M8 :          0 micron
        Layer          M9 :          0 micron
        Via        VIA45C :          6
        Via        VIA34C :          6
        Via   VIA34C(rot) :         97
        Via        VIA23C :         87
        Via   VIA12C(rot) :         67
        Via   VIA12B(rot) :         18

 
Redundant via conversion report:
--------------------------------

  Total optimized via conversion rate =  0.00% (0 / 281 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (87      vias)
    Layer VIA3       =  0.00% (0      / 103     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (103     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (6       vias)
 
  Total double via conversion rate    =  0.00% (0 / 281 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
    Layer VIA3       =  0.00% (0      / 103     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
 
  The optimized via conversion rate based on total routed via count =  0.00% (0 / 281 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (87      vias)
    Layer VIA3       =  0.00% (0      / 103     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (103     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (6       vias)
 

Total number of nets = 1518
0 open nets, of which 0 are frozen
Total number of excluded ports = 0 ports of 0 unplaced cells connected to 0 nets
                                 0 ports without pins of 0 cells connected to 0 nets
                                 0 ports of 0 cover cells connected to 0 non-pg nets
Total number of DRCs = 0
Total number of antenna violations = antenna checking not active
Information: Routes in non-preferred voltage areas = 0 (ZRT-559)

Topology ECO not run, no qualifying violations or in frozen nets.
Updating the database ...
Information: The net parasitics of block system are cleared. (TIM-123)
set_app_options -as_user_default -list {route.global.global_route_topology_style 0}
route.global.global_route_topology_style 0
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Begin building search trees for block SerDes.dlib:SerDes_cts.design
Done building search trees for block SerDes.dlib:SerDes_cts.design (time 0s)
Information: Design SerDes_cts has 1512 nets, 0 global routed, 6 detail routed. (NEX-024)
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Information: The RC mode used is CTO for design 'system'. (NEX-022)
Information: Design Average RC for design SerDes_cts  (NEX-011)
Information: r = 0.565053 ohm/um, via_r = 0.900000 ohm/cut, c = 0.085014 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.900000 ohm/cut, c = 0.098436 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1510, routed nets = 6, across physical hierarchy nets = 0, parasitics cached nets = 6, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)

Mode:default          Latency(early)   Latency(late)
Clock        Updated   rise    fall    rise    fall   Corner
------------------------------------------------------------
fun_sclk     Yes     0.7551  0.7551  0.7666  0.7666   default
fun_pclk     Yes     0.7269  0.7269  0.7536  0.7536   default
scan_clk     Yes         --      --      --      --   default


Information: The net parasitics of block system are cleared. (TIM-123)
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Information: Design SerDes_cts has 1512 nets, 0 global routed, 6 detail routed. (NEX-024)
Information: The RC mode used is CTO for design 'system'. (NEX-022)
Information: Design Average RC for design SerDes_cts  (NEX-011)
Information: r = 0.565053 ohm/um, via_r = 0.900000 ohm/cut, c = 0.085014 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.900000 ohm/cut, c = 0.098436 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1510, routed nets = 6, across physical hierarchy nets = 0, parasitics cached nets = 1510, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
npo-clock-opt command begin                   CPU:    25 s (  0.01 hr )  ELAPSE:    19 s (  0.01 hr )  MEM-PEAK:   686 MB
Information: Removed 9 routing shapes from 1977 signal nets

npo-clock-opt timing update complete          CPU:    25 s (  0.01 hr )  ELAPSE:    19 s (  0.01 hr )  MEM-PEAK:   686 MB
INFO: Propagating Switching Activities
INFO: Switching Activity propagation took     0.00002 sec

npo-clock-opt initial QoR
_________________________
Scenario Mapping Table
1: default

Pathgroup Mapping Table
1: **default**
2: **async_default**
3: **clock_gating_default**
4: **in2reg_default**
5: **reg2out_default**
6: **in2out_default**
7: fun_sclk
8: fun_pclk
9: scan_clk

-----------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS    NSV      WHV        THV    NHV
    1   1   0.0000     0.0000      0   0.0000     0.0000      0
    1   2   0.0000     0.0000      0   0.0000     0.0000      0
    1   3   0.0000     0.0000      0   0.0000     0.0000      0
    1   4   0.0000     0.0000      0   0.0000     0.0000      0
    1   5   0.0000     0.0000      0   0.0000     0.0000      0
    1   6   0.0000     0.0000      0   0.0000     0.0000      0
    1   7   0.0000     0.0000      0   0.0000     0.0000      0
    1   8   0.0000     0.0000      0   0.0000     0.0000      0
    1   9   0.0000     0.0000      0   0.0000     0.0000      0
--------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage
    1   *   0.0000     0.0000      0   0.0000     0.0000      0        -          -        -          -
--------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage         Area    InstCnt     BufCnt     InvCnt
    *   *   0.0000     0.0000      0   0.0000     0.0000      0        -          -        -          -     13062.76       1484         15       1023
--------------------------------------------------------------------------------------------------------------------

npo-clock-opt initial QoR Summary       WNS        TNS    NSV      WHV        THV    NHV  MaxTrnV  MaxCapV    Leakage         Area    InstCnt
npo-clock-opt initial QoR Summary    0.0000     0.0000      0   0.0000     0.0000      0        -        -          -     13062.76       1484
Information: The netlist and extraction change observers are disabled for further incremental timing updates during on-route optimization. (TIM-119)
INFO: using 8 threads
INFO: Cluster Analysis Failed to get worst leakage scenario
npo-clock-opt initialization complete         CPU:    26 s (  0.01 hr )  ELAPSE:    19 s (  0.01 hr )  MEM-PEAK:   686 MB
Use advanced legalizer engine : 0
npo-clock-opt optimization summary            SETUP-COST HOLD-COST LDRC-COST        AREA       POWER     ELAPSE (hr)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (150000 150000) (1750000 1734000)
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 2
Information: The netlist and extraction change observers are enabled for further incremental timing updates. (TIM-120)
Use advanced legalizer engine : 0

Running post-clock optimization step.
Turning on CRPR.

Use advanced legalizer engine : 0
npo-clock-opt optimization Phase 3 Iter  1          0.00      0.00         0       0.013           -           0.005
ORB: timingScenario default timingCorner default
INFO: No leakage and power scenarios. Using regular scenarios instead.
INFO: No active leakage scenarios. Leakage will be turned off
ORB: Nominal = 0.181379  Design MT = 2.000000  Target = 1.259893 (6.946 nominal)  MaxRC = 0.524430
ORB: timingScenario default timingCorner default
INFO: No leakage and power scenarios. Using regular scenarios instead.
INFO: No active leakage scenarios. Leakage will be turned off
ORB: Nominal = 0.181379  Design MT = 2.000000  Target = 1.259893 (6.946 nominal)  MaxRC = 0.524430
npo-clock-opt optimization Phase 3 Iter  2          0.00      0.00         0       0.013           -           0.005

npo-clock-opt optimization Phase 4 Iter  1          0.00      0.00         0       0.013           -           0.005
Running post-clock timing-driven placement.
Information: Current block utilization is '0.51230', effective utilization is '0.51542'. (OPT-055)
----------------------------------------------------------------
Running congestion-aware direct-timing-driven placement
Information: Current block utilization is '0.51230', effective utilization is '0.51542'. (OPT-055)
chip utilization before DTDP: 0.52
Start Timing-driven placement

Placement Options:
Effort:                        medium_effort       
Timing Driven:                 true                
Buffering Aware Timing Driven: false               
Seed locs:                     true                
Incremental:                   false               
Congestion:                    true                
Congestion Effort:             medium              

Printing options for 'place.coarse.*' (non-default only)
place.coarse.congestion_driven_max_util                 :        0.7                 

Start transferring placement data.
Completed transferring placement data.
Use advanced legalizer engine : 0
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used    5  Alloctr    5  Proc 1992 
Printing options for 'route.common.*'

Printing options for 'route.global.*'
global.crosstalk_driven                                 :        false               
global.deterministic                                    :        off                 
global.global_route_topology_style                      :        0                   
global.placement_timing_driven_mode                     :        false               
global.timing_driven                                    :        false               

Begin global routing.
Warning: Ignore contact DIFFCON. (ZRT-015)
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M8
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 pitch 0.320 may be too small: wire/via-down 0.315, wire/via-up 0.330. (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 pitch 0.320 may be too small: wire/via-down 0.360, wire/via-up 0.320. (ZRT-026)
Current Stage stats:
[End of Read DB] Elapsed real time: 0:00:00 
[End of Read DB] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Read DB] Stage (MB): Used   67  Alloctr   68  Proc   32 
[End of Read DB] Total (MB): Used   72  Alloctr   74  Proc 2024 
Loading parastics information to the router ...
parastics information loaded to the router.
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00,0.00,190.00,188.40)
Number of routing layers = 9
layer M1, dir Hor, min width = 0.14, min space = 0.14 pitch = 0.32
layer M2, dir Ver, min width = 0.16, min space = 0.16 pitch = 0.32
layer M3, dir Hor, min width = 0.16, min space = 0.16 pitch = 0.64
layer M4, dir Ver, min width = 0.16, min space = 0.16 pitch = 0.64
layer M5, dir Hor, min width = 0.16, min space = 0.16 pitch = 1.28
layer M6, dir Ver, min width = 0.16, min space = 0.16 pitch = 1.28
layer M7, dir Hor, min width = 0.16, min space = 0.16 pitch = 2.56
layer M8, dir Ver, min width = 0.16, min space = 0.16 pitch = 3.84
layer M9, dir Hor, min width = 0.45, min space = 0.45 pitch = 5.12
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Tech Data] Total (MB): Used   73  Alloctr   74  Proc 2024 
Net statistics:
Total number of nets     = 1518
Number of nets to route  = 1507
Number of single or zero port nets = 6
Number of nets with min-layer-mode soft = 5
Number of nets with min-layer-mode soft-cost-medium = 5
Number of nets with max-layer-mode hard = 5
5 nets are fully connected,
 of which 5 are detail routed and 0 are global routed.
3 nets have non-default rule clk_network_NDR
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   73  Alloctr   75  Proc 2024 
Average gCell capacity  4.35     on layer (1)    M1
Average gCell capacity  8.38     on layer (2)    M2
Average gCell capacity  4.29     on layer (3)    M3
Average gCell capacity  4.19     on layer (4)    M4
Average gCell capacity  2.16     on layer (5)    M5
Average gCell capacity  2.13     on layer (6)    M6
Average gCell capacity  1.09     on layer (7)    M7
Average gCell capacity  0.56     on layer (8)    M8
Average gCell capacity  0.38     on layer (9)    M9
Average number of tracks per gCell 9.06  on layer (1)    M1
Average number of tracks per gCell 9.00  on layer (2)    M2
Average number of tracks per gCell 4.55  on layer (3)    M3
Average number of tracks per gCell 4.52  on layer (4)    M4
Average number of tracks per gCell 2.29  on layer (5)    M5
Average number of tracks per gCell 2.27  on layer (6)    M6
Average number of tracks per gCell 1.15  on layer (7)    M7
Average number of tracks per gCell 0.77  on layer (8)    M8
Average number of tracks per gCell 0.58  on layer (9)    M9
Number of gCells = 38610
Current Stage stats:
[End of Build Congestion map] Elapsed real time: 0:00:00 
[End of Build Congestion map] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Congestion map] Stage (MB): Used    1  Alloctr    1  Proc    0 
[End of Build Congestion map] Total (MB): Used   74  Alloctr   76  Proc 2024 
Information: RC layer preference is turned on for this design. (ZRT-613)
Total stats:
[End of Build Data] Elapsed real time: 0:00:00 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Data] Stage (MB): Used    2  Alloctr    2  Proc    0 
[End of Build Data] Total (MB): Used   75  Alloctr   76  Proc 2024 
Current Stage stats:
[End of Blocked Pin Detection] Elapsed real time: 0:00:00 
[End of Blocked Pin Detection] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Blocked Pin Detection] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Blocked Pin Detection] Total (MB): Used   75  Alloctr   76  Proc 2024 
Information: Using 8 threads for routing. (ZRT-444)
placement fast mode ON
multi gcell levels ON

Start GR phase 0
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:00 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Initial Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Initial Routing] Total (MB): Used   75  Alloctr   76  Proc 2024 
Initial. Routing result:
Initial. Both Dirs: Overflow =    24 Max = 2 GRCs =    62 (0.72%)
Initial. H routing: Overflow =    16 Max = 2 (GRCs =  2) GRCs =    47 (1.10%)
Initial. V routing: Overflow =     8 Max = 2 (GRCs =  2) GRCs =    15 (0.35%)
Initial. M1         Overflow =    10 Max = 1 (GRCs = 10) GRCs =    10 (0.23%)
Initial. M2         Overflow =     7 Max = 2 (GRCs =  2) GRCs =    13 (0.30%)
Initial. M3         Overflow =     6 Max = 2 (GRCs =  2) GRCs =    37 (0.86%)
Initial. M4         Overflow =     0 Max = 1 (GRCs =  2) GRCs =     2 (0.05%)
Initial. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 28096.80
Initial. Layer M1 wire length = 438.15
Initial. Layer M2 wire length = 13836.89
Initial. Layer M3 wire length = 11311.89
Initial. Layer M4 wire length = 1497.12
Initial. Layer M5 wire length = 1012.74
Initial. Layer M6 wire length = 0.00
Initial. Layer M7 wire length = 0.00
Initial. Layer M8 wire length = 0.00
Initial. Layer M9 wire length = 0.00
Initial. Total Number of Contacts = 6817
Initial. Via VIA12C count = 3769
Initial. Via VIA23C count = 2904
Initial. Via VIA34C count = 105
Initial. Via VIA45C count = 39
Initial. Via VIA56C count = 0
Initial. Via VIA67C count = 0
Initial. Via VIA78C count = 0
Initial. Via VIA89C count = 0
Initial. completed.

Start GR phase 1
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used   75  Alloctr   76  Proc 2024 
phase1. Routing result:
phase1. Both Dirs: Overflow =    10 Max = 2 GRCs =    18 (0.21%)
phase1. H routing: Overflow =     5 Max = 1 (GRCs =  9) GRCs =     9 (0.21%)
phase1. V routing: Overflow =     5 Max = 2 (GRCs =  1) GRCs =     9 (0.21%)
phase1. M1         Overflow =     5 Max = 1 (GRCs =  5) GRCs =     5 (0.12%)
phase1. M2         Overflow =     5 Max = 2 (GRCs =  1) GRCs =     7 (0.16%)
phase1. M3         Overflow =     0 Max = 1 (GRCs =  4) GRCs =     4 (0.09%)
phase1. M4         Overflow =     0 Max = 1 (GRCs =  2) GRCs =     2 (0.05%)
phase1. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 28187.02
phase1. Layer M1 wire length = 448.74
phase1. Layer M2 wire length = 13896.63
phase1. Layer M3 wire length = 11129.68
phase1. Layer M4 wire length = 1522.83
phase1. Layer M5 wire length = 1189.13
phase1. Layer M6 wire length = 0.00
phase1. Layer M7 wire length = 0.00
phase1. Layer M8 wire length = 0.00
phase1. Layer M9 wire length = 0.00
phase1. Total Number of Contacts = 6859
phase1. Via VIA12C count = 3774
phase1. Via VIA23C count = 2913
phase1. Via VIA34C count = 121
phase1. Via VIA45C count = 51
phase1. Via VIA56C count = 0
phase1. Via VIA67C count = 0
phase1. Via VIA78C count = 0
phase1. Via VIA89C count = 0
phase1. completed.

Start GR phase 2
Current Stage stats:
[End of Phase2 Routing] Elapsed real time: 0:00:00 
[End of Phase2 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase2 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase2 Routing] Total (MB): Used   75  Alloctr   76  Proc 2024 
phase2. Routing result:
phase2. Both Dirs: Overflow =     5 Max = 1 GRCs =     8 (0.09%)
phase2. H routing: Overflow =     4 Max = 1 (GRCs =  4) GRCs =     4 (0.09%)
phase2. V routing: Overflow =     1 Max = 1 (GRCs =  4) GRCs =     4 (0.09%)
phase2. M1         Overflow =     4 Max = 1 (GRCs =  4) GRCs =     4 (0.09%)
phase2. M2         Overflow =     1 Max = 1 (GRCs =  2) GRCs =     2 (0.05%)
phase2. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M4         Overflow =     0 Max = 1 (GRCs =  2) GRCs =     2 (0.05%)
phase2. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase2. Total Wire Length = 28187.02
phase2. Layer M1 wire length = 448.74
phase2. Layer M2 wire length = 13896.63
phase2. Layer M3 wire length = 11129.68
phase2. Layer M4 wire length = 1522.83
phase2. Layer M5 wire length = 1189.14
phase2. Layer M6 wire length = 0.00
phase2. Layer M7 wire length = 0.00
phase2. Layer M8 wire length = 0.00
phase2. Layer M9 wire length = 0.00
phase2. Total Number of Contacts = 6861
phase2. Via VIA12C count = 3776
phase2. Via VIA23C count = 2913
phase2. Via VIA34C count = 121
phase2. Via VIA45C count = 51
phase2. Via VIA56C count = 0
phase2. Via VIA67C count = 0
phase2. Via VIA78C count = 0
phase2. Via VIA89C count = 0
phase2. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:00 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Whole Chip Routing] Stage (MB): Used    2  Alloctr    2  Proc    0 
[End of Whole Chip Routing] Total (MB): Used   75  Alloctr   76  Proc 2024 

Information: Global Routing terminated early: false (ZRT-103)

Congestion utilization per direction:
Average vertical track utilization   = 13.30 %
Peak    vertical track utilization   = 85.71 %
Average horizontal track utilization = 11.66 %
Peak    horizontal track utilization = 100.00 %

Current Stage stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used    0  Alloctr    0  Proc    0 
[GR: Done] Total (MB): Used   74  Alloctr   75  Proc 2024 
GR Total stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used   69  Alloctr   70  Proc   32 
[GR: Done] Total (MB): Used   74  Alloctr   75  Proc 2024 
Writing out congestion map...
Updating congestion ...
Updating congestion ...
[DBOUT] Elapsed real time: 0:00:00 
[DBOUT] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DBOUT] Stage (MB): Used  -68  Alloctr  -69  Proc    0 
[DBOUT] Total (MB): Used    4  Alloctr    5  Proc 2024 
Final total stats:
[End of Global Routing] Elapsed real time: 0:00:00 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Global Routing] Stage (MB): Used    0  Alloctr    0  Proc   32 
[End of Global Routing] Total (MB): Used    4  Alloctr    5  Proc 2024 
Information: 4.73% of design has horizontal routing density above target_routing_density of 0.80.
Information: 1.84% of design has vertical routing density above target_routing_density of 0.80.
Running placement using 8 thread(s)
Information: Automatic density control has selected the following settings: max_density 0.70, congestion_driven_max_util 0.70. (PLACE-027)
coarse place 100% done.
Information: Reducing cell density for 93.2% of the movable cells to alleviate congestion. This changes the average cell density in non-congested areas from 0.51 to 0.63. (PLACE-030)
Information: Coarse placer weighted wire length estimate = 2.84107e+08
eLpp: using low effort
Warning: turning eLpp off because no active dynamic power scenarios were found
Start transferring placement data.
Information: Automatic timing control is enabled.
DTDP placement: scenario=default
Completed transferring placement data.
Running placement using 8 thread(s)
Information: Automatic density control has selected the following settings: max_density 0.70, congestion_driven_max_util 0.70. (PLACE-027)
coarse place 40% done.
coarse place 60% done.
coarse place 80% done.
coarse place 100% done.
Information: Coarse placer weighted wire length estimate = 2.77241e+08
Completed Timing-driven placement, Elapsed time =   0: 0: 1 
Moved 1393 out of 1474 cells, ratio = 0.945047
Total displacement = 17258.724609(um)
Max displacement = 66.135300(um), receiver/dec/ctrl/U57 (144.600006, 61.080002, 4) => (131.087799, 113.703102, 4)
Displacement histogram:
----------------------------------------------------------------
DFT: number of valid scan chains : 5
DFT: number of failed scan chains : 0
DFT: repartition_method: physical_aware
DFT: reordering_method: timing_friendly
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Information: Design SerDes_cts has 1512 nets, 0 global routed, 5 detail routed. (NEX-024)
Information: The RC mode used is CTO for design 'system'. (NEX-022)
Information: Design Average RC for design SerDes_cts  (NEX-011)
Information: r = 0.565053 ohm/um, via_r = 0.900000 ohm/cut, c = 0.085014 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.900000 ohm/cut, c = 0.098436 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1510, routed nets = 5, across physical hierarchy nets = 0, parasitics cached nets = 1510, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
Use advanced legalizer engine : 0
Running DFT optimization using 8 thread(s)
DFT: pre-opt wirelength:  2185.095000
DFT: post-opt wirelength: 2125.335000
DFT: Timing on scan path is likely to be met after proper buffering.
DFT: number of valid scan chains : 5
DFT: number of failed scan chains : 0
Fixing logic constant
Fixing logic constant
----------------------------------------------------------------
Running legalize_placement
Start Legalization
nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 56 total shapes.
Layer M2: cached 0 shapes out of 99 total shapes.
Cached 728 vias out of 2969 total vias.

Legalizing Top Level Design system ... 
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
       25344         1487        Yes DEFAULT_VA

Starting legalizer.
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (0 sec)
Legalization complete (0 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                   1487
number of references:                42
number of site rows:                 55
number of locations attempted:    30554
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

number of cells aggregated:        1474 (14016 total sites)
avg row height over cells:        2.880 um
rms cell displacement:            0.737 um ( 0.26 row height)
rms weighted cell displacement:   0.737 um ( 0.26 row height)
max cell displacement:            2.950 um ( 1.02 row height)
avg cell displacement:            0.553 um ( 0.19 row height)
avg weighted cell displacement:   0.553 um ( 0.19 row height)
number of cells moved:             1392
number of large displacements:        0
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: PLACE_optlc_6850 (TIEL)
  Input location: (130.52,46.68)
  Legal location: (129.88,49.56)
  Displacement:   2.950 um ( 1.02 row height)
Cell: PLACE_optlc_6854 (TIEL)
  Input location: (87.64,101.4)
  Legal location: (87,104.28)
  Displacement:   2.950 um ( 1.02 row height)
Cell: PLACE_optlc_6858 (TIEL)
  Input location: (131.16,46.68)
  Legal location: (131.48,49.56)
  Displacement:   2.898 um ( 1.01 row height)
Cell: PLACE_optlc_6860 (TIEL)
  Input location: (113.56,161.88)
  Legal location: (113.56,164.76)
  Displacement:   2.880 um ( 1.00 row height)
Cell: transmitter/serial/U11 (INVX0)
  Input location: (39.5978,114.987)
  Legal location: (39.64,112.92)
  Displacement:   2.067 um ( 0.72 row height)
Cell: PLACE_optlc_6848 (TIEL)
  Input location: (112.92,161.88)
  Legal location: (111,161.88)
  Displacement:   1.920 um ( 0.67 row height)
Cell: receiver/dec/dec_6b_5b/U311 (INVX0)
  Input location: (40.531,68.5458)
  Legal location: (40.6,66.84)
  Displacement:   1.707 um ( 0.59 row height)
Cell: receiver/dec/dec_6b_5b/U238 (INVX0)
  Input location: (51.0695,45.0963)
  Legal location: (51.16,46.68)
  Displacement:   1.586 um ( 0.55 row height)
Cell: transmitter/enc/enc_inst_5b/U147 (INVX0)
  Input location: (138.572,91.335)
  Legal location: (137.88,92.76)
  Displacement:   1.584 um ( 0.55 row height)
Cell: receiver/dec/dec_6b_5b/U25 (INVX0)
  Input location: (70.7195,24.9854)
  Legal location: (70.68,26.52)
  Displacement:   1.535 um ( 0.53 row height)

Completed Legalization, Elapsed time =   0: 0: 0 
Moved 1392 out of 1477 cells, ratio = 0.942451
Total displacement = 2614.905762(um)
Max displacement = 6.400000(um), PLACE_optlc_6854 (87.639999, 101.400002, 0) => (87.000000, 107.160004, 4)
Displacement histogram:
Information: The net parasitics of block system are cleared. (TIM-123)
Legalization succeeded.
----------------------------------------------------------------
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Information: Design SerDes_cts has 1515 nets, 0 global routed, 5 detail routed. (NEX-024)
Information: The RC mode used is CTO for design 'system'. (NEX-022)
Information: Design Average RC for design SerDes_cts  (NEX-011)
Information: r = 0.565053 ohm/um, via_r = 0.900000 ohm/cut, c = 0.085223 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.900000 ohm/cut, c = 0.098887 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1513, routed nets = 5, across physical hierarchy nets = 0, parasitics cached nets = 1513, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
Done with post-clock timing-driven placement.


npo-clock-opt optimization Phase 6 Iter  1          0.00      0.00         0       0.013           -           0.006
Running final optimization step.
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (150000 150000) (1750000 1734000)
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 2

Use advanced legalizer engine : 0
Use advanced legalizer engine : 0
npo-clock-opt optimization Phase 7 Iter  1          0.00      0.00         0       0.013           -           0.006
ORB: timingScenario default timingCorner default
INFO: No leakage and power scenarios. Using regular scenarios instead.
INFO: No active leakage scenarios. Leakage will be turned off
ORB: Nominal = 0.181379  Design MT = 2.000000  Target = 1.259893 (6.946 nominal)  MaxRC = 0.524430
ORB: timingScenario default timingCorner default
INFO: No leakage and power scenarios. Using regular scenarios instead.
INFO: No active leakage scenarios. Leakage will be turned off
ORB: Nominal = 0.181379  Design MT = 2.000000  Target = 1.259893 (6.946 nominal)  MaxRC = 0.524430
npo-clock-opt optimization Phase 7 Iter  2          0.00      0.00         0       0.013           -           0.006

CCL: Total Usage Adjustment : 1
route.global.debug_compact_coef 4
Warning: Ignore contact DIFFCON. (ZRT-015)
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M8
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 pitch 0.320 may be too small: wire/via-down 0.315, wire/via-up 0.330. (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 pitch 0.320 may be too small: wire/via-down 0.360, wire/via-up 0.320. (ZRT-026)
Loading parastics information to the router ...
parastics information loaded to the router.
Information: RC layer preference is turned on for this design. (ZRT-613)
Updating congestion ...
Updating congestion ...
route.global.debug_compact_coef 1
INFO: Derive row count 4 from GR congestion map (16/4)
INFO: Derive col count 4 from GR congestion map (16/4)
npo-clock-opt optimization Phase 8 Iter  1          0.00      0.00         0       0.013           -           0.006
npo-clock-opt optimization Phase 8 Iter  2          0.00      0.00         0       0.013           -           0.006
npo-clock-opt optimization Phase 8 Iter  3          0.00      0.00         0       0.013           -           0.006
npo-clock-opt optimization Phase 8 Iter  4          0.00      0.00         0       0.013           -           0.006
npo-clock-opt optimization Phase 8 Iter  5          0.00      0.00         0       0.013           -           0.006
npo-clock-opt optimization Phase 8 Iter  6          0.00      0.00         0       0.013           -           0.006
npo-clock-opt optimization Phase 8 Iter  7          0.00      0.00         0       0.013           -           0.006

npo-clock-opt optimization Phase 9 Iter  1          0.00      0.00         0       0.013           -           0.006
Begin building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483648.design
Begin building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483649.design
Done building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483648.design (time 0s)
Done building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483649.design (time 0s)
Begin building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483651.design
Begin building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483650.design
Done building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483651.design (time 0s)
Begin building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483653.design
Begin building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483654.design
Done building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483653.design (time 0s)
Done building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483654.design (time 0s)
Begin building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483655.design
Done building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483650.design (time 0s)
Done building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483655.design (time 0s)
Begin building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483652.design
Done building search trees for block SerDes.dlib:SCRATCH_DESIGN_2147483652.design (time 0s)

npo-clock-opt optimization Phase 10 Iter  1         0.00      0.00         0       0.012           -           0.006

Use advanced legalizer engine : 0
npo-clock-opt optimization Phase 11 Iter  1         0.00      0.00         0       0.010           -           0.006
npo-clock-opt optimization Phase 11 Iter  2         0.00      0.00         0       0.010           -           0.006

npo-clock-opt optimization Phase 12 Iter  1         0.00      0.00         0       0.010           -           0.006

CCL: Total Usage Adjustment : 1
route.global.debug_compact_coef 4
Warning: Ignore contact DIFFCON. (ZRT-015)
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M8
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 pitch 0.320 may be too small: wire/via-down 0.315, wire/via-up 0.330. (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 pitch 0.320 may be too small: wire/via-down 0.360, wire/via-up 0.320. (ZRT-026)
Loading parastics information to the router ...
parastics information loaded to the router.
Information: RC layer preference is turned on for this design. (ZRT-613)
Updating congestion ...
Updating congestion ...
route.global.debug_compact_coef 1
INFO: Derive row count 4 from GR congestion map (16/4)
INFO: Derive col count 4 from GR congestion map (16/4)
Use advanced legalizer engine : 0
npo-clock-opt optimization Phase 13 Iter  1         0.00      0.00         0       0.010           -           0.007
npo-clock-opt optimization Phase 13 Iter  2         0.00      0.00         0       0.010           -           0.007
npo-clock-opt optimization Phase 13 Iter  3         0.00      0.00         0       0.010           -           0.007
PBO-INFO:  LR disabled
npo-clock-opt optimization Phase 13 Iter  4         0.00      0.00         0       0.010           -           0.007
PBO-INFO:  LR disabled
npo-clock-opt optimization Phase 13 Iter  5         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 14 Iter  1         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 15 Iter  1         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 16 Iter  1         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 17 Iter  1         0.00      0.00         0       0.010           -           0.007

Use advanced legalizer engine : 0
npo-clock-opt optimization Phase 18 Iter  1         0.00      0.00         0       0.010           -           0.007

Use advanced legalizer engine : 0
npo-clock-opt optimization Phase 19 Iter  1         0.00      0.00         0       0.010           -           0.007
npo-clock-opt optimization Phase 19 Iter  2         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 20 Iter  1         0.00      0.00         0       0.010           -           0.007
npo-clock-opt optimization Phase 20 Iter  2         0.00      0.00         0       0.010           -           0.007
npo-clock-opt optimization Phase 20 Iter  3         0.00      0.00         0       0.010           -           0.007
npo-clock-opt optimization Phase 20 Iter  4         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 21 Iter  1         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 22 Iter  1         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 23 Iter  1         0.00      0.00         0       0.010           -           0.007
----------------------------------------------------------------
running legalize_placement
Information: The net parasitics of block system are cleared. (TIM-123)
nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 56 total shapes.
Layer M2: cached 0 shapes out of 99 total shapes.
Cached 728 vias out of 2969 total vias.

Legalizing Top Level Design system ... 
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
       25344         1224        Yes DEFAULT_VA

Starting legalizer.
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (0 sec)
Legalization complete (0 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                   1224
number of references:                34
number of site rows:                 55
number of locations attempted:    24577
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

number of cells aggregated:        1211 (11218 total sites)
avg row height over cells:        2.880 um
rms cell displacement:            0.138 um ( 0.05 row height)
rms weighted cell displacement:   0.138 um ( 0.05 row height)
max cell displacement:            2.950 um ( 1.02 row height)
avg cell displacement:            0.010 um ( 0.00 row height)
avg weighted cell displacement:   0.010 um ( 0.00 row height)
number of cells moved:               17
number of large displacements:        0
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: PLACE_optlc_6877 (TIEL)
  Input location: (130.52,46.68)
  Legal location: (129.88,49.56)
  Displacement:   2.950 um ( 1.02 row height)
Cell: PLACE_optlc_6876 (TIEL)
  Input location: (87.64,101.4)
  Legal location: (87.32,104.28)
  Displacement:   2.898 um ( 1.01 row height)
Cell: PLACE_optlc_6865 (TIEL)
  Input location: (131.16,46.68)
  Legal location: (131.48,49.56)
  Displacement:   2.898 um ( 1.01 row height)
Cell: PLACE_optlc_6879 (TIEL)
  Input location: (113.56,161.88)
  Legal location: (113.56,164.76)
  Displacement:   2.880 um ( 1.00 row height)
Cell: PLACE_optlc_6875 (TIEL)
  Input location: (143.64,43.8)
  Legal location: (145.24,43.8)
  Displacement:   1.600 um ( 0.56 row height)
Cell: PLACE_optlc_6869 (TIEL)
  Input location: (112.92,161.88)
  Legal location: (111.32,161.88)
  Displacement:   1.600 um ( 0.56 row height)
Cell: PLACE_optlc_6868 (TIEL)
  Input location: (27.8,150.36)
  Legal location: (28.44,150.36)
  Displacement:   0.640 um ( 0.22 row height)
Cell: PLACE_optlc_6874 (TIEL)
  Input location: (85.08,75.48)
  Legal location: (84.44,75.48)
  Displacement:   0.640 um ( 0.22 row height)
Cell: transmitter/enc/enc_inst_3b/U59 (NOR3X0)
  Input location: (143,43.8)
  Legal location: (142.36,43.8)
  Displacement:   0.640 um ( 0.22 row height)
Cell: PLACE_optlc_6871 (TIEL)
  Input location: (171.8,141.72)
  Legal location: (172.44,141.72)
  Displacement:   0.640 um ( 0.22 row height)

Legalization succeeded.
Total Legalizer CPU: 0.349
----------------------------------------------------------------
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Information: Design SerDes_cts has 1252 nets, 0 global routed, 5 detail routed. (NEX-024)
Information: The RC mode used is CTO for design 'system'. (NEX-022)
Information: Design Average RC for design SerDes_cts  (NEX-011)
Information: r = 0.565208 ohm/um, via_r = 0.900000 ohm/cut, c = 0.084696 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.900000 ohm/cut, c = 0.098056 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1250, routed nets = 5, across physical hierarchy nets = 0, parasitics cached nets = 1250, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
Use advanced legalizer engine : 0

CCL: Total Usage Adjustment : 1
route.global.debug_compact_coef 4
Warning: Ignore contact DIFFCON. (ZRT-015)
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M8
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 pitch 0.320 may be too small: wire/via-down 0.315, wire/via-up 0.330. (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 pitch 0.320 may be too small: wire/via-down 0.360, wire/via-up 0.320. (ZRT-026)
Loading parastics information to the router ...
parastics information loaded to the router.
Information: RC layer preference is turned on for this design. (ZRT-613)
Updating congestion ...
Updating congestion ...
route.global.debug_compact_coef 1
INFO: Derive row count 4 from GR congestion map (16/4)
INFO: Derive col count 4 from GR congestion map (16/4)
Use advanced legalizer engine : 0
npo-clock-opt optimization Phase 24 Iter  1         0.00      0.00         0       0.010           -           0.007
npo-clock-opt optimization Phase 24 Iter  2         0.00      0.00         0       0.010           -           0.007
npo-clock-opt optimization Phase 24 Iter  3         0.00      0.00         0       0.010           -           0.007
PBO-INFO:  LR disabled
npo-clock-opt optimization Phase 24 Iter  4         0.00      0.00         0       0.010           -           0.007
PBO-INFO:  LR disabled
npo-clock-opt optimization Phase 24 Iter  5         0.00      0.00         0       0.010           -           0.007
npo-clock-opt optimization Phase 24 Iter  6         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 25 Iter  1         0.00      0.00         0       0.010           -           0.007
npo-clock-opt optimization Phase 25 Iter  2         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 26 Iter  1         0.00      0.00         0       0.010           -           0.007
ORB: timingScenario default timingCorner default
INFO: No leakage and power scenarios. Using regular scenarios instead.
INFO: No active leakage scenarios. Leakage will be turned off
ORB: Nominal = 0.181379  Design MT = 2.000000  Target = 1.259893 (6.946 nominal)  MaxRC = 0.524430
ORB: timingScenario default timingCorner default
INFO: No leakage and power scenarios. Using regular scenarios instead.
INFO: No active leakage scenarios. Leakage will be turned off
ORB: Nominal = 0.181379  Design MT = 2.000000  Target = 1.259893 (6.946 nominal)  MaxRC = 0.524430
npo-clock-opt optimization Phase 26 Iter  2         0.00      0.00         0       0.010           -           0.007

npo-clock-opt optimization Phase 27 Iter  1         0.00      0.00         0       0.010           -           0.007
----------------------------------------------------------------
running legalize_placement
Information: The net parasitics of block system are cleared. (TIM-123)
nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 56 total shapes.
Layer M2: cached 0 shapes out of 99 total shapes.
Cached 728 vias out of 2969 total vias.

Legalizing Top Level Design system ... 
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
       25344         1224        Yes DEFAULT_VA

Starting legalizer.
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (0 sec)
Legalization complete (0 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                   1224
number of references:                34
number of site rows:                 55
number of locations attempted:    24452
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

number of cells aggregated:        1211 (11218 total sites)
avg row height over cells:        2.880 um
rms cell displacement:            0.000 um ( 0.00 row height)
rms weighted cell displacement:   0.000 um ( 0.00 row height)
max cell displacement:            0.000 um ( 0.00 row height)
avg cell displacement:            0.000 um ( 0.00 row height)
avg weighted cell displacement:   0.000 um ( 0.00 row height)
number of cells moved:                0
number of large displacements:        0
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: transmitter/enc/enc_inst_5b/U30 (AND2X1)
  Input location: (168.28,124.44)
  Legal location: (168.28,124.44)
  Displacement:   0.000 um ( 0.00 row height)
Cell: transmitter/enc/enc_inst_5b/U28 (AND2X1)
  Input location: (170.52,61.08)
  Legal location: (170.52,61.08)
  Displacement:   0.000 um ( 0.00 row height)
Cell: transmitter/enc/enc_inst_5b/U6 (AND2X1)
  Input location: (160.6,55.32)
  Legal location: (160.6,55.32)
  Displacement:   0.000 um ( 0.00 row height)
Cell: transmitter/enc/enc_inst_5b/U5 (AND2X1)
  Input location: (157.08,55.32)
  Legal location: (157.08,55.32)
  Displacement:   0.000 um ( 0.00 row height)
Cell: transmitter/serial/U19 (AND2X1)
  Input location: (20.44,95.64)
  Legal location: (20.44,95.64)
  Displacement:   0.000 um ( 0.00 row height)
Cell: transmitter/enc/enc_inst_3b/U69 (AND2X1)
  Input location: (95,98.52)
  Legal location: (95,98.52)
  Displacement:   0.000 um ( 0.00 row height)
Cell: transmitter/enc/enc_inst_3b/U67 (AND2X1)
  Input location: (109.08,124.44)
  Legal location: (109.08,124.44)
  Displacement:   0.000 um ( 0.00 row height)
Cell: transmitter/enc/enc_inst_3b/U65 (AND2X1)
  Input location: (96.6,127.32)
  Legal location: (96.6,127.32)
  Displacement:   0.000 um ( 0.00 row height)
Cell: transmitter/enc/enc_inst_3b/U63 (AND2X1)
  Input location: (110.04,115.8)
  Legal location: (110.04,115.8)
  Displacement:   0.000 um ( 0.00 row height)
Cell: transmitter/enc/enc_inst_5b/U32 (AND2X1)
  Input location: (162.2,101.4)
  Legal location: (162.2,101.4)
  Displacement:   0.000 um ( 0.00 row height)

Legalization succeeded.
Total Legalizer CPU: 0.314
----------------------------------------------------------------
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Information: Design SerDes_cts has 1252 nets, 0 global routed, 5 detail routed. (NEX-024)
Information: The RC mode used is CTO for design 'system'. (NEX-022)
Information: Design Average RC for design SerDes_cts  (NEX-011)
Information: r = 0.565208 ohm/um, via_r = 0.900000 ohm/cut, c = 0.084696 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.900000 ohm/cut, c = 0.098056 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1250, routed nets = 5, across physical hierarchy nets = 0, parasitics cached nets = 1250, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)

npo-clock-opt optimization Phase 28 Iter  1         0.00      0.00         0       0.010           -           0.007
Use advanced legalizer engine : 0

npo-clock-opt optimization Phase 29 Iter  1         0.00      0.00         0       0.010           -           0.007
route_group -all_clock_nets
Warning: Ignore contact DIFFCON. (ZRT-015)
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M8
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Warning: Contact VIA89's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 pitch 0.320 may be too small: wire/via-down 0.315, wire/via-up 0.330. (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 pitch 0.320 may be too small: wire/via-down 0.360, wire/via-up 0.320. (ZRT-026)
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used   72  Alloctr   73  Proc 1960 
Printing options for 'route.common.*'

Printing options for 'route.global.*'
global.crosstalk_driven                                 :        false               
global.debug_compact_coef                               :        1                   
global.deterministic                                    :        off                 
global.global_route_topology_style                      :        0                   
global.placement_timing_driven_mode                     :        false               
global.timing_driven                                    :        false               

Begin global routing.
Loading parastics information to the router ...
parastics information loaded to the router.
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00,0.00,190.00,188.40)
Number of routing layers = 9
layer M1, dir Hor, min width = 0.14, min space = 0.14 pitch = 0.32
layer M2, dir Ver, min width = 0.16, min space = 0.16 pitch = 0.32
layer M3, dir Hor, min width = 0.16, min space = 0.16 pitch = 0.64
layer M4, dir Ver, min width = 0.16, min space = 0.16 pitch = 0.64
layer M5, dir Hor, min width = 0.16, min space = 0.16 pitch = 1.28
layer M6, dir Ver, min width = 0.16, min space = 0.16 pitch = 1.28
layer M7, dir Hor, min width = 0.16, min space = 0.16 pitch = 2.56
layer M8, dir Ver, min width = 0.16, min space = 0.16 pitch = 3.84
layer M9, dir Hor, min width = 0.45, min space = 0.45 pitch = 5.12
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Tech Data] Total (MB): Used   73  Alloctr   74  Proc 1960 
Net statistics:
Total number of nets     = 1246
Number of nets to route  = 6
Number of nets with min-layer-mode soft = 5
Number of nets with min-layer-mode soft-cost-medium = 5
Number of nets with max-layer-mode hard = 5
1 nets are partially connected,
 of which 1 are detail routed and 0 are global routed.
6 nets are fully connected,
 of which 6 are detail routed and 0 are global routed.
3 nets have non-default rule clk_network_NDR
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   73  Alloctr   74  Proc 1960 
Average gCell capacity  4.97     on layer (1)    M1
Average gCell capacity  8.38     on layer (2)    M2
Average gCell capacity  4.29     on layer (3)    M3
Average gCell capacity  4.19     on layer (4)    M4
Average gCell capacity  2.16     on layer (5)    M5
Average gCell capacity  2.13     on layer (6)    M6
Average gCell capacity  1.09     on layer (7)    M7
Average gCell capacity  0.56     on layer (8)    M8
Average gCell capacity  0.38     on layer (9)    M9
Average number of tracks per gCell 9.06  on layer (1)    M1
Average number of tracks per gCell 9.00  on layer (2)    M2
Average number of tracks per gCell 4.55  on layer (3)    M3
Average number of tracks per gCell 4.52  on layer (4)    M4
Average number of tracks per gCell 2.29  on layer (5)    M5
Average number of tracks per gCell 2.27  on layer (6)    M6
Average number of tracks per gCell 1.15  on layer (7)    M7
Average number of tracks per gCell 0.77  on layer (8)    M8
Average number of tracks per gCell 0.58  on layer (9)    M9
Number of gCells = 38610
Current Stage stats:
[End of Build Congestion map] Elapsed real time: 0:00:00 
[End of Build Congestion map] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Congestion map] Stage (MB): Used    1  Alloctr    1  Proc    0 
[End of Build Congestion map] Total (MB): Used   74  Alloctr   76  Proc 1960 
Information: RC layer preference is turned on for this design. (ZRT-613)
Total stats:
[End of Build Data] Elapsed real time: 0:00:00 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Data] Stage (MB): Used    1  Alloctr    1  Proc    0 
[End of Build Data] Total (MB): Used   74  Alloctr   76  Proc 1960 
Current Stage stats:
[End of Blocked Pin Detection] Elapsed real time: 0:00:00 
[End of Blocked Pin Detection] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Blocked Pin Detection] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Blocked Pin Detection] Total (MB): Used   74  Alloctr   76  Proc 1960 
Information: Using 8 threads for routing. (ZRT-444)
multi gcell levels ON

Start GR phase 0
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:00 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Initial Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Initial Routing] Total (MB): Used   74  Alloctr   76  Proc 1960 
Initial. Routing result:
Initial. Both Dirs: Overflow =     0 Max = 1 GRCs =     2 (0.02%)
Initial. H routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. V routing: Overflow =     0 Max = 1 (GRCs =  2) GRCs =     2 (0.05%)
Initial. M1         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M4         Overflow =     0 Max = 1 (GRCs =  2) GRCs =     2 (0.05%)
Initial. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 35.02
Initial. Layer M1 wire length = 0.00
Initial. Layer M2 wire length = 25.09
Initial. Layer M3 wire length = 9.93
Initial. Layer M4 wire length = 0.00
Initial. Layer M5 wire length = 0.00
Initial. Layer M6 wire length = 0.00
Initial. Layer M7 wire length = 0.00
Initial. Layer M8 wire length = 0.00
Initial. Layer M9 wire length = 0.00
Initial. Total Number of Contacts = 5
Initial. Via VIA12C count = 2
Initial. Via VIA23C count = 3
Initial. Via VIA34C count = 0
Initial. Via VIA45C count = 0
Initial. Via VIA56C count = 0
Initial. Via VIA67C count = 0
Initial. Via VIA78C count = 0
Initial. Via VIA89C count = 0
Initial. completed.

Start GR phase 1
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used   74  Alloctr   76  Proc 1960 
phase1. Routing result:
phase1. Both Dirs: Overflow =     0 Max = 1 GRCs =     2 (0.02%)
phase1. H routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. V routing: Overflow =     0 Max = 1 (GRCs =  2) GRCs =     2 (0.05%)
phase1. M1         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M4         Overflow =     0 Max = 1 (GRCs =  2) GRCs =     2 (0.05%)
phase1. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 35.02
phase1. Layer M1 wire length = 0.00
phase1. Layer M2 wire length = 25.09
phase1. Layer M3 wire length = 9.93
phase1. Layer M4 wire length = 0.00
phase1. Layer M5 wire length = 0.00
phase1. Layer M6 wire length = 0.00
phase1. Layer M7 wire length = 0.00
phase1. Layer M8 wire length = 0.00
phase1. Layer M9 wire length = 0.00
phase1. Total Number of Contacts = 5
phase1. Via VIA12C count = 2
phase1. Via VIA23C count = 3
phase1. Via VIA34C count = 0
phase1. Via VIA45C count = 0
phase1. Via VIA56C count = 0
phase1. Via VIA67C count = 0
phase1. Via VIA78C count = 0
phase1. Via VIA89C count = 0
phase1. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:00 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Whole Chip Routing] Stage (MB): Used    1  Alloctr    1  Proc    0 
[End of Whole Chip Routing] Total (MB): Used   74  Alloctr   76  Proc 1960 

Information: Global Routing terminated early: true (ZRT-103)

Congestion utilization per direction:
Average vertical track utilization   =  0.47 %
Peak    vertical track utilization   = 60.00 %
Average horizontal track utilization =  0.52 %
Peak    horizontal track utilization = 40.00 %

Current Stage stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used    0  Alloctr    0  Proc    0 
[GR: Done] Total (MB): Used   74  Alloctr   75  Proc 1960 
GR Total stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used    1  Alloctr    1  Proc    0 
[GR: Done] Total (MB): Used   74  Alloctr   75  Proc 1960 
Updating congestion ...
Updating congestion ...
Final total stats:
[End of Global Routing] Elapsed real time: 0:00:00 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Global Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Global Routing] Total (MB): Used   72  Alloctr   73  Proc 1960 

Start track assignment

Printing options for 'route.common.*'

Printing options for 'route.track.*'
track.crosstalk_driven                                  :        false               
track.timing_driven                                     :        false               

Information: Using 8 threads for routing. (ZRT-444)
Information: RC layer preference is turned on for this design. (ZRT-613)

[Track Assign: Read routes] Elapsed real time: 0:00:00 
[Track Assign: Read routes] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Track Assign: Read routes] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Track Assign: Read routes] Total (MB): Used   68  Alloctr   70  Proc 1960 

Start initial assignment

Assign Horizontal partitions, iteration 0
Routed partition 1/65      
Routed partition 2/65      
Routed partition 5/65      
Routed partition 6/65      
Routed partition 8/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 10/65     
Routed partition 11/65     
Routed partition 12/65     
Routed partition 13/65     
Routed partition 14/65     
Routed partition 16/65     
Routed partition 16/65     
Routed partition 19/65     
Routed partition 19/65     
Routed partition 20/65     
Routed partition 21/65     
Routed partition 21/65     
Routed partition 24/65     
Routed partition 24/65     
Routed partition 25/65     
Routed partition 25/65     
Routed partition 26/65     
Routed partition 27/65     
Routed partition 28/65     
Routed partition 30/65     
Routed partition 31/65     
Routed partition 31/65     
Routed partition 33/65     
Routed partition 35/65     
Routed partition 35/65     
Routed partition 37/65     
Routed partition 37/65     
Routed partition 37/65     
Routed partition 38/65     
Routed partition 39/65     
Routed partition 40/65     
Routed partition 43/65     
Routed partition 43/65     
Routed partition 44/65     
Routed partition 44/65     
Routed partition 46/65     
Routed partition 46/65     
Routed partition 47/65     
Routed partition 48/65     
Routed partition 49/65     
Routed partition 50/65     
Routed partition 52/65     
Routed partition 53/65     
Routed partition 54/65     
Routed partition 54/65     
Routed partition 55/65     
Routed partition 56/65     
Routed partition 57/65     
Routed partition 58/65     
Routed partition 59/65     
Routed partition 60/65     
Routed partition 61/65     
Routed partition 62/65     
Routed partition 63/65     
Routed partition 64/65     
Routed partition 65/65     

Assign Vertical partitions, iteration 0
Routed partition 1/66      
Routed partition 2/66      
Routed partition 3/66      
Routed partition 4/66      
Routed partition 5/66      
Routed partition 6/66      
Routed partition 8/66      
Routed partition 8/66      
Routed partition 9/66      
Routed partition 11/66     
Routed partition 11/66     
Routed partition 12/66     
Routed partition 13/66     
Routed partition 14/66     
Routed partition 16/66     
Routed partition 16/66     
Routed partition 17/66     
Routed partition 18/66     
Routed partition 19/66     
Routed partition 20/66     
Routed partition 21/66     
Routed partition 22/66     
Routed partition 23/66     
Routed partition 24/66     
Routed partition 25/66     
Routed partition 26/66     
Routed partition 27/66     
Routed partition 28/66     
Routed partition 29/66     
Routed partition 30/66     
Routed partition 31/66     
Routed partition 32/66     
Routed partition 33/66     
Routed partition 34/66     
Routed partition 35/66     
Routed partition 36/66     
Routed partition 37/66     
Routed partition 38/66     
Routed partition 39/66     
Routed partition 40/66     
Routed partition 41/66     
Routed partition 42/66     
Routed partition 43/66     
Routed partition 44/66     
Routed partition 45/66     
Routed partition 46/66     
Routed partition 47/66     
Routed partition 48/66     
Routed partition 49/66     
Routed partition 50/66     
Routed partition 51/66     
Routed partition 52/66     
Routed partition 53/66     
Routed partition 54/66     
Routed partition 55/66     
Routed partition 56/66     
Routed partition 57/66     
Routed partition 58/66     
Routed partition 59/66     
Routed partition 60/66     
Routed partition 61/66     
Routed partition 62/66     
Routed partition 63/66     
Routed partition 64/66     
Routed partition 65/66     
Routed partition 66/66     

Number of wires with overlap after iteration 0 = 3 of 9


[Track Assign: Iteration 0] Elapsed real time: 0:00:00 
[Track Assign: Iteration 0] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Track Assign: Iteration 0] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Track Assign: Iteration 0] Total (MB): Used   69  Alloctr   70  Proc 1960 

Reroute to fix overlaps

Assign Horizontal partitions, iteration 1
Routed partition 1/65      
Routed partition 2/65      
Routed partition 3/65      
Routed partition 4/65      
Routed partition 6/65      
Routed partition 8/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 9/65      
Routed partition 10/65     
Routed partition 11/65     
Routed partition 12/65     
Routed partition 13/65     
Routed partition 14/65     
Routed partition 15/65     
Routed partition 16/65     
Routed partition 17/65     
Routed partition 18/65     
Routed partition 19/65     
Routed partition 20/65     
Routed partition 21/65     
Routed partition 22/65     
Routed partition 23/65     
Routed partition 24/65     
Routed partition 25/65     
Routed partition 26/65     
Routed partition 27/65     
Routed partition 28/65     
Routed partition 29/65     
Routed partition 31/65     
Routed partition 34/65     
Routed partition 34/65     
Routed partition 34/65     
Routed partition 34/65     
Routed partition 35/65     
Routed partition 36/65     
Routed partition 38/65     
Routed partition 38/65     
Routed partition 39/65     
Routed partition 40/65     
Routed partition 41/65     
Routed partition 42/65     
Routed partition 43/65     
Routed partition 44/65     
Routed partition 45/65     
Routed partition 46/65     
Routed partition 47/65     
Routed partition 49/65     
Routed partition 49/65     
Routed partition 50/65     
Routed partition 51/65     
Routed partition 52/65     
Routed partition 53/65     
Routed partition 54/65     
Routed partition 55/65     
Routed partition 56/65     
Routed partition 57/65     
Routed partition 58/65     
Routed partition 59/65     
Routed partition 60/65     
Routed partition 61/65     
Routed partition 62/65     
Routed partition 63/65     
Routed partition 64/65     
Routed partition 65/65     

Assign Vertical partitions, iteration 1
Routed partition 1/66      
Routed partition 2/66      
Routed partition 3/66      
Routed partition 5/66      
Routed partition 5/66      
Routed partition 6/66      
Routed partition 8/66      
Routed partition 8/66      
Routed partition 10/66     
Routed partition 11/66     
Routed partition 12/66     
Routed partition 14/66     
Routed partition 14/66     
Routed partition 14/66     
Routed partition 15/66     
Routed partition 16/66     
Routed partition 17/66     
Routed partition 18/66     
Routed partition 19/66     
Routed partition 20/66     
Routed partition 21/66     
Routed partition 22/66     
Routed partition 23/66     
Routed partition 24/66     
Routed partition 25/66     
Routed partition 26/66     
Routed partition 27/66     
Routed partition 28/66     
Routed partition 29/66     
Routed partition 30/66     
Routed partition 31/66     
Routed partition 32/66     
Routed partition 33/66     
Routed partition 34/66     
Routed partition 35/66     
Routed partition 36/66     
Routed partition 37/66     
Routed partition 38/66     
Routed partition 39/66     
Routed partition 40/66     
Routed partition 41/66     
Routed partition 42/66     
Routed partition 43/66     
Routed partition 44/66     
Routed partition 45/66     
Routed partition 46/66     
Routed partition 47/66     
Routed partition 48/66     
Routed partition 49/66     
Routed partition 50/66     
Routed partition 51/66     
Routed partition 52/66     
Routed partition 53/66     
Routed partition 54/66     
Routed partition 55/66     
Routed partition 56/66     
Routed partition 57/66     
Routed partition 58/66     
Routed partition 59/66     
Routed partition 60/66     
Routed partition 61/66     
Routed partition 62/66     
Routed partition 63/66     
Routed partition 64/66     
Routed partition 65/66     
Routed partition 66/66     

[Track Assign: Iteration 1] Elapsed real time: 0:00:00 
[Track Assign: Iteration 1] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:01
[Track Assign: Iteration 1] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Track Assign: Iteration 1] Total (MB): Used   69  Alloctr   70  Proc 1960 

Number of wires with overlap after iteration 1 = 1 of 6


Wire length and via report:
---------------------------
Number of M1 wires: 0            POLYCON: 0
Number of M2 wires: 4            VIA12C: 2
Number of M3 wires: 2            VIA23C: 3
Number of M4 wires: 0            VIA34C: 0
Number of M5 wires: 0            VIA45C: 0
Number of M6 wires: 0            VIA56C: 0
Number of M7 wires: 0            VIA67C: 0
Number of M8 wires: 0            VIA78C: 0
Number of M9 wires: 0            VIA89C: 0
Total number of wires: 6                 vias: 5

Total M1 wire length: 0.0
Total M2 wire length: 25.3
Total M3 wire length: 9.9
Total M4 wire length: 0.0
Total M5 wire length: 0.0
Total M6 wire length: 0.0
Total M7 wire length: 0.0
Total M8 wire length: 0.0
Total M9 wire length: 0.0
Total wire length: 35.2

Longest M1 wire length: 0.0
Longest M2 wire length: 15.6
Longest M3 wire length: 9.8
Longest M4 wire length: 0.0
Longest M5 wire length: 0.0
Longest M6 wire length: 0.0
Longest M7 wire length: 0.0
Longest M8 wire length: 0.0
Longest M9 wire length: 0.0


[Track Assign: Done] Elapsed real time: 0:00:00 
[Track Assign: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:01
[Track Assign: Done] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Track Assign: Done] Total (MB): Used   68  Alloctr   69  Proc 1960 
Printing options for 'route.common.*'

Printing options for 'route.detail.*'
detail.force_end_on_preferred_grid                      :        true                
detail.timing_driven                                    :        false               

Printing options for 'route.auto_via_ladder.*'

Information: RC layer preference is turned on for this design. (ZRT-613)
[Dr init] Elapsed real time: 0:00:00 
[Dr init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Dr init] Stage (MB): Used    5  Alloctr    5  Proc    0 
[Dr init] Total (MB): Used   74  Alloctr   75  Proc 1960 
Total number of nets = 1246, of which 0 are not extracted
Total number of open nets = 1238, of which 0 are frozen
Information: Using 8 threads for routing. (ZRT-444)
Start DR iteration 0: uniform partition
Routed  3/49 Partitions, Violations =   0
Routed  5/49 Partitions, Violations =   0
Routed  6/49 Partitions, Violations =   0
Routed  7/49 Partitions, Violations =   0
Routed  9/49 Partitions, Violations =   0
Routed  10/49 Partitions, Violations =  0
Routed  12/49 Partitions, Violations =  0
Routed  13/49 Partitions, Violations =  0
Routed  16/49 Partitions, Violations =  0
Routed  17/49 Partitions, Violations =  0
Routed  20/49 Partitions, Violations =  0
Routed  21/49 Partitions, Violations =  0
Routed  22/49 Partitions, Violations =  0
Routed  34/49 Partitions, Violations =  0
Routed  35/49 Partitions, Violations =  0
Routed  36/49 Partitions, Violations =  0
Routed  37/49 Partitions, Violations =  0
Routed  38/49 Partitions, Violations =  0
Routed  39/49 Partitions, Violations =  0
Routed  40/49 Partitions, Violations =  0
Routed  41/49 Partitions, Violations =  0
Routed  42/49 Partitions, Violations =  0
Routed  43/49 Partitions, Violations =  0
Routed  44/49 Partitions, Violations =  0
Routed  45/49 Partitions, Violations =  0
Routed  46/49 Partitions, Violations =  0
Routed  47/49 Partitions, Violations =  0
Routed  48/49 Partitions, Violations =  0
Routed  49/49 Partitions, Violations =  0

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      0

[Iter 0] Elapsed real time: 0:00:00 
[Iter 0] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Iter 0] Stage (MB): Used   14  Alloctr   14  Proc    3 
[Iter 0] Total (MB): Used   83  Alloctr   84  Proc 1963 

End DR iteration 0 with 49 parts

Finish DR since reached 0 DRC

Information: Detail Routing terminated early because DRCs were not converging: false (ZRT-312)
[DR] Elapsed real time: 0:00:00 
[DR] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DR] Stage (MB): Used    0  Alloctr    0  Proc    3 
[DR] Total (MB): Used   68  Alloctr   70  Proc 1963 
[DR: Done] Elapsed real time: 0:00:00 
[DR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DR: Done] Stage (MB): Used    0  Alloctr    0  Proc    3 
[DR: Done] Total (MB): Used   68  Alloctr   70  Proc 1963 

DR finished with 0 open nets, of which 0 are frozen

DR finished with 0 violations

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      0



Total Wire Length =                    1317 micron
Total Number of Contacts =             278
Total Number of Wires =                268
Total Number of PtConns =              31
Total Number of Routed Wires =       268
Total Routed Wire Length =           1310 micron
Total Number of Routed Contacts =       278
        Layer          M1 :          0 micron
        Layer          M2 :         62 micron
        Layer          M3 :        553 micron
        Layer          M4 :        628 micron
        Layer          M5 :         74 micron
        Layer          M6 :          0 micron
        Layer          M7 :          0 micron
        Layer          M8 :          0 micron
        Layer          M9 :          0 micron
        Via        VIA45C :          6
        Via        VIA34C :          6
        Via   VIA34C(rot) :         94
        Via        VIA23C :         87
        Via   VIA12C(rot) :         67
        Via   VIA12B(rot) :         18

 
Redundant via conversion report:
--------------------------------

  Total optimized via conversion rate =  0.00% (0 / 278 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (87      vias)
    Layer VIA3       =  0.00% (0      / 100     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (100     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (6       vias)
 
  Total double via conversion rate    =  0.00% (0 / 278 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
    Layer VIA3       =  0.00% (0      / 100     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
 
  The optimized via conversion rate based on total routed via count =  0.00% (0 / 278 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (87      vias)
    Layer VIA3       =  0.00% (0      / 100     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (100     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (6       vias)
 

Total number of nets = 1246
0 open nets, of which 0 are frozen
Total number of excluded ports = 0 ports of 0 unplaced cells connected to 0 nets
                                 0 ports without pins of 0 cells connected to 0 nets
                                 0 ports of 0 cover cells connected to 0 non-pg nets
Total number of DRCs = 0
Total number of antenna violations = antenna checking not active
Information: Routes in non-preferred voltage areas = 0 (ZRT-559)

Topology ECO not run, no qualifying violations or in frozen nets.
Updating the database ...
Information: The net parasitics of block system are cleared. (TIM-123)
Begin building search trees for block SerDes.dlib:SerDes_cts.design
Done building search trees for block SerDes.dlib:SerDes_cts.design (time 0s)
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_cts.design'. (TIM-125)
Information: Design SerDes_cts has 1246 nets, 0 global routed, 6 detail routed. (NEX-024)
Information: The RC mode used is CTO for design 'system'. (NEX-022)
Information: Design Average RC for design SerDes_cts  (NEX-011)
Information: r = 0.565208 ohm/um, via_r = 0.900000 ohm/cut, c = 0.084696 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.900000 ohm/cut, c = 0.098056 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1244, routed nets = 6, across physical hierarchy nets = 0, parasitics cached nets = 1244, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)

npo-clock-opt optimization Phase 30 Iter  1         0.00      0.00         0       0.010           -           0.008
Enable dominated scenarios

npo-clock-opt optimization complete                 0.00      0.00         0       0.010           -           0.008
Co-efficient Ratio Summary:
4.193421605155  6.578038173730  2.479639287277  7.744187540401  0.485050000353  3.179565833784  -5.567214854587  -2.894454487461  -6.565921317863  -9.017937605874  3.105976075702  9.863577909851  6.078124464085  2.744300641123
8.318115604907  9.699225026083  2.464623950064  1.382370221226  9.387184029619  3.142429406669  -0.968752889964  -6.613180823294  -4.146578893224  -7.876358018112  2.192431378465  0.963872541094  2.700149943881  3.840552364440
3.750206053169  7.663458842299  6.212201167950  7.759678473967  7.862243056717  0.402387977150  -0.032845195897  -0.596111612371  -4.701287496892  -7.205135612169  8.279657563037  1.183863590997  3.334437908244  5.867701031622
7.173894385364  9.669819999761  7.591487347087  7.632106393266  7.679078063326  9.831314288630  -1.878805917928  -3.230072443539  -1.226270137326  -7.050450594780  2.404225721834  6.139990244054  4.100211566110  1.274810889655
4.570746653063  5.624878808820  7.826857253678  4.759133418263  5.409027926377  2.609823652834  -0.626142638674  -6.381676752919  -9.187474122495  -0.513656896621  5.028877266765  6.119951146103  6.181473812107  1.581777665776
7.486041822107  9.584562469756  2.041727387119  3.921160867338  0.650488682345  9.472458902409  -3.368484494994  -4.897111649020  -6.860149344452  -2.000104151691  9.096642555882  2.197189409512  0.915901567443  5.466194608426
8.142690055883  4.607193265224  8.244463794567  3.504870705451  1.682716012888  7.173433718510  -9.939562808373  -3.617852872683  -8.946772737652  -1.169969632707  4.520243204465  3.090017109795  5.580727636993  1.131499063510
0.721709625254  7.515947417690  0.649322209371  1.017031043513  5.811519666269  5.826730883342  -4.349383392435  -0.216216018317  -9.612142522527  -7.311156882104  0.824666201555  0.356283686693  8.022019969284  2.603109685844
5.024802551363  1.359359521353  5.407563451201  2.804123477518  1.265300052200  0.417760313533  -1.833872565081  -6.448557837188  -4.848373212548  -2.936801155033  8.672433818756  4.212427716610  9.007627670112  3.308174278452
5.607471109985  8.514743640423  2.764676979434  9.324216938770  1.551199989997  2.300508202625  -0.754685130179  -1.961421511696  -2.781303441418  -3.355375255650  9.438948587133  9.136824042545  9.020209608464  9.978448595117
7.467457734047  3.171274721421  9.815920740044  4.331414637138  0.413524984361  3.309910198619  -7.452798306103  -1.902827024529  -5.623407359547  -7.269363108696  3.368442897215  7.093763915702  7.411336556476  6.944213076650
5.239565921087  4.802189647382  3.894401463832  4.531610419342  1.605155657803  8.173730247963  -9.287277874418  -7.540401148505  -0.000353417956  -5.833784656721  4.755526973976  4.387583056592  1.217863301793  7.505841410467
0.800933986343  9.509851607812  3.964085274420  8.341123831811  5.604907969922  5.026083246462  -3.950064238237  -0.221226038718  -4.029619414242  -9.406669196875  2.780903355849  0.723316814657  8.793224187635  8.918189319113
5.103696096373  4.141094270014  8.443881384045  0.064440375020  6.053169766345  8.842299621220  -1.167950875967  -8.473967886224  -3.056717140238  -7.977150103284  5.096836743142  1.512493870128  7.396892120513  5.512136927835
1.398268118372  5.190997333443  6.408244586760  9.731622717389  4.385364966981  9.999761759148  -7.347087863210  -6.393266867907  -8.063326083131  -4.288630287880  5.818967017538  2.343651522627  0.037326105045  0.494757340392
8.173631613985  2.544054410021  0.066110127471  8.589655457074  6.653063562487  8.808820782685  -7.253678575913  -3.418263640902  -7.926377360982  -3.652834162614  2.539613322698  6.652031318747  4.022495451365  6.796698602757
0.618562611981  3.446103618147  2.312107158167  5.365776748604  1.822107958456  2.469756204172  -7.387119492116  -0.867338165048  -8.682345047245  -8.902409436848  4.395933173242  1.549142086014  9.244452600010  4.051668009534
5.907689219704  1.709512091590  0.067443546609  2.308426814269  0.055883460719  3.265224824446  -3.794567450487  -0.705451268271  -6.012888817343  -3.718510093956  2.709312055216  2.772705294677  2.637652516996  9.532774552994
6.656262309097  9.409795558072  6.136993113139  7.763510072170  9.625254751594  7.417690064932  -2.209371201703  -1.043513681151  -9.666269682673  -0.883342534938  3.293474715152  6.918439361214  2.422527131115  6.782171182351
9.141628035616  1.286693802201  9.569284260313  2.585844502480  2.551363135935  9.521353540756  -3.451201380412  -3.477518226530  -0.052200141776  -0.313533283387  2.466020338386  7.737200884837  3.112548693680  1.055000967149
4.124225421230  5.316610900762  7.270112330810  7.178452560747  1.109985851474  3.640423276467  -6.979434032421  -6.938770255119  -9.989997330050  -8.202625175468  5.031118880673  1.411718678130  3.341418735537  5.155627043790
9.893602913670  2.642545902020  9.208464997847  1.495117746745  7.734047317127  4.721421981592  -0.740044533141  -4.637138141352  -4.984361430991  -0.198619845279  8.207142884713  7.924641962340  7.259547126936  3.008663436740
3.103784709364  1.515702741133  6.156476694424  6.976650523956  5.921087480218  9.647382389440  -1.463832553161  -0.419342260515  -5.657803917373  -0.247963028727  7.775457448571  1.048627400035  3.317956983378  4.556798575458
7.289445438746  1.656592121786  3.901793750587  4.310467080093  3.986343950985  1.607812396408  -5.274420934112  -3.831811660490  -7.969922602608  -3.246462495006  4.139276716653  6.938830802961  9.314242340666  9.096842378996
4.661318072329  4.414657879322  4.787635891811  2.219113510369  6.096373414109  4.270014844388  -1.384045106444  -0.375020705316  -9.766345984229  -9.621220216795  0.776906531827  7.786346705671  7.040238197715  0.003251609589
7.059611151237  1.470128739689  2.720513551216  9.827835139826  8.118372519099  7.333443640824  -4.586760073162  -2.717389538536  -4.966981099976  -1.759148834708  7.764259323857  6.767029206332  6.983131828863  0.187857681792
8.323007234353  9.122627003732  6.705045049478  0.240392817363  1.613985254405  4.410021006611  -0.127471958965  -5.457074765306  -3.562487980882  -0.782685825367  8.476952035357  3.540024192637  7.260982765283  4.062681353867
4.638167665291  9.918747402249  5.051365679662  1.502757061856  2.611981344610  3.618147231210  -7.158167636577  -6.748604282210  -7.958456346975  -6.204172838711  9.393150240674  8.065169268234  5.947245290240  9.336814539499
4.489711154902  0.686014924445  2.200010405169  1.909534590768  9.219704170951  2.091590006744  -3.546609330842  -6.814269105588  -3.460719426522  -4.824446479456  7.351421234486  1.168392001288  8.717343771851  0.993922370837
3.361785277268  3.894677263765  2.116996953270  7.452994665626  2.309097940979  5.558072613699  -3.113139876351  -0.072170062525  -4.751594841769  -0.064932320937  1.102747368292  3.581272366626  9.582673488334  2.434904429243

npo-clock-opt final QoR
_______________________
Scenario Mapping Table
1: default

Pathgroup Mapping Table
1: **default**
2: **async_default**
3: **clock_gating_default**
4: **in2reg_default**
5: **reg2out_default**
6: **in2out_default**
7: fun_sclk
8: fun_pclk
9: scan_clk

-----------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS    NSV      WHV        THV    NHV
    1   1   0.0000     0.0000      0   0.0000     0.0000      0
    1   2   0.0000     0.0000      0   0.0000     0.0000      0
    1   3   0.0000     0.0000      0   0.0000     0.0000      0
    1   4   0.0000     0.0000      0   0.0000     0.0000      0
    1   5   0.0000     0.0000      0   0.0000     0.0000      0
    1   6   0.0000     0.0000      0   0.0000     0.0000      0
    1   7   0.0000     0.0000      0   0.0000     0.0000      0
    1   8   0.0000     0.0000      0   0.0000     0.0000      0
    1   9   0.0000     0.0000      0   0.0000     0.0000      0
--------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage
    1   *   0.0000     0.0000      0   0.0000     0.0000      0        -          -        -          -
--------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage         Area    InstCnt     BufCnt     InvCnt
    *   *   0.0000     0.0000      0   0.0000     0.0000      0        -          -        -          -     10442.65       1214          4        761
--------------------------------------------------------------------------------------------------------------------

npo-clock-opt final QoR Summary         WNS        TNS    NSV      WHV        THV    NHV  MaxTrnV  MaxCapV    Leakage         Area    InstCnt
npo-clock-opt final QoR Summary      0.0000     0.0000      0   0.0000     0.0000      0        -        -          -     10442.65       1214

npo-clock-opt command complete                CPU:    40 s (  0.01 hr )  ELAPSE:    27 s (  0.01 hr )  MEM-PEAK:   689 MB
npo-clock-opt command statistics  CPU=15 sec (0.00 hr) ELAPSED=9 sec (0.00 hr) MEM-PEAK=0.673 GB
Information: Running auto PG connection. (NDM-099)
1
icc2_shell> # ================================================ #
icc2_shell> # ================== Connect
icc2_shell> # ================================================ #
icc2_shell> sizeof_collection [get_cells "CTS_*"]
1
icc2_shell> connect_pg_net -net "VDD" [get_pins -hierarchical "*/VDD*"]
icc2_shell> connect_pg_net -net "VSS" [get_pins -hierarchical "*/VSS"]
icc2_shell> check_pg_drc
Command check_pg_drc started  at Tue Aug 26 08:26:46 2025
Command check_pg_drc finished at Tue Aug 26 08:26:46 2025
CPU usage for check_pg_drc: 0.39 seconds ( 0.00 hours)
Elapsed time for check_pg_drc: 0.07 seconds ( 0.00 hours)
No errors found.
icc2_shell> check_routes -drc true
Warning: Ignore contact DIFFCON. (ZRT-015)
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M8
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Warning: Contact VIA89's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 pitch 0.320 may be too small: wire/via-down 0.315, wire/via-up 0.330. (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 pitch 0.320 may be too small: wire/via-down 0.360, wire/via-up 0.320. (ZRT-026)


Start checking for open nets ... 

net(data_in_8b[7]) has floating ports (dbId = 0 idx_ = 0 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[6]) has floating ports (dbId = 1 idx_ = 1 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[5]) has floating ports (dbId = 2 idx_ = 2 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[4]) has floating ports (dbId = 3 idx_ = 3 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[3]) has floating ports (dbId = 4 idx_ = 4 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[2]) has floating ports (dbId = 5 idx_ = 5 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[1]) has floating ports (dbId = 6 idx_ = 6 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[0]) has floating ports (dbId = 7 idx_ = 7 numNodes = 2 numEdges = 0 numCmps = 2)
net(kin) has floating ports (dbId = 8 idx_ = 8 numNodes = 2 numEdges = 0 numCmps = 2)
net(rdispout) has floating ports (dbId = 9 idx_ = 9 numNodes = 3 numEdges = 0 numCmps = 3)
net(k_err) has floating ports (dbId = 10 idx_ = 10 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[7]) has floating ports (dbId = 11 idx_ = 11 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[6]) has floating ports (dbId = 12 idx_ = 12 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[5]) has floating ports (dbId = 13 idx_ = 13 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[4]) has floating ports (dbId = 14 idx_ = 14 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[3]) has floating ports (dbId = 15 idx_ = 15 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[2]) has floating ports (dbId = 16 idx_ = 16 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[1]) has floating ports (dbId = 17 idx_ = 17 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[0]) has floating ports (dbId = 18 idx_ = 18 numNodes = 3 numEdges = 0 numCmps = 3)
net(kout) has floating ports (dbId = 19 idx_ = 19 numNodes = 3 numEdges = 0 numCmps = 3)
net(code_err) has floating ports (dbId = 20 idx_ = 20 numNodes = 3 numEdges = 0 numCmps = 3)
net(disp_err) has floating ports (dbId = 21 idx_ = 21 numNodes = 3 numEdges = 0 numCmps = 3)
net(fun_rst_n) has floating ports (dbId = 25 idx_ = 25 numNodes = 2 numEdges = 0 numCmps = 2)
net(scan_rst) has floating ports (dbId = 26 idx_ = 26 numNodes = 2 numEdges = 0 numCmps = 2)
net(test_mode) has floating ports (dbId = 27 idx_ = 27 numNodes = 3 numEdges = 0 numCmps = 3)
net(scan_en) has floating ports (dbId = 28 idx_ = 28 numNodes = 79 numEdges = 0 numCmps = 79)
net(scan_in_1) has floating ports (dbId = 29 idx_ = 29 numNodes = 2 numEdges = 0 numCmps = 2)
net(scan_in_2) has floating ports (dbId = 31 idx_ = 30 numNodes = 2 numEdges = 0 numCmps = 2)
net(scan_in_3) has floating ports (dbId = 33 idx_ = 31 numNodes = 2 numEdges = 0 numCmps = 2)
net(scan_in_4) has floating ports (dbId = 35 idx_ = 32 numNodes = 2 numEdges = 0 numCmps = 2)
net(aps_rename_39_) has floating ports (dbId = 36 idx_ = 33 numNodes = 3 numEdges = 0 numCmps = 3)
net(scan_in_5) has floating ports (dbId = 37 idx_ = 34 numNodes = 2 numEdges = 0 numCmps = 2)
net(reset_n) has floating ports (dbId = 41 idx_ = 37 numNodes = 3 numEdges = 0 numCmps = 3)
net(rdispout_trans) has floating ports (dbId = 42 idx_ = 38 numNodes = 3 numEdges = 0 numCmps = 3)
net(data_out_s) has floating ports (dbId = 43 idx_ = 39 numNodes = 4 numEdges = 0 numCmps = 4)
net(n1) has floating ports (dbId = 44 idx_ = 40 numNodes = 2 numEdges = 0 numCmps = 2)
net(n2) has floating ports (dbId = 45 idx_ = 41 numNodes = 2 numEdges = 0 numCmps = 2)
net(n12) has floating ports (dbId = 46 idx_ = 42 numNodes = 3 numEdges = 0 numCmps = 3)
net(n13) has floating ports (dbId = 47 idx_ = 43 numNodes = 2 numEdges = 0 numCmps = 2)
net(n14) has floating ports (dbId = 48 idx_ = 44 numNodes = 2 numEdges = 0 numCmps = 2)
net(n15) has floating ports (dbId = 49 idx_ = 45 numNodes = 3 numEdges = 0 numCmps = 3)
net(n16) has floating ports (dbId = 50 idx_ = 46 numNodes = 2 numEdges = 0 numCmps = 2)
net(n17) has floating ports (dbId = 51 idx_ = 47 numNodes = 2 numEdges = 0 numCmps = 2)
net(n18) has floating ports (dbId = 52 idx_ = 48 numNodes = 2 numEdges = 0 numCmps = 2)
net(n19) has floating ports (dbId = 53 idx_ = 49 numNodes = 2 numEdges = 0 numCmps = 2)
net(n23) has floating ports (dbId = 54 idx_ = 50 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/valid) has floating ports (dbId = 90 idx_ = 51 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/n4) has floating ports (dbId = 91 idx_ = 52 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/n5) has floating ports (dbId = 92 idx_ = 53 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[9]) has floating ports (dbId = 94 idx_ = 54 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[8]) has floating ports (dbId = 95 idx_ = 55 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[7]) has floating ports (dbId = 96 idx_ = 56 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[6]) has floating ports (dbId = 97 idx_ = 57 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[4]) has floating ports (dbId = 99 idx_ = 58 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[3]) has floating ports (dbId = 100 idx_ = 59 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[0]) has floating ports (dbId = 102 idx_ = 60 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n30) has floating ports (dbId = 121 idx_ = 61 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n31) has floating ports (dbId = 122 idx_ = 62 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n32) has floating ports (dbId = 123 idx_ = 63 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n33) has floating ports (dbId = 124 idx_ = 64 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n34) has floating ports (dbId = 125 idx_ = 65 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n35) has floating ports (dbId = 126 idx_ = 66 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n37) has floating ports (dbId = 127 idx_ = 67 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n9) has floating ports (dbId = 128 idx_ = 68 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n10) has floating ports (dbId = 129 idx_ = 69 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n11) has floating ports (dbId = 130 idx_ = 70 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n13) has floating ports (dbId = 131 idx_ = 71 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n14) has floating ports (dbId = 132 idx_ = 72 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n15) has floating ports (dbId = 133 idx_ = 73 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n16) has floating ports (dbId = 134 idx_ = 74 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n17) has floating ports (dbId = 135 idx_ = 75 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n18) has floating ports (dbId = 136 idx_ = 76 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n19) has floating ports (dbId = 137 idx_ = 77 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/serial/n20) has floating ports (dbId = 138 idx_ = 78 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n21) has floating ports (dbId = 139 idx_ = 79 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n22) has floating ports (dbId = 140 idx_ = 80 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n23) has floating ports (dbId = 141 idx_ = 81 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n24) has floating ports (dbId = 142 idx_ = 82 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n25) has floating ports (dbId = 143 idx_ = 83 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n26) has floating ports (dbId = 144 idx_ = 84 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n27) has floating ports (dbId = 145 idx_ = 85 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n28) has floating ports (dbId = 146 idx_ = 86 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n29) has floating ports (dbId = 147 idx_ = 87 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n36) has floating ports (dbId = 148 idx_ = 88 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n38) has floating ports (dbId = 149 idx_ = 89 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n39) has floating ports (dbId = 150 idx_ = 90 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n40) has floating ports (dbId = 151 idx_ = 91 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n41) has floating ports (dbId = 152 idx_ = 92 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n189) has floating ports (dbId = 153 idx_ = 93 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n190) has floating ports (dbId = 154 idx_ = 94 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n191) has floating ports (dbId = 155 idx_ = 95 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n192) has floating ports (dbId = 156 idx_ = 96 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n193) has floating ports (dbId = 157 idx_ = 97 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n194) has floating ports (dbId = 158 idx_ = 98 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n195) has floating ports (dbId = 159 idx_ = 99 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n196) has floating ports (dbId = 160 idx_ = 100 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n197) has floating ports (dbId = 161 idx_ = 101 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n198) has floating ports (dbId = 162 idx_ = 102 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n199) has floating ports (dbId = 163 idx_ = 103 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n200) has floating ports (dbId = 164 idx_ = 104 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n201) has floating ports (dbId = 165 idx_ = 105 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n202) has floating ports (dbId = 166 idx_ = 106 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n203) has floating ports (dbId = 167 idx_ = 107 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n204) has floating ports (dbId = 168 idx_ = 108 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n205) has floating ports (dbId = 169 idx_ = 109 numNodes = 3 numEdges = 0 numCmps = 3)
net(optlc_net_672) has floating ports (dbId = 171 idx_ = 110 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_673) has floating ports (dbId = 172 idx_ = 111 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n209) has floating ports (dbId = 173 idx_ = 112 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n210) has floating ports (dbId = 174 idx_ = 113 numNodes = 3 numEdges = 0 numCmps = 3)
net(optlc_net_674) has floating ports (dbId = 175 idx_ = 114 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_675) has floating ports (dbId = 176 idx_ = 115 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_676) has floating ports (dbId = 177 idx_ = 116 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_677) has floating ports (dbId = 178 idx_ = 117 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_678) has floating ports (dbId = 179 idx_ = 118 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n216) has floating ports (dbId = 180 idx_ = 119 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n217) has floating ports (dbId = 181 idx_ = 120 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_679) has floating ports (dbId = 182 idx_ = 121 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n219) has floating ports (dbId = 183 idx_ = 122 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n220) has floating ports (dbId = 184 idx_ = 123 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n221) has floating ports (dbId = 185 idx_ = 124 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n222) has floating ports (dbId = 186 idx_ = 125 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n223) has floating ports (dbId = 187 idx_ = 126 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n224) has floating ports (dbId = 188 idx_ = 127 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n225) has floating ports (dbId = 189 idx_ = 128 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n226) has floating ports (dbId = 190 idx_ = 129 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n227) has floating ports (dbId = 191 idx_ = 130 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n228) has floating ports (dbId = 192 idx_ = 131 numNodes = 3 numEdges = 0 numCmps = 3)
net(optlc_net_680) has floating ports (dbId = 193 idx_ = 132 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_681) has floating ports (dbId = 194 idx_ = 133 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n231) has floating ports (dbId = 195 idx_ = 134 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/serial/n232) has floating ports (dbId = 196 idx_ = 135 numNodes = 3 numEdges = 0 numCmps = 3)
net(optlc_net_682) has floating ports (dbId = 197 idx_ = 136 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n234) has floating ports (dbId = 198 idx_ = 137 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n235) has floating ports (dbId = 199 idx_ = 138 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n236) has floating ports (dbId = 200 idx_ = 139 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n237) has floating ports (dbId = 201 idx_ = 140 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n238) has floating ports (dbId = 202 idx_ = 141 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n239) has floating ports (dbId = 203 idx_ = 142 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/serial/n240) has floating ports (dbId = 204 idx_ = 143 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n241) has floating ports (dbId = 205 idx_ = 144 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n242) has floating ports (dbId = 206 idx_ = 145 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/serial/n243) has floating ports (dbId = 207 idx_ = 146 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n244) has floating ports (dbId = 208 idx_ = 147 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n246) has floating ports (dbId = 210 idx_ = 148 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n248) has floating ports (dbId = 212 idx_ = 149 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n250) has floating ports (dbId = 213 idx_ = 150 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n252) has floating ports (dbId = 215 idx_ = 151 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n253) has floating ports (dbId = 216 idx_ = 152 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/kin_reg) has floating ports (dbId = 247 idx_ = 153 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/k_err_in) has floating ports (dbId = 248 idx_ = 154 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/rdispout_in) has floating ports (dbId = 249 idx_ = 155 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n2) has floating ports (dbId = 250 idx_ = 156 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n4) has floating ports (dbId = 251 idx_ = 157 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n43) has floating ports (dbId = 253 idx_ = 158 numNodes = 3 numEdges = 0 numCmps = 3)
net(optlc_net_683) has floating ports (dbId = 254 idx_ = 159 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_684) has floating ports (dbId = 255 idx_ = 160 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n55) has floating ports (dbId = 256 idx_ = 161 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n56) has floating ports (dbId = 257 idx_ = 162 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n57) has floating ports (dbId = 258 idx_ = 163 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_685) has floating ports (dbId = 259 idx_ = 164 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_686) has floating ports (dbId = 260 idx_ = 165 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_687) has floating ports (dbId = 261 idx_ = 166 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n62) has floating ports (dbId = 263 idx_ = 167 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n63) has floating ports (dbId = 264 idx_ = 168 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n64) has floating ports (dbId = 265 idx_ = 169 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n65) has floating ports (dbId = 266 idx_ = 170 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n66) has floating ports (dbId = 267 idx_ = 171 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n67) has floating ports (dbId = 268 idx_ = 172 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n71) has floating ports (dbId = 272 idx_ = 173 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n72) has floating ports (dbId = 273 idx_ = 174 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n73) has floating ports (dbId = 274 idx_ = 175 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n74) has floating ports (dbId = 275 idx_ = 176 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n75) has floating ports (dbId = 276 idx_ = 177 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n76) has floating ports (dbId = 277 idx_ = 178 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n77) has floating ports (dbId = 278 idx_ = 179 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n78) has floating ports (dbId = 279 idx_ = 180 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n79) has floating ports (dbId = 280 idx_ = 181 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n80) has floating ports (dbId = 281 idx_ = 182 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n81) has floating ports (dbId = 282 idx_ = 183 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n82) has floating ports (dbId = 283 idx_ = 184 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/enc/n83) has floating ports (dbId = 284 idx_ = 185 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n84) has floating ports (dbId = 285 idx_ = 186 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n85) has floating ports (dbId = 286 idx_ = 187 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n86) has floating ports (dbId = 287 idx_ = 188 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n87) has floating ports (dbId = 288 idx_ = 189 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n90) has floating ports (dbId = 290 idx_ = 190 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n91) has floating ports (dbId = 291 idx_ = 191 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n92) has floating ports (dbId = 292 idx_ = 192 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n93) has floating ports (dbId = 293 idx_ = 193 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n94) has floating ports (dbId = 294 idx_ = 194 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n95) has floating ports (dbId = 295 idx_ = 195 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n96) has floating ports (dbId = 296 idx_ = 196 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n97) has floating ports (dbId = 297 idx_ = 197 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n99) has floating ports (dbId = 298 idx_ = 198 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n100) has floating ports (dbId = 299 idx_ = 199 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/data_reg[6]) has floating ports (dbId = 301 idx_ = 200 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/enc/data_reg[5]) has floating ports (dbId = 302 idx_ = 201 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/enc/_gOb13_data_reg[4]) has floating ports (dbId = 303 idx_ = 202 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/data_reg[3]) has floating ports (dbId = 304 idx_ = 203 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/_gOb15_data_reg[2]) has floating ports (dbId = 305 idx_ = 204 numNodes = 3 numEdges = 0 numCmps = 3)

... and 1038 more nets has floating ports 

Total number of nets = 1246, of which 0 are not extracted
Total number of open nets = 1238, of which 0 are frozen

Check 1246 nets, 1238 have Errors

[CHECK OPEN NETS] Elapsed real time: 0:00:00 
[CHECK OPEN NETS] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[CHECK OPEN NETS] Stage (MB): Used    0  Alloctr    0  Proc    0 
[CHECK OPEN NETS] Total (MB): Used   68  Alloctr   69  Proc 1971 
Printing options for 'route.common.*'

Printing options for 'route.detail.*'
detail.force_end_on_preferred_grid                      :        true                

Printing options for 'route.auto_via_ladder.*'


Begin full DRC check ...

Information: Using 8 threads for routing. (ZRT-444)
Checked 1/4 Partitions, Violations =    0
Checked 2/4 Partitions, Violations =    0
Checked 3/4 Partitions, Violations =    0
Checked 4/4 Partitions, Violations =    0
[DRC CHECK] Elapsed real time: 0:00:00 
[DRC CHECK] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DRC CHECK] Stage (MB): Used    0  Alloctr    0  Proc    0 
[DRC CHECK] Total (MB): Used   83  Alloctr   84  Proc 1971 
Warning: No antenna rules defined, Skip antenna analysis. (ZRT-309)

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      0


Total Wire Length =                    1317 micron
Total Number of Contacts =             278
Total Number of Wires =                274
Total Number of PtConns =              31
Total Number of Routed Wires =       274
Total Routed Wire Length =           1310 micron
Total Number of Routed Contacts =       278
        Layer          M1 :          0 micron
        Layer          M2 :         62 micron
        Layer          M3 :        553 micron
        Layer          M4 :        628 micron
        Layer          M5 :         74 micron
        Layer          M6 :          0 micron
        Layer          M7 :          0 micron
        Layer          M8 :          0 micron
        Layer          M9 :          0 micron
        Via        VIA45C :          6
        Via        VIA34C :          6
        Via   VIA34C(rot) :         94
        Via        VIA23C :         87
        Via   VIA12C(rot) :         67
        Via   VIA12B(rot) :         18

 
Redundant via conversion report:
--------------------------------

  Total optimized via conversion rate =  0.00% (0 / 278 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (87      vias)
    Layer VIA3       =  0.00% (0      / 100     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (100     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (6       vias)
 
  Total double via conversion rate    =  0.00% (0 / 278 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
    Layer VIA3       =  0.00% (0      / 100     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
 
  The optimized via conversion rate based on total routed via count =  0.00% (0 / 278 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (87      vias)
    Layer VIA3       =  0.00% (0      / 100     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (100     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (6       vias)
 


Verify Summary:

Total number of nets = 1246, of which 0 are not extracted
Total number of open nets = 1238, of which 0 are frozen
Total number of excluded ports = 0 ports of 0 unplaced cells connected to 0 nets
                                 0 ports without pins of 0 cells connected to 0 nets
                                 0 ports of 0 cover cells connected to 0 non-pg nets
Total number of DRCs = 0
Total number of antenna violations = no antenna rules defined
Total number of tie to rail violations = not checked
Total number of tie to rail directly violations = not checked


icc2_shell> # =======
icc2_shell> # =================== Reports ==================== #
icc2_shell> # ================================================ #
icc2_shell> report_clock_tree_options  >  ../report/clock_tree_options.rpt
icc2_shell> report_routing_rules -verbose >  ../report/cts_routing_rules.rpt
icc2_shell> report_clock_routing_rules >  ../report/cts_clock_routing_rules.rpt
icc2_shell> report_ports -v
****************************************
Report : port
        -design_rule
        -input_delay
        -drive
        -output_delay
Module : system
Mode   : default
Corner : default
Scenario: default
Version: O-2018.06-SP1
Date   : Tue Aug 26 08:26:46 2025
****************************************
                      Pin Cap                    Wire Cap
                   Min          Max           Min          Max
Port      Dir    rise/fall    rise/fall     rise/fall    rise/fall    Attributes
--------------------------------------------------------------------------------
code_err  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
data_in_8b[0]
          in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
data_in_8b[1]
          in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
data_in_8b[2]
          in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
data_in_8b[3]
          in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
data_in_8b[4]
          in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
data_in_8b[5]
          in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
data_in_8b[6]
          in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
data_in_8b[7]
          in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
disp_err  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
fun_pclk  in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
fun_rst_n in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
fun_sclk  in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
k_err     out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
kin       in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
kout      out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
pdata[0]  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
pdata[1]  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
pdata[2]  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
pdata[3]  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
pdata[4]  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
pdata[5]  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
pdata[6]  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
pdata[7]  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
rdispout  out    4.00/4.00    4.00/4.00     0.00/0.00    0.00/0.00
scan_clk  in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_en   in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_in_1 in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_in_2 in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_in_3 in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_in_4 in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_in_5 in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_out_1
          out    0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_out_2
          out    0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_out_3
          out    0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_out_4
          out    0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_out_5
          out    0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
scan_rst  in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00
test_mode in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00

Port           MaxTrans MaxCap   MinCap
-------------------------------------------
code_err       --       --       --
data_in_8b[0]  0.22     48.00    0.10
data_in_8b[1]  0.22     48.00    0.10
data_in_8b[2]  0.22     48.00    0.10
data_in_8b[3]  0.22     48.00    0.10
data_in_8b[4]  0.22     48.00    0.10
data_in_8b[5]  0.22     48.00    0.10
data_in_8b[6]  0.22     48.00    0.10
data_in_8b[7]  0.22     48.00    0.10
disp_err       --       --       --
fun_pclk       --       --       --
fun_rst_n      --       --       --
fun_sclk       --       --       --
k_err          --       --       --
kin            0.22     48.00    0.10
kout           --       --       --
pdata[0]       --       --       --
pdata[1]       --       --       --
pdata[2]       --       --       --
pdata[3]       --       --       --
pdata[4]       --       --       --
pdata[5]       --       --       --
pdata[6]       --       --       --
pdata[7]       --       --       --
rdispout       --       --       --
scan_clk       --       --       --
scan_en        --       --       --
scan_in_1      --       --       --
scan_in_2      --       --       --
scan_in_3      --       --       --
scan_in_4      --       --       --
scan_in_5      --       --       --
scan_out_1     --       --       --
scan_out_2     --       --       --
scan_out_3     --       --       --
scan_out_4     --       --       --
scan_out_5     --       --       --
scan_rst       --       --       --
test_mode      --       --       --

                      Input Delay
                    Min             Max       Related Related
 Input Port     Rise    Fall    Rise    Fall   Clock   Pin
-----------------------------------------------------------------
data_in_8b[0]     --      --    0.40    0.40  fun_pclk
                                                        -- 
data_in_8b[1]     --      --    0.40    0.40  fun_pclk
                                                        -- 
data_in_8b[2]     --      --    0.40    0.40  fun_pclk
                                                        -- 
data_in_8b[3]     --      --    0.40    0.40  fun_pclk
                                                        -- 
data_in_8b[4]     --      --    0.40    0.40  fun_pclk
                                                        -- 
data_in_8b[5]     --      --    0.40    0.40  fun_pclk
                                                        -- 
data_in_8b[6]     --      --    0.40    0.40  fun_pclk
                                                        -- 
data_in_8b[7]     --      --    0.40    0.40  fun_pclk
                                                        -- 
fun_pclk        --      --      --      --      --      --
fun_rst_n       --      --      --      --      --      --
fun_sclk        --      --      --      --      --      --
kin               --      --    0.40    0.40  fun_pclk
                                                        -- 
scan_clk        --      --      --      --      --      --
scan_en         --      --      --      --      --      --
scan_in_1       --      --      --      --      --      --
scan_in_2       --      --      --      --      --      --
scan_in_3       --      --      --      --      --      --
scan_in_4       --      --      --      --      --      --
scan_in_5       --      --      --      --      --      --
scan_rst        --      --      --      --      --      --
test_mode       --      --      --      --      --      --

            Resistance (min/max)
Input Port  Rise             Fall
--------------------------------------------------------------------------------
data_in_8b[0]
            --               --
data_in_8b[1]
            --               --
data_in_8b[2]
            --               --
data_in_8b[3]
            --               --
data_in_8b[4]
            --               --
data_in_8b[5]
            --               --
data_in_8b[6]
            --               --
data_in_8b[7]
            --               --
fun_pclk    --               --
fun_rst_n   --               --
fun_sclk    --               --
kin         --               --
scan_clk    --               --
scan_en     --               --
scan_in_1   --               --
scan_in_2   --               --
scan_in_3   --               --
scan_in_4   --               --
scan_in_5   --               --
scan_rst    --               --
test_mode   --               --

            Transition (min/max)
Input Port  Rise             Fall             Related Clock
--------------------------------------------------------------------------------
fun_pclk    0.30/0.30        0.20/0.20
fun_sclk    0.20/0.20        0.20/0.20
scan_clk    0.20/0.20        0.20/0.20

                      Driving Cell
Input Port     Type     Cell                Mult      Clock     Attrs
--------------------------------------------------------------------------------
data_in_8b[0]  min_rise NBUFFX2/Z           
data_in_8b[0]  min_fall NBUFFX2/Z           
data_in_8b[0]  max_rise NBUFFX2/Z           
data_in_8b[0]  max_fall NBUFFX2/Z           
data_in_8b[1]  min_rise NBUFFX2/Z           
data_in_8b[1]  min_fall NBUFFX2/Z           
data_in_8b[1]  max_rise NBUFFX2/Z           
data_in_8b[1]  max_fall NBUFFX2/Z           
data_in_8b[2]  min_rise NBUFFX2/Z           
data_in_8b[2]  min_fall NBUFFX2/Z           
data_in_8b[2]  max_rise NBUFFX2/Z           
data_in_8b[2]  max_fall NBUFFX2/Z           
data_in_8b[3]  min_rise NBUFFX2/Z           
data_in_8b[3]  min_fall NBUFFX2/Z           
data_in_8b[3]  max_rise NBUFFX2/Z           
data_in_8b[3]  max_fall NBUFFX2/Z           
data_in_8b[4]  min_rise NBUFFX2/Z           
data_in_8b[4]  min_fall NBUFFX2/Z           
data_in_8b[4]  max_rise NBUFFX2/Z           
data_in_8b[4]  max_fall NBUFFX2/Z           
data_in_8b[5]  min_rise NBUFFX2/Z           
data_in_8b[5]  min_fall NBUFFX2/Z           
data_in_8b[5]  max_rise NBUFFX2/Z           
data_in_8b[5]  max_fall NBUFFX2/Z           
data_in_8b[6]  min_rise NBUFFX2/Z           
data_in_8b[6]  min_fall NBUFFX2/Z           
data_in_8b[6]  max_rise NBUFFX2/Z           
data_in_8b[6]  max_fall NBUFFX2/Z           
data_in_8b[7]  min_rise NBUFFX2/Z           
data_in_8b[7]  min_fall NBUFFX2/Z           
data_in_8b[7]  max_rise NBUFFX2/Z           
data_in_8b[7]  max_fall NBUFFX2/Z           
kin            min_rise NBUFFX2/Z           
kin            min_fall NBUFFX2/Z           
kin            max_rise NBUFFX2/Z           
kin            max_fall NBUFFX2/Z           

                     Output Delay
                    Min             Max       Related Related
 Output Port    Rise    Fall    Rise    Fall   Clock   Pin
-----------------------------------------------------------------
code_err          --      --    0.40    0.40  fun_sclk
                                                        -- 
disp_err          --      --    0.40    0.40  fun_sclk
                                                        -- 
k_err             --      --    0.40    0.40  fun_sclk
                                                        -- 
kout              --      --    0.40    0.40  fun_sclk
                                                        -- 
pdata[0]          --      --    0.40    0.40  fun_sclk
                                                        -- 
pdata[1]          --      --    0.40    0.40  fun_sclk
                                                        -- 
pdata[2]          --      --    0.40    0.40  fun_sclk
                                                        -- 
pdata[3]          --      --    0.40    0.40  fun_sclk
                                                        -- 
pdata[4]          --      --    0.40    0.40  fun_sclk
                                                        -- 
pdata[5]          --      --    0.40    0.40  fun_sclk
                                                        -- 
pdata[6]          --      --    0.40    0.40  fun_sclk
                                                        -- 
pdata[7]          --      --    0.40    0.40  fun_sclk
                                                        -- 
rdispout          --      --    0.40    0.40  fun_sclk
                                                        -- 
scan_out_1      --      --      --      --      --      --
scan_out_2      --      --      --      --      --      --
scan_out_3      --      --      --      --      --      --
scan_out_4      --      --      --      --      --      --
scan_out_5      --      --      --      --      --      --
1
icc2_shell> report_clock_settings >  ../report/cts_clk_setting.rpt
icc2_shell> report_utilization -verbose > ../report/utilization.rpt
icc2_shell> check_pg_drc  > ../report/pg_drc_final.rpt
icc2_shell> check_routes -drc true > ../report/DRC.rpt
icc2_shell> report_design > ../report/design.rpt
icc2_shell> report_cell   > ../report/cells.rpt
icc2_shell> report_qor    > ../report/qor.rpt
icc2_shell> report_timing -delay_type min -nosplit > ../report/timing_min.rpt
icc2_shell> report_timing -delay_type max -nosplit > ../report/timing_max.rpt
icc2_shell> # ================================================ #
icc2_shell> # =================== End_Step =================== #
icc2_shell> # ================================================ #
icc2_shell> write_def ../output/${design}.def
****************************************
Report : Data Mismatches
Version: O-2018.06-SP1
Date   : Tue Aug 26 08:26:47 2025
****************************************
No mismatches exist on the design.
---------------------------------------
Number of Written DEF Constructs
---------------------------------------
VERSION                        : 1
DIVIDERCHAR                    : 1
BUSBITCHARS                    : 1
DESIGN                         : 1
UNITS                          : 1
PROPERTYDEFINITIONS            : 1
DIEAREA                        : 1
ROW                            : 55
TRACKS                         : 18
VIAS                           : 11
NONDEFAULTRULES                : 1
COMPONENTS                     : 1214
PINS                           : 41
PINPROPERTIES                  : 39
SPECIALNETS                    : 4
NETS                           : 1244
SCANCHAINS                     : 5
1
icc2_shell> write_verilog -include {all} ../output/${design}.v
1
icc2_shell> save_block ;
Information: Saving block 'SerDes.dlib:SerDes_cts.design'
1
icc2_shell> check_legality

************************

running check_legality

Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 56 total shapes.
Layer M2: cached 0 shapes out of 102 total shapes.
Cached 728 vias out of 2971 total vias.

check_legality for block design system ... 
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
Design has no advanced rules
Checking legality
Checking cell legality:
0%....10%....20%....30%....40%....50%....60%....70%....80%....90%....100%
Sorting rows.
Checking spacing rule legality.
0%....10%....20%....30%....40%....50%....60%....70%....80%....90%....100%
Checking packing rule legality.


****************************************
  Report : Legality
****************************************

VIOLATIONS BY CATEGORY:
   MOVABLE  APP-FIXED USER-FIXED  DESCRIPTION
         0          0          0  Two objects overlap.
         0          0          0  A cell violates a pnet.
         0          0          0  A cell is illegal at a site.
         0          0          0  A cell is not aligned with a site.
         0          0          0  A cell has an illegal orientation.
         0          0          0  A cell spacing rule is violated.
         0          0          0  A layer rule is violated.
         0          0          0  A cell is in the wrong region.
         0          0          0  Two cells violate cts margins.
         0          0          0  Two cells violate coloring.

         0          0          0  TOTAL

TOTAL 0 Violations.

VIOLATIONS BY SUBCATEGORY:
     MOVABLE  APP-FIXED USER-FIXED  DESCRIPTION

         0          0          0    Two objects overlap.
           0          0          0    Two cells overlap.
           0          0          0    Two cells have overlapping keepout margins.
           0          0          0    A cell overlaps a blockage.
           0          0          0    A cell keepout margin overlaps a blockage.

         0          0          0    A cell violates a pnet.

         0          0          0    A cell is illegal at a site.
           0          0          0    A cell violates pin-track alignment rules.
           0          0          0    A cell is illegal at a site.
           0          0          0    A cell violates legal index rule.
           0          0          0    A cell has the wrong variant for its location.

         0          0          0    A cell is not aligned with a site.
           0          0          0    A cell is not aligned with the base site.
           0          0          0    A cell is not aligned with an overlaid site.

         0          0          0    A cell has an illegal orientation.

         0          0          0    A cell spacing rule is violated.
           0          0          0    A spacing rule is violated in a row.
           0          0          0    A spacing rule is violated between adjacent rows.
           0          0          0    A cell violates vertical abutment rule.
           0          0          0    A cell violates metal spacing rule.

         0          0          0    A layer rule is violated.
           0          0          0    A layer VTH rule is violated.
           0          0          0    A layer OD rule is violated.
           0          0          0    A layer OD max-width rule is violated.
           0          0          0    A layer ALL_OD corner rule is violated.
           0          0          0    A layer max-vertical-length rule is violated.
           0          0          0    A layer TPO rule is violated.
           0          0          0    Filler cell insertion cannot satisfy layer rules.

         0          0          0    A cell is in the wrong region.
           0          0          0    A cell is outside its hard bound.
           0          0          0    A cell is in the wrong voltage area.
           0          0          0    A cell violates an exclusive movebound.

         0          0          0    Two cells violate cts margins.

         0          0          0    Two cells violate coloring.


check_legality for block design system succeeded!


check_legality succeeded.

**************************

1
icc2_shell> check_routes -drc true
Warning: Ignore contact DIFFCON. (ZRT-015)
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M8
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Warning: Contact VIA89's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 pitch 0.320 may be too small: wire/via-down 0.315, wire/via-up 0.330. (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 pitch 0.320 may be too small: wire/via-down 0.360, wire/via-up 0.320. (ZRT-026)


Start checking for open nets ... 

net(data_in_8b[7]) has floating ports (dbId = 0 idx_ = 0 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[6]) has floating ports (dbId = 1 idx_ = 1 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[5]) has floating ports (dbId = 2 idx_ = 2 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[4]) has floating ports (dbId = 3 idx_ = 3 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[3]) has floating ports (dbId = 4 idx_ = 4 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[2]) has floating ports (dbId = 5 idx_ = 5 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[1]) has floating ports (dbId = 6 idx_ = 6 numNodes = 2 numEdges = 0 numCmps = 2)
net(data_in_8b[0]) has floating ports (dbId = 7 idx_ = 7 numNodes = 2 numEdges = 0 numCmps = 2)
net(kin) has floating ports (dbId = 8 idx_ = 8 numNodes = 2 numEdges = 0 numCmps = 2)
net(rdispout) has floating ports (dbId = 9 idx_ = 9 numNodes = 3 numEdges = 0 numCmps = 3)
net(k_err) has floating ports (dbId = 10 idx_ = 10 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[7]) has floating ports (dbId = 11 idx_ = 11 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[6]) has floating ports (dbId = 12 idx_ = 12 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[5]) has floating ports (dbId = 13 idx_ = 13 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[4]) has floating ports (dbId = 14 idx_ = 14 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[3]) has floating ports (dbId = 15 idx_ = 15 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[2]) has floating ports (dbId = 16 idx_ = 16 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[1]) has floating ports (dbId = 17 idx_ = 17 numNodes = 3 numEdges = 0 numCmps = 3)
net(pdata[0]) has floating ports (dbId = 18 idx_ = 18 numNodes = 3 numEdges = 0 numCmps = 3)
net(kout) has floating ports (dbId = 19 idx_ = 19 numNodes = 3 numEdges = 0 numCmps = 3)
net(code_err) has floating ports (dbId = 20 idx_ = 20 numNodes = 3 numEdges = 0 numCmps = 3)
net(disp_err) has floating ports (dbId = 21 idx_ = 21 numNodes = 3 numEdges = 0 numCmps = 3)
net(fun_rst_n) has floating ports (dbId = 25 idx_ = 25 numNodes = 2 numEdges = 0 numCmps = 2)
net(scan_rst) has floating ports (dbId = 26 idx_ = 26 numNodes = 2 numEdges = 0 numCmps = 2)
net(test_mode) has floating ports (dbId = 27 idx_ = 27 numNodes = 3 numEdges = 0 numCmps = 3)
net(scan_en) has floating ports (dbId = 28 idx_ = 28 numNodes = 79 numEdges = 0 numCmps = 79)
net(scan_in_1) has floating ports (dbId = 29 idx_ = 29 numNodes = 2 numEdges = 0 numCmps = 2)
net(scan_in_2) has floating ports (dbId = 31 idx_ = 30 numNodes = 2 numEdges = 0 numCmps = 2)
net(scan_in_3) has floating ports (dbId = 33 idx_ = 31 numNodes = 2 numEdges = 0 numCmps = 2)
net(scan_in_4) has floating ports (dbId = 35 idx_ = 32 numNodes = 2 numEdges = 0 numCmps = 2)
net(aps_rename_39_) has floating ports (dbId = 36 idx_ = 33 numNodes = 3 numEdges = 0 numCmps = 3)
net(scan_in_5) has floating ports (dbId = 37 idx_ = 34 numNodes = 2 numEdges = 0 numCmps = 2)
net(reset_n) has floating ports (dbId = 41 idx_ = 37 numNodes = 3 numEdges = 0 numCmps = 3)
net(rdispout_trans) has floating ports (dbId = 42 idx_ = 38 numNodes = 3 numEdges = 0 numCmps = 3)
net(data_out_s) has floating ports (dbId = 43 idx_ = 39 numNodes = 4 numEdges = 0 numCmps = 4)
net(n1) has floating ports (dbId = 44 idx_ = 40 numNodes = 2 numEdges = 0 numCmps = 2)
net(n2) has floating ports (dbId = 45 idx_ = 41 numNodes = 2 numEdges = 0 numCmps = 2)
net(n12) has floating ports (dbId = 46 idx_ = 42 numNodes = 3 numEdges = 0 numCmps = 3)
net(n13) has floating ports (dbId = 47 idx_ = 43 numNodes = 2 numEdges = 0 numCmps = 2)
net(n14) has floating ports (dbId = 48 idx_ = 44 numNodes = 2 numEdges = 0 numCmps = 2)
net(n15) has floating ports (dbId = 49 idx_ = 45 numNodes = 3 numEdges = 0 numCmps = 3)
net(n16) has floating ports (dbId = 50 idx_ = 46 numNodes = 2 numEdges = 0 numCmps = 2)
net(n17) has floating ports (dbId = 51 idx_ = 47 numNodes = 2 numEdges = 0 numCmps = 2)
net(n18) has floating ports (dbId = 52 idx_ = 48 numNodes = 2 numEdges = 0 numCmps = 2)
net(n19) has floating ports (dbId = 53 idx_ = 49 numNodes = 2 numEdges = 0 numCmps = 2)
net(n23) has floating ports (dbId = 54 idx_ = 50 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/valid) has floating ports (dbId = 90 idx_ = 51 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/n4) has floating ports (dbId = 91 idx_ = 52 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/n5) has floating ports (dbId = 92 idx_ = 53 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[9]) has floating ports (dbId = 94 idx_ = 54 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[8]) has floating ports (dbId = 95 idx_ = 55 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[7]) has floating ports (dbId = 96 idx_ = 56 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[6]) has floating ports (dbId = 97 idx_ = 57 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[4]) has floating ports (dbId = 99 idx_ = 58 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[3]) has floating ports (dbId = 100 idx_ = 59 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/dataout_10b[0]) has floating ports (dbId = 102 idx_ = 60 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n30) has floating ports (dbId = 121 idx_ = 61 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n31) has floating ports (dbId = 122 idx_ = 62 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n32) has floating ports (dbId = 123 idx_ = 63 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n33) has floating ports (dbId = 124 idx_ = 64 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n34) has floating ports (dbId = 125 idx_ = 65 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n35) has floating ports (dbId = 126 idx_ = 66 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n37) has floating ports (dbId = 127 idx_ = 67 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n9) has floating ports (dbId = 128 idx_ = 68 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n10) has floating ports (dbId = 129 idx_ = 69 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n11) has floating ports (dbId = 130 idx_ = 70 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n13) has floating ports (dbId = 131 idx_ = 71 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n14) has floating ports (dbId = 132 idx_ = 72 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n15) has floating ports (dbId = 133 idx_ = 73 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n16) has floating ports (dbId = 134 idx_ = 74 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n17) has floating ports (dbId = 135 idx_ = 75 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n18) has floating ports (dbId = 136 idx_ = 76 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n19) has floating ports (dbId = 137 idx_ = 77 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/serial/n20) has floating ports (dbId = 138 idx_ = 78 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n21) has floating ports (dbId = 139 idx_ = 79 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n22) has floating ports (dbId = 140 idx_ = 80 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n23) has floating ports (dbId = 141 idx_ = 81 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n24) has floating ports (dbId = 142 idx_ = 82 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n25) has floating ports (dbId = 143 idx_ = 83 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n26) has floating ports (dbId = 144 idx_ = 84 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n27) has floating ports (dbId = 145 idx_ = 85 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n28) has floating ports (dbId = 146 idx_ = 86 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n29) has floating ports (dbId = 147 idx_ = 87 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n36) has floating ports (dbId = 148 idx_ = 88 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n38) has floating ports (dbId = 149 idx_ = 89 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n39) has floating ports (dbId = 150 idx_ = 90 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n40) has floating ports (dbId = 151 idx_ = 91 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n41) has floating ports (dbId = 152 idx_ = 92 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n189) has floating ports (dbId = 153 idx_ = 93 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n190) has floating ports (dbId = 154 idx_ = 94 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n191) has floating ports (dbId = 155 idx_ = 95 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n192) has floating ports (dbId = 156 idx_ = 96 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n193) has floating ports (dbId = 157 idx_ = 97 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n194) has floating ports (dbId = 158 idx_ = 98 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n195) has floating ports (dbId = 159 idx_ = 99 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n196) has floating ports (dbId = 160 idx_ = 100 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n197) has floating ports (dbId = 161 idx_ = 101 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n198) has floating ports (dbId = 162 idx_ = 102 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n199) has floating ports (dbId = 163 idx_ = 103 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n200) has floating ports (dbId = 164 idx_ = 104 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n201) has floating ports (dbId = 165 idx_ = 105 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n202) has floating ports (dbId = 166 idx_ = 106 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n203) has floating ports (dbId = 167 idx_ = 107 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n204) has floating ports (dbId = 168 idx_ = 108 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n205) has floating ports (dbId = 169 idx_ = 109 numNodes = 3 numEdges = 0 numCmps = 3)
net(optlc_net_672) has floating ports (dbId = 171 idx_ = 110 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_673) has floating ports (dbId = 172 idx_ = 111 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n209) has floating ports (dbId = 173 idx_ = 112 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n210) has floating ports (dbId = 174 idx_ = 113 numNodes = 3 numEdges = 0 numCmps = 3)
net(optlc_net_674) has floating ports (dbId = 175 idx_ = 114 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_675) has floating ports (dbId = 176 idx_ = 115 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_676) has floating ports (dbId = 177 idx_ = 116 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_677) has floating ports (dbId = 178 idx_ = 117 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_678) has floating ports (dbId = 179 idx_ = 118 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n216) has floating ports (dbId = 180 idx_ = 119 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n217) has floating ports (dbId = 181 idx_ = 120 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_679) has floating ports (dbId = 182 idx_ = 121 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n219) has floating ports (dbId = 183 idx_ = 122 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n220) has floating ports (dbId = 184 idx_ = 123 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n221) has floating ports (dbId = 185 idx_ = 124 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n222) has floating ports (dbId = 186 idx_ = 125 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n223) has floating ports (dbId = 187 idx_ = 126 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n224) has floating ports (dbId = 188 idx_ = 127 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n225) has floating ports (dbId = 189 idx_ = 128 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n226) has floating ports (dbId = 190 idx_ = 129 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n227) has floating ports (dbId = 191 idx_ = 130 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n228) has floating ports (dbId = 192 idx_ = 131 numNodes = 3 numEdges = 0 numCmps = 3)
net(optlc_net_680) has floating ports (dbId = 193 idx_ = 132 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_681) has floating ports (dbId = 194 idx_ = 133 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n231) has floating ports (dbId = 195 idx_ = 134 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/serial/n232) has floating ports (dbId = 196 idx_ = 135 numNodes = 3 numEdges = 0 numCmps = 3)
net(optlc_net_682) has floating ports (dbId = 197 idx_ = 136 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n234) has floating ports (dbId = 198 idx_ = 137 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n235) has floating ports (dbId = 199 idx_ = 138 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n236) has floating ports (dbId = 200 idx_ = 139 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n237) has floating ports (dbId = 201 idx_ = 140 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n238) has floating ports (dbId = 202 idx_ = 141 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n239) has floating ports (dbId = 203 idx_ = 142 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/serial/n240) has floating ports (dbId = 204 idx_ = 143 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n241) has floating ports (dbId = 205 idx_ = 144 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n242) has floating ports (dbId = 206 idx_ = 145 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/serial/n243) has floating ports (dbId = 207 idx_ = 146 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n244) has floating ports (dbId = 208 idx_ = 147 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n246) has floating ports (dbId = 210 idx_ = 148 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n248) has floating ports (dbId = 212 idx_ = 149 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n250) has floating ports (dbId = 213 idx_ = 150 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/serial/n252) has floating ports (dbId = 215 idx_ = 151 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/serial/n253) has floating ports (dbId = 216 idx_ = 152 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/kin_reg) has floating ports (dbId = 247 idx_ = 153 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/k_err_in) has floating ports (dbId = 248 idx_ = 154 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/rdispout_in) has floating ports (dbId = 249 idx_ = 155 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n2) has floating ports (dbId = 250 idx_ = 156 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n4) has floating ports (dbId = 251 idx_ = 157 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n43) has floating ports (dbId = 253 idx_ = 158 numNodes = 3 numEdges = 0 numCmps = 3)
net(optlc_net_683) has floating ports (dbId = 254 idx_ = 159 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_684) has floating ports (dbId = 255 idx_ = 160 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n55) has floating ports (dbId = 256 idx_ = 161 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n56) has floating ports (dbId = 257 idx_ = 162 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n57) has floating ports (dbId = 258 idx_ = 163 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_685) has floating ports (dbId = 259 idx_ = 164 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_686) has floating ports (dbId = 260 idx_ = 165 numNodes = 2 numEdges = 0 numCmps = 2)
net(optlc_net_687) has floating ports (dbId = 261 idx_ = 166 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n62) has floating ports (dbId = 263 idx_ = 167 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n63) has floating ports (dbId = 264 idx_ = 168 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n64) has floating ports (dbId = 265 idx_ = 169 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n65) has floating ports (dbId = 266 idx_ = 170 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n66) has floating ports (dbId = 267 idx_ = 171 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n67) has floating ports (dbId = 268 idx_ = 172 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n71) has floating ports (dbId = 272 idx_ = 173 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n72) has floating ports (dbId = 273 idx_ = 174 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n73) has floating ports (dbId = 274 idx_ = 175 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n74) has floating ports (dbId = 275 idx_ = 176 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n75) has floating ports (dbId = 276 idx_ = 177 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n76) has floating ports (dbId = 277 idx_ = 178 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n77) has floating ports (dbId = 278 idx_ = 179 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n78) has floating ports (dbId = 279 idx_ = 180 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n79) has floating ports (dbId = 280 idx_ = 181 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n80) has floating ports (dbId = 281 idx_ = 182 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n81) has floating ports (dbId = 282 idx_ = 183 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n82) has floating ports (dbId = 283 idx_ = 184 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/enc/n83) has floating ports (dbId = 284 idx_ = 185 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n84) has floating ports (dbId = 285 idx_ = 186 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n85) has floating ports (dbId = 286 idx_ = 187 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n86) has floating ports (dbId = 287 idx_ = 188 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n87) has floating ports (dbId = 288 idx_ = 189 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n90) has floating ports (dbId = 290 idx_ = 190 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n91) has floating ports (dbId = 291 idx_ = 191 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n92) has floating ports (dbId = 292 idx_ = 192 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n93) has floating ports (dbId = 293 idx_ = 193 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n94) has floating ports (dbId = 294 idx_ = 194 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n95) has floating ports (dbId = 295 idx_ = 195 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n96) has floating ports (dbId = 296 idx_ = 196 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n97) has floating ports (dbId = 297 idx_ = 197 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/n99) has floating ports (dbId = 298 idx_ = 198 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/n100) has floating ports (dbId = 299 idx_ = 199 numNodes = 2 numEdges = 0 numCmps = 2)
net(transmitter/enc/data_reg[6]) has floating ports (dbId = 301 idx_ = 200 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/enc/data_reg[5]) has floating ports (dbId = 302 idx_ = 201 numNodes = 4 numEdges = 0 numCmps = 4)
net(transmitter/enc/_gOb13_data_reg[4]) has floating ports (dbId = 303 idx_ = 202 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/data_reg[3]) has floating ports (dbId = 304 idx_ = 203 numNodes = 3 numEdges = 0 numCmps = 3)
net(transmitter/enc/_gOb15_data_reg[2]) has floating ports (dbId = 305 idx_ = 204 numNodes = 3 numEdges = 0 numCmps = 3)

... and 1038 more nets has floating ports 

Total number of nets = 1246, of which 0 are not extracted
Total number of open nets = 1238, of which 0 are frozen

Check 1246 nets, 1238 have Errors

[CHECK OPEN NETS] Elapsed real time: 0:00:00 
[CHECK OPEN NETS] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[CHECK OPEN NETS] Stage (MB): Used    0  Alloctr    0  Proc    0 
[CHECK OPEN NETS] Total (MB): Used   68  Alloctr   69  Proc 1979 
Printing options for 'route.common.*'

Printing options for 'route.detail.*'
detail.antenna                                          :        true                
detail.force_end_on_preferred_grid                      :        true                

Printing options for 'route.auto_via_ladder.*'


Begin full DRC check ...

Information: Using 8 threads for routing. (ZRT-444)
Checked 1/4 Partitions, Violations =    0
Checked 2/4 Partitions, Violations =    0
Checked 3/4 Partitions, Violations =    0
Checked 4/4 Partitions, Violations =    0
[DRC CHECK] Elapsed real time: 0:00:00 
[DRC CHECK] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DRC CHECK] Stage (MB): Used    0  Alloctr    0  Proc    0 
[DRC CHECK] Total (MB): Used   83  Alloctr   84  Proc 1979 
Warning: No antenna rules defined, Skip antenna analysis. (ZRT-309)

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      0


Total Wire Length =                    1317 micron
Total Number of Contacts =             278
Total Number of Wires =                274
Total Number of PtConns =              31
Total Number of Routed Wires =       274
Total Routed Wire Length =           1310 micron
Total Number of Routed Contacts =       278
        Layer          M1 :          0 micron
        Layer          M2 :         62 micron
        Layer          M3 :        553 micron
        Layer          M4 :        628 micron
        Layer          M5 :         74 micron
        Layer          M6 :          0 micron
        Layer          M7 :          0 micron
        Layer          M8 :          0 micron
        Layer          M9 :          0 micron
        Via        VIA45C :          6
        Via        VIA34C :          6
        Via   VIA34C(rot) :         94
        Via        VIA23C :         87
        Via   VIA12C(rot) :         67
        Via   VIA12B(rot) :         18

 
Redundant via conversion report:
--------------------------------

  Total optimized via conversion rate =  0.00% (0 / 278 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (87      vias)
    Layer VIA3       =  0.00% (0      / 100     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (100     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (6       vias)
 
  Total double via conversion rate    =  0.00% (0 / 278 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
    Layer VIA3       =  0.00% (0      / 100     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
 
  The optimized via conversion rate based on total routed via count =  0.00% (0 / 278 vias)
 
    Layer VIA1       =  0.00% (0      / 85      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (85      vias)
    Layer VIA2       =  0.00% (0      / 87      vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (87      vias)
    Layer VIA3       =  0.00% (0      / 100     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (100     vias)
    Layer VIA4       =  0.00% (0      / 6       vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (6       vias)
 


Verify Summary:

Total number of nets = 1246, of which 0 are not extracted
Total number of open nets = 1238, of which 0 are frozen
Total number of excluded ports = 0 ports of 0 unplaced cells connected to 0 nets
                                 0 ports without pins of 0 cells connected to 0 nets
                                 0 ports of 0 cover cells connected to 0 non-pg nets
Total number of DRCs = 0
Total number of antenna violations = no antenna rules defined
Total number of tie to rail violations = not checked
Total number of tie to rail directly violations = not checked


icc2_shell> check_pg_drc
Command check_pg_drc started  at Tue Aug 26 08:27:10 2025
Command check_pg_drc finished at Tue Aug 26 08:27:10 2025
CPU usage for check_pg_drc: 0.31 seconds ( 0.00 hours)
Elapsed time for check_pg_drc: 0.06 seconds ( 0.00 hours)
No errors found.
icc2_shell> report_timing -delay_type max -max_paths 20
****************************************
Report : timing
        -path_type full
        -delay_type max
        -max_paths 20
        -report_by design
Design : system
Version: O-2018.06-SP1
Date   : Tue Aug 26 08:27:21 2025
****************************************
Information: Timer using 'CRPR'. (TIM-050)

  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/datout_reg[5] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.85      1.61 f
  receiver/ds/U88/ZN (INVX0)                       0.12      1.73 r
  receiver/ds/U90/ZN (INVX0)                       0.15      1.89 f
  receiver/ds/U118/Q (OA21X1)                      0.33      2.22 f
  receiver/ds/U72/ZN (INVX0)                       0.12      2.34 r
  receiver/ds/U73/ZN (INVX0)                       0.10      2.45 f
  receiver/ds/U119/QN (NOR2X0)                     0.11      2.56 r
  receiver/ds/U103/ZN (INVX0)                      0.13      2.69 f
  receiver/ds/U105/ZN (INVX0)                      0.12      2.81 r
  receiver/ds/U39/Q (AND3X1)                       0.35      3.16 r
  receiver/ds/U43/Q (AND2X1)                       0.26      3.42 r
  receiver/ds/U46/QN (OAI22X1)                     0.41      3.83 f
  receiver/ds/datout_reg[5]/D (SDFFARX1)           0.00      3.83 f
  data arrival time                                          3.83

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.76     25.76
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/datout_reg[5]/CLK (SDFFARX1)         0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.83
  ------------------------------------------------------------------------
  slack (MET)                                               21.33



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/datout_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.85      1.61 f
  receiver/ds/U88/ZN (INVX0)                       0.12      1.73 r
  receiver/ds/U90/ZN (INVX0)                       0.15      1.89 f
  receiver/ds/U118/Q (OA21X1)                      0.33      2.22 f
  receiver/ds/U72/ZN (INVX0)                       0.12      2.34 r
  receiver/ds/U73/ZN (INVX0)                       0.10      2.45 f
  receiver/ds/U119/QN (NOR2X0)                     0.11      2.56 r
  receiver/ds/U103/ZN (INVX0)                      0.13      2.69 f
  receiver/ds/U105/ZN (INVX0)                      0.12      2.81 r
  receiver/ds/U39/Q (AND3X1)                       0.35      3.16 r
  receiver/ds/U51/Q (AND2X1)                       0.24      3.40 r
  receiver/ds/U52/QN (OAI22X1)                     0.40      3.81 f
  receiver/ds/datout_reg[1]/D (SDFFARX1)           0.00      3.81 f
  data arrival time                                          3.81

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.76     25.76
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/datout_reg[1]/CLK (SDFFARX1)         0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.81
  ------------------------------------------------------------------------
  slack (MET)                                               21.35



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/datout_reg[4] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.82      1.59 r
  receiver/ds/U88/ZN (INVX0)                       0.13      1.72 f
  receiver/ds/U90/ZN (INVX0)                       0.15      1.87 r
  receiver/ds/U118/Q (OA21X1)                      0.35      2.22 r
  receiver/ds/U115/ZN (INVX0)                      0.13      2.35 f
  receiver/ds/U30/Q (AND2X1)                       0.19      2.54 f
  receiver/ds/U31/ZN (INVX0)                       0.10      2.64 r
  receiver/ds/U117/ZN (INVX0)                      0.12      2.76 f
  receiver/ds/U79/ZN (INVX0)                       0.13      2.88 r
  receiver/ds/U106/ZN (INVX0)                      0.13      3.02 f
  receiver/ds/U58/Q (AND3X1)                       0.31      3.33 f
  receiver/ds/U55/ZN (INVX0)                       0.09      3.42 r
  receiver/ds/U50/QN (OAI22X1)                     0.38      3.81 f
  receiver/ds/datout_reg[4]/D (SDFFARX1)           0.00      3.81 f
  data arrival time                                          3.81

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.76     25.76
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/datout_reg[4]/CLK (SDFFARX1)         0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.81
  ------------------------------------------------------------------------
  slack (MET)                                               21.35



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/datout_reg[7] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.82      1.59 r
  receiver/ds/U88/ZN (INVX0)                       0.13      1.72 f
  receiver/ds/U90/ZN (INVX0)                       0.15      1.87 r
  receiver/ds/U118/Q (OA21X1)                      0.35      2.22 r
  receiver/ds/U72/ZN (INVX0)                       0.13      2.35 f
  receiver/ds/U73/ZN (INVX0)                       0.09      2.44 r
  receiver/ds/U119/QN (NOR2X0)                     0.11      2.55 f
  receiver/ds/U103/ZN (INVX0)                      0.12      2.67 r
  receiver/ds/U104/ZN (INVX0)                      0.16      2.83 f
  receiver/ds/U62/Q (AND3X1)                       0.34      3.17 f
  receiver/ds/U63/ZN (INVX0)                       0.17      3.33 r
  receiver/ds/U65/QN (OAI22X1)                     0.40      3.73 f
  receiver/ds/datout_reg[7]/D (SDFFARX1)           0.00      3.73 f
  data arrival time                                          3.73

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.76     25.76
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/datout_reg[7]/CLK (SDFFARX1)         0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.73
  ------------------------------------------------------------------------
  slack (MET)                                               21.43



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/datout_reg[2] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.82      1.59 r
  receiver/ds/U88/ZN (INVX0)                       0.13      1.72 f
  receiver/ds/U90/ZN (INVX0)                       0.15      1.87 r
  receiver/ds/U118/Q (OA21X1)                      0.35      2.22 r
  receiver/ds/U115/ZN (INVX0)                      0.13      2.35 f
  receiver/ds/U30/Q (AND2X1)                       0.19      2.54 f
  receiver/ds/U31/ZN (INVX0)                       0.10      2.64 r
  receiver/ds/U117/ZN (INVX0)                      0.12      2.76 f
  receiver/ds/U79/ZN (INVX0)                       0.13      2.88 r
  receiver/ds/U106/ZN (INVX0)                      0.13      3.02 f
  receiver/ds/U48/Q (AND2X1)                       0.22      3.24 f
  receiver/ds/U60/ZN (INVX0)                       0.08      3.32 r
  receiver/ds/U49/QN (OAI22X1)                     0.38      3.70 f
  receiver/ds/datout_reg[2]/D (SDFFARX1)           0.00      3.70 f
  data arrival time                                          3.70

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/datout_reg[2]/CLK (SDFFARX1)         0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.70
  ------------------------------------------------------------------------
  slack (MET)                                               21.46



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/datout_reg[8] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.82      1.59 r
  receiver/ds/U88/ZN (INVX0)                       0.13      1.72 f
  receiver/ds/U90/ZN (INVX0)                       0.15      1.87 r
  receiver/ds/U118/Q (OA21X1)                      0.35      2.22 r
  receiver/ds/U115/ZN (INVX0)                      0.13      2.35 f
  receiver/ds/U30/Q (AND2X1)                       0.19      2.54 f
  receiver/ds/U31/ZN (INVX0)                       0.10      2.64 r
  receiver/ds/U117/ZN (INVX0)                      0.12      2.76 f
  receiver/ds/U79/ZN (INVX0)                       0.13      2.88 r
  receiver/ds/U80/ZN (INVX0)                       0.13      3.01 f
  receiver/ds/U44/Q (AND2X1)                       0.21      3.23 f
  receiver/ds/U61/ZN (INVX0)                       0.09      3.31 r
  receiver/ds/U47/QN (OAI22X1)                     0.38      3.69 f
  receiver/ds/datout_reg[8]/D (SDFFARX1)           0.00      3.69 f
  data arrival time                                          3.69

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/datout_reg[8]/CLK (SDFFARX1)         0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.69
  ------------------------------------------------------------------------
  slack (MET)                                               21.47



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/bit_count_reg[3] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.82      1.59 r
  receiver/ds/U88/ZN (INVX0)                       0.13      1.72 f
  receiver/ds/U90/ZN (INVX0)                       0.15      1.87 r
  receiver/ds/U118/Q (OA21X1)                      0.35      2.22 r
  receiver/ds/U72/ZN (INVX0)                       0.13      2.35 f
  receiver/ds/U73/ZN (INVX0)                       0.09      2.44 r
  receiver/ds/U119/QN (NOR2X0)                     0.11      2.55 f
  receiver/ds/U103/ZN (INVX0)                      0.12      2.67 r
  receiver/ds/U104/ZN (INVX0)                      0.16      2.83 f
  receiver/ds/U62/Q (AND3X1)                       0.34      3.17 f
  receiver/ds/U63/ZN (INVX0)                       0.17      3.33 r
  receiver/ds/U116/ZN (INVX0)                      0.13      3.46 f
  receiver/ds/U45/Q (AO21X1)                       0.20      3.66 f
  receiver/ds/bit_count_reg[3]/D (SDFFARX1)        0.00      3.66 f
  data arrival time                                          3.66

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/bit_count_reg[3]/CLK (SDFFARX1)      0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.15
  data required time                                        25.15
  ------------------------------------------------------------------------
  data required time                                        25.15
  data arrival time                                         -3.66
  ------------------------------------------------------------------------
  slack (MET)                                               21.50



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/datout_reg[6] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.82      1.59 r
  receiver/ds/U88/ZN (INVX0)                       0.13      1.72 f
  receiver/ds/U90/ZN (INVX0)                       0.15      1.87 r
  receiver/ds/U118/Q (OA21X1)                      0.35      2.22 r
  receiver/ds/U115/ZN (INVX0)                      0.13      2.35 f
  receiver/ds/U30/Q (AND2X1)                       0.19      2.54 f
  receiver/ds/U31/ZN (INVX0)                       0.10      2.64 r
  receiver/ds/U117/ZN (INVX0)                      0.12      2.76 f
  receiver/ds/U64/Q (AND3X1)                       0.30      3.06 f
  receiver/ds/U33/ZN (INVX0)                       0.09      3.15 r
  receiver/ds/U32/QN (OAI22X1)                     0.38      3.53 f
  receiver/ds/datout_reg[6]/D (SDFFARX1)           0.00      3.53 f
  data arrival time                                          3.53

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/datout_reg[6]/CLK (SDFFARX1)         0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.53
  ------------------------------------------------------------------------
  slack (MET)                                               21.63



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/datout_reg[9] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.82      1.59 r
  receiver/ds/U88/ZN (INVX0)                       0.13      1.72 f
  receiver/ds/U90/ZN (INVX0)                       0.15      1.87 r
  receiver/ds/U118/Q (OA21X1)                      0.35      2.22 r
  receiver/ds/U72/ZN (INVX0)                       0.13      2.35 f
  receiver/ds/U73/ZN (INVX0)                       0.09      2.44 r
  receiver/ds/U119/QN (NOR2X0)                     0.11      2.55 f
  receiver/ds/U103/ZN (INVX0)                      0.12      2.67 r
  receiver/ds/U104/ZN (INVX0)                      0.16      2.83 f
  receiver/ds/U40/Q (AND2X1)                       0.23      3.06 f
  receiver/ds/U54/ZN (INVX0)                       0.08      3.14 r
  receiver/ds/U42/QN (OAI22X1)                     0.38      3.53 f
  receiver/ds/datout_reg[9]/D (SDFFARX1)           0.00      3.53 f
  data arrival time                                          3.53

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/datout_reg[9]/CLK (SDFFARX1)         0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.53
  ------------------------------------------------------------------------
  slack (MET)                                               21.63



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/datout_reg[3] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.82      1.59 r
  receiver/ds/U88/ZN (INVX0)                       0.13      1.72 f
  receiver/ds/U90/ZN (INVX0)                       0.15      1.87 r
  receiver/ds/U118/Q (OA21X1)                      0.35      2.22 r
  receiver/ds/U72/ZN (INVX0)                       0.13      2.35 f
  receiver/ds/U73/ZN (INVX0)                       0.09      2.44 r
  receiver/ds/U119/QN (NOR2X0)                     0.11      2.55 f
  receiver/ds/U103/ZN (INVX0)                      0.12      2.67 r
  receiver/ds/U105/ZN (INVX0)                      0.13      2.80 f
  receiver/ds/U38/Q (AND2X1)                       0.23      3.03 f
  receiver/ds/U57/ZN (INVX0)                       0.08      3.12 r
  receiver/ds/U41/QN (OAI22X1)                     0.38      3.49 f
  receiver/ds/datout_reg[3]/D (SDFFARX1)           0.00      3.49 f
  data arrival time                                          3.49

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/datout_reg[3]/CLK (SDFFARX1)         0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.49
  ------------------------------------------------------------------------
  slack (MET)                                               21.67



  Startpoint: transmitter/serial/counter_reg[2] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: transmitter/serial/data_out_reg (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  transmitter/serial/counter_reg[2]/CLK (SDFFARX1)
                                                   0.00      0.77 r
  transmitter/serial/counter_reg[2]/QN (SDFFARX1)
                                                   0.64      1.40 r
  transmitter/serial/U65/ZN (INVX0)                0.14      1.54 f
  transmitter/serial/U66/ZN (INVX0)                0.12      1.65 r
  transmitter/serial/U46/ZN (INVX0)                0.12      1.78 f
  transmitter/serial/U48/ZN (INVX0)                0.11      1.88 r
  transmitter/serial/U45/ZN (INVX0)                0.12      2.00 f
  transmitter/serial/U92/QN (NAND2X0)              0.13      2.13 r
  transmitter/serial/U76/Q (AO21X1)                0.29      2.42 r
  transmitter/serial/U30/Q (AND4X1)                0.36      2.78 r
  transmitter/serial/U26/Q (OA22X1)                0.30      3.09 r
  transmitter/serial/U32/QN (OAI22X1)              0.38      3.47 f
  transmitter/serial/data_out_reg/D (SDFFARX1)     0.00      3.47 f
  data arrival time                                          3.47

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  transmitter/serial/data_out_reg/CLK (SDFFARX1)   0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.47
  ------------------------------------------------------------------------
  slack (MET)                                               21.69



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/bit_count_reg[2] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.85      1.61 f
  receiver/ds/U88/ZN (INVX0)                       0.12      1.73 r
  receiver/ds/U90/ZN (INVX0)                       0.15      1.89 f
  receiver/ds/U118/Q (OA21X1)                      0.33      2.22 f
  receiver/ds/U72/ZN (INVX0)                       0.12      2.34 r
  receiver/ds/U73/ZN (INVX0)                       0.10      2.45 f
  receiver/ds/U119/QN (NOR2X0)                     0.11      2.56 r
  receiver/ds/U103/ZN (INVX0)                      0.13      2.69 f
  receiver/ds/U104/ZN (INVX0)                      0.16      2.85 r
  receiver/ds/U34/QN (NAND3X0)                     0.17      3.02 f
  receiver/ds/U35/QN (OAI21X1)                     0.35      3.36 r
  receiver/ds/bit_count_reg[2]/D (SDFFARX1)        0.00      3.36 r
  data arrival time                                          3.36

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/bit_count_reg[2]/CLK (SDFFARX1)      0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.42     25.25
  data required time                                        25.25
  ------------------------------------------------------------------------
  data required time                                        25.25
  data arrival time                                         -3.36
  ------------------------------------------------------------------------
  slack (MET)                                               21.88



  Startpoint: transmitter/serial/counter_reg[3] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: transmitter/serial/counter_reg[0] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  transmitter/serial/counter_reg[3]/CLK (SDFFARX1)
                                                   0.00      0.77 r
  transmitter/serial/counter_reg[3]/Q (SDFFARX1)   0.80      1.56 r
  transmitter/serial/U63/ZN (INVX0)                0.14      1.70 f
  transmitter/serial/U55/ZN (INVX0)                0.16      1.86 r
  transmitter/serial/U56/ZN (INVX0)                0.15      2.01 f
  transmitter/serial/U71/ZN (INVX0)                0.12      2.13 r
  transmitter/serial/U19/Q (AND2X1)                0.23      2.36 r
  transmitter/serial/U20/ZN (INVX0)                0.11      2.47 f
  transmitter/serial/U21/Q (AND3X1)                0.27      2.74 f
  transmitter/serial/U52/ZN (INVX0)                0.13      2.87 r
  transmitter/serial/U75/QN (OAI22X1)              0.37      3.23 f
  transmitter/serial/counter_reg[0]/D (SDFFARX1)   0.00      3.23 f
  data arrival time                                          3.23

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.76     25.76
  clock reconvergence pessimism                    0.01     25.77
  transmitter/serial/counter_reg[0]/CLK (SDFFARX1)
                                                   0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -3.23
  ------------------------------------------------------------------------
  slack (MET)                                               21.93



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/bit_count_reg[0] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.82      1.59 r
  receiver/ds/U88/ZN (INVX0)                       0.13      1.72 f
  receiver/ds/U90/ZN (INVX0)                       0.15      1.87 r
  receiver/ds/U118/Q (OA21X1)                      0.35      2.22 r
  receiver/ds/U115/ZN (INVX0)                      0.13      2.35 f
  receiver/ds/U30/Q (AND2X1)                       0.19      2.54 f
  receiver/ds/U31/ZN (INVX0)                       0.10      2.64 r
  receiver/ds/U117/ZN (INVX0)                      0.12      2.76 f
  receiver/ds/U79/ZN (INVX0)                       0.13      2.88 r
  receiver/ds/U80/ZN (INVX0)                       0.13      3.01 f
  receiver/ds/bit_count_reg[0]/D (SDFFARX1)        0.00      3.01 f
  data arrival time                                          3.01

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/bit_count_reg[0]/CLK (SDFFARX1)      0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.52     25.15
  data required time                                        25.15
  ------------------------------------------------------------------------
  data required time                                        25.15
  data arrival time                                         -3.01
  ------------------------------------------------------------------------
  slack (MET)                                               22.14



  Startpoint: transmitter/serial/counter_reg[0] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: transmitter/serial/counter_reg[2] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  transmitter/serial/counter_reg[0]/CLK (SDFFARX1)
                                                   0.00      0.77 r
  transmitter/serial/counter_reg[0]/Q (SDFFARX1)   0.85      1.62 f
  transmitter/serial/U58/ZN (INVX0)                0.13      1.75 r
  transmitter/serial/U67/ZN (INVX0)                0.16      1.91 f
  transmitter/serial/U22/Q (AND4X1)                0.29      2.20 f
  transmitter/serial/U29/ZN (INVX0)                0.11      2.31 r
  transmitter/serial/U33/QN (OAI222X1)             0.61      2.92 f
  transmitter/serial/counter_reg[2]/D (SDFFARX1)   0.00      2.92 f
  data arrival time                                          2.92

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  transmitter/serial/counter_reg[2]/CLK (SDFFARX1)
                                                   0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.15
  data required time                                        25.15
  ------------------------------------------------------------------------
  data required time                                        25.15
  data arrival time                                         -2.92
  ------------------------------------------------------------------------
  slack (MET)                                               22.23



  Startpoint: transmitter/serial/counter_reg[3] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: transmitter/serial/counter_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  transmitter/serial/counter_reg[3]/CLK (SDFFARX1)
                                                   0.00      0.77 r
  transmitter/serial/counter_reg[3]/Q (SDFFARX1)   0.80      1.56 r
  transmitter/serial/U63/ZN (INVX0)                0.14      1.70 f
  transmitter/serial/U55/ZN (INVX0)                0.16      1.86 r
  transmitter/serial/U56/ZN (INVX0)                0.15      2.01 f
  transmitter/serial/U71/ZN (INVX0)                0.12      2.13 r
  transmitter/serial/U19/Q (AND2X1)                0.23      2.36 r
  transmitter/serial/U20/ZN (INVX0)                0.11      2.47 f
  transmitter/serial/U37/QN (NAND4X0)              0.14      2.61 r
  transmitter/serial/U23/QN (OAI21X1)              0.32      2.93 f
  transmitter/serial/counter_reg[1]/D (SDFFARX1)   0.00      2.93 f
  data arrival time                                          2.93

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  transmitter/serial/counter_reg[1]/CLK (SDFFARX1)
                                                   0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -2.93
  ------------------------------------------------------------------------
  slack (MET)                                               22.23



  Startpoint: transmitter/serial/counter_reg[0] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: transmitter/serial/counter_reg[3] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  transmitter/serial/counter_reg[0]/CLK (SDFFARX1)
                                                   0.00      0.77 r
  transmitter/serial/counter_reg[0]/Q (SDFFARX1)   0.85      1.62 f
  transmitter/serial/U58/ZN (INVX0)                0.13      1.75 r
  transmitter/serial/U67/ZN (INVX0)                0.16      1.91 f
  transmitter/serial/U22/Q (AND4X1)                0.29      2.20 f
  transmitter/serial/U29/ZN (INVX0)                0.11      2.31 r
  transmitter/serial/U78/QN (OAI22X1)              0.41      2.71 f
  transmitter/serial/counter_reg[3]/D (SDFFARX1)   0.00      2.71 f
  data arrival time                                          2.71

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.76     25.76
  clock reconvergence pessimism                    0.01     25.77
  transmitter/serial/counter_reg[3]/CLK (SDFFARX1)
                                                   0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -2.71
  ------------------------------------------------------------------------
  slack (MET)                                               22.45



  Startpoint: receiver/ds/bit_count_reg[0] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/datout_reg[0] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[0]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[0]/Q (SDFFARX1)        0.85      1.62 f
  receiver/ds/U76/ZN (INVX0)                       0.13      1.75 r
  receiver/ds/U67/Q (AND4X1)                       0.42      2.17 r
  receiver/ds/U53/QN (OAI22X1)                     0.42      2.59 f
  receiver/ds/datout_reg[0]/D (SDFFARX1)           0.00      2.59 f
  data arrival time                                          2.59

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/datout_reg[0]/CLK (SDFFARX1)         0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.51     25.16
  data required time                                        25.16
  ------------------------------------------------------------------------
  data required time                                        25.16
  data arrival time                                         -2.59
  ------------------------------------------------------------------------
  slack (MET)                                               22.57



  Startpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: receiver/ds/bit_count_reg[1] (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00      0.77 r
  receiver/ds/bit_count_reg[1]/Q (SDFFARX1)        0.82      1.59 r
  receiver/ds/U88/ZN (INVX0)                       0.13      1.72 f
  receiver/ds/U90/ZN (INVX0)                       0.15      1.87 r
  receiver/ds/U118/Q (OA21X1)                      0.35      2.22 r
  receiver/ds/U72/ZN (INVX0)                       0.13      2.35 f
  receiver/ds/U74/ZN (INVX0)                       0.09      2.45 r
  receiver/ds/U122/QN (NOR2X0)                     0.12      2.56 f
  receiver/ds/bit_count_reg[1]/D (SDFFARX1)        0.00      2.56 f
  data arrival time                                          2.56

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  receiver/ds/bit_count_reg[1]/CLK (SDFFARX1)      0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.52     25.15
  data required time                                        25.15
  ------------------------------------------------------------------------
  data required time                                        25.15
  data arrival time                                         -2.56
  ------------------------------------------------------------------------
  slack (MET)                                               22.58



  Startpoint: receiver/ds/datout_reg[9] (rising edge-triggered flip-flop clocked by fun_sclk)
  Endpoint: transmitter/serial/data_out_reg (rising edge-triggered flip-flop clocked by fun_sclk)
  Mode: default
  Corner: default
  Scenario: default
  Path Group: fun_sclk
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock fun_sclk (rise edge)                       0.00      0.00
  clock network delay (propagated)                 0.77      0.77

  receiver/ds/datout_reg[9]/CLK (SDFFARX1)         0.00      0.77 r
  receiver/ds/datout_reg[9]/Q (SDFFARX1)           0.86      1.63 f
  transmitter/serial/data_out_reg/SI (SDFFARX1)    0.00      1.63 f
  data arrival time                                          1.63

  clock fun_sclk (rise edge)                      25.00     25.00
  clock network delay (propagated)                 0.75     25.75
  clock reconvergence pessimism                    0.01     25.77
  transmitter/serial/data_out_reg/CLK (SDFFARX1)   0.00     25.77 r
  clock uncertainty                               -0.10     25.67
  library setup time                              -0.55     25.11
  data required time                                        25.11
  ------------------------------------------------------------------------
  data required time                                        25.11
  data arrival time                                         -1.63
  ------------------------------------------------------------------------
  slack (MET)                                               23.48


1
icc2_shell> save_block
Information: Saving block 'SerDes.dlib:SerDes_cts.design'
1
icc2_shell> start_gui
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
1
icc2_shell> save_block
Information: Saving block 'SerDes.dlib:SerDes_cts.design'
1
icc2_shell> exit
Maximum memory usage for this session: 689.57 MB
CPU usage for this session:     51 seconds (  0.01 hours)
Elapsed time for this session:    180 seconds (  0.05 hours)
Thank you for using IC Compiler II.

