#@ # 
#@ # Running icc2_shell Version O-2018.06-SP1 for linux64 -- Jul 17, 2018
#@ # Date:   Tue Aug 26 08:22:49 2025
#@ # Run by: ICer@IC_EDA
#@ 

sh rm /home/ICer/SerDes/pnr/setup/script/SerDes.dlib/SerDes_pp/design.ndm.lock
set design SerDes
set design_lib_path /home/ICer/SerDes/pnr/setup/script
open_block $design_lib_path/${design}.dlib:${design}_pp.design
copy_block -from_block ${design}.dlib:${design}_pp.design -to_block ${design}_pl
current_block ${design}_pl.design
read_def ../../../dft/output/${design}.def
check_design -checks pre_placement_stage
suppress_message -force CMD-013
suppress_message -force CMD-013; report_design_mismatch -check_design >> /home/ICer/SerDes/pnr/placement/script/check_design2025Aug26082252.log
suppress_message -force CMD-013; check_scan_chain >> /home/ICer/SerDes/pnr/placement/script/check_design2025Aug26082252.log
suppress_message -force CMD-013; check_mv_design >> /home/ICer/SerDes/pnr/placement/script/check_design2025Aug26082252.log
suppress_message -force CMD-013; check_rp_constraints >> /home/ICer/SerDes/pnr/placement/script/check_design2025Aug26082252.log
suppress_message -force CMD-013; check_timing >> /home/ICer/SerDes/pnr/placement/script/check_design2025Aug26082252.log
suppress_message -force CMD-013; check_hier_design -stage pre_placement >> /home/ICer/SerDes/pnr/placement/script/check_design2025Aug26082252.log
unsuppress_message CMD-013
set_app_option  -name place.coarse.congestion_driven_max_util -value 0.7
set_app_options -name opt.common.user_instance_name_prefix -value "PLACE_"
set_app_options -name opt.common.max_fanout   -value 20
set_app_options -name opt.tie_cell.max_fanout -value 20
get_lib_cell */NA*
get_lib_cell */IN*
add_spare_cells -cell_name SpareCell  -lib_cell "*/NAND2X2 */INVX1"  -num_instances 5
spread_spare_cells -cells [get_cells Spare*] -random_distribution
place_eco_cells -cells [get_cells Spare*] -legalize_only
set spare_cells [get_cells Spare*]
connect_pg_net -all_blocks -automatic
set_attribute [get_lib_cells saed90nm_max/TIEH] dont_use false
set_attribute [get_lib_cells saed90nm_max/TIEH] dont_touch false
set_lib_cell_purpose -include all {saed90nm_max/TIEH}
set_attribute [get_lib_cells saed90nm_max/TIEL] dont_use false
set_attribute [get_lib_cells saed90nm_max/TIEL] dont_touch false
set_lib_cell_purpose -include all {saed90nm_max/TIEL}
add_tie_cells -objects $spare_cells   -tie_low_lib_cells  saed90nm_max/TIEL   -tie_high_lib_cells saed90nm_max/TIEH       -legalize
set_dont_touch $spare_cells
set_fixed_objects $spare_cells
connect_pg_net -net "VDD" [get_pins -hierarchical "*/VDD*"]
connect_pg_net -net "VSS" [get_pins -hierarchical "*/VSS"]
connect_pg_net -all_blocks -automatic
check_pg_drc > ../report/before_placement_drc_spare.rpt
create_placement  -effort high    -timing_driven -buffering_aware_timing_driven   -congestion -congestion_effort  medium   -incremental
legalize_placement -incremental
check_pg_drc  > ../report/drc_legalized.rpt
connect_pg_net -net "VDD" [get_pins -hierarchical "*/VDD*"]
connect_pg_net -net "VSS" [get_pins -hierarchical "*/VSS"]
check_pg_drc > ../report/After_placement_drc.rpt
check_legality -verbose  > ../report/legality.rpt
check_routability   > ../report/routeability.rpt
report_utilization > ../report/utilization.rpt
check_pg_drc  > ../report/drc_final.rpt
report_design > ../report/design.rpt
report_cell   > ../report/cells.rpt
report_timing > ../report/timing.rpt
write_def ../output/${design}.def
write_verilog -include {all} ../output/${design}.v
save_block ;
start_gui
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
win_set_filter -visible -class cell -filter {hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-77}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region pin_blockage block_shielding topology_node topology_edge core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {cell_array hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-77}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region pin_blockage topology_node topology_edge edit_group shape via placement_blockage }
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
win_set_filter -visible -class routing_blockage -layer {25}
win_set_filter -visible -class shape -filter {} -layer {25}
win_set_filter -visible -class via -filter {} -layer {25}
win_set_filter -visible -class terminal -filter {}  -layer {25}
win_set_filter -class routing_blockage -layer {25}
win_set_filter -class shape -filter {} -layer {25}
win_set_filter -class via -filter {} -layer {25}
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
win_set_filter -visible -class routing_blockage -layer {4 25 28}
win_set_filter -visible -class shape -filter {} -layer {4 25 28}
win_set_filter -visible -class via -filter {} -layer {4 25 28}
win_set_filter -visible -class terminal -filter {}  -layer {4 25 28}
win_set_filter -class routing_blockage -layer {4 25 28}
win_set_filter -class shape -filter {} -layer {4 25 28}
win_set_filter -class via -filter {} -layer {4 25 28}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {119.590 123.860}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {119.605 123.685}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {119.605 123.685}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {111.615 122.250}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {106.700 122.045}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {105.320 122.200}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {105.960 123.810}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {108.800 123.480}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {108.750 121.020}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {108.750 121.020}
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
win_set_filter -visible -class routing_blockage -layer {25 28}
win_set_filter -visible -class shape -filter {} -layer {25 28}
win_set_filter -visible -class via -filter {} -layer {25 28}
win_set_filter -visible -class terminal -filter {}  -layer {25 28}
win_set_filter -class routing_blockage -layer {25 28}
win_set_filter -class shape -filter {} -layer {25 28}
win_set_filter -class via -filter {} -layer {25 28}
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
win_set_filter -visible -class routing_blockage -layer {}
win_set_filter -visible -class shape -filter {} -layer {}
win_set_filter -visible -class via -filter {} -layer {}
win_set_filter -visible -class terminal -filter {}  -layer {}
win_set_filter -class routing_blockage -layer {}
win_set_filter -class shape -filter {} -layer {}
win_set_filter -class via -filter {} -layer {}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {203.980 113.445}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {197.020 113.445}
check_pg_drc
check_pg_connectivity
exit
