
icc2_shell> sh rm /home/ICer/SerDes/pnr/setup/script/SerDes.dlib/SerDes_pp/design.ndm.lock
Error: rm: cannot remove '/home/ICer/SerDes/pnr/setup/script/SerDes.dlib/SerDes_pp/design.ndm.lock': No such file or directory
        Use error_info for more info. (CMD-013)
icc2_shell> set design SerDes
SerDes
icc2_shell> 
icc2_shell> set design_lib_path /home/ICer/SerDes/pnr/setup/script
/home/ICer/SerDes/pnr/setup/script
icc2_shell> open_block $design_lib_path/${design}.dlib:${design}_pp.design
Information: User units loaded from library 'saed90nm_max' (LNK-040)
Opening block 'SerDes.dlib:SerDes_pp.design' in edit mode
Information: loading PG routing via master rules, patterns, strategies and strategy via rules.
{SerDes.dlib:SerDes_pp.design}
icc2_shell> copy_block -from_block ${design}.dlib:${design}_pp.design -to_block ${design}_pl
{SerDes.dlib:SerDes_pl.design}
icc2_shell> current_block ${design}_pl.design
{SerDes.dlib:SerDes_pl.design}
icc2_shell> 
icc2_shell> 
icc2_shell> 
icc2_shell> 
icc2_shell> read_def ../../../dft/output/${design}.def
Using libraries: SerDes.dlib saed90nm_max
Warning: In library SerDes.dlib, no block views exist for block system. (LNK-064)
Visiting block SerDes.dlib:SerDes_pl.design
Design 'system' was successfully linked.
Information: Loading DEF file '/home/ICer/SerDes/dft/output/SerDes.def' (FILE-007)
Information: Reading 'VERSION' statement. (DEFR-016)
Warning: Ignoring unsupported 'NAMESCASESENSITIVE' statement. (DEFR-015)
Information: Reading 'DIVIDERCHAR' statement. (DEFR-016)
Information: Reading 'BUSBITCHARS' statement. (DEFR-016)
Information: Reading 'DESIGN' statement. (DEFR-016)
Information: Reading 'SCANCHAINS' section. (DEFR-016)
--------------------------------
Number of Ignored DEF Constructs
--------------------------------
NAMESCASESENSITIVE             : 1
---------------------------------------
Number of Processed/Read DEF Constructs
---------------------------------------
VERSION                        : 1/1
DIVIDERCHAR                    : 1/1
BUSBITCHARS                    : 1/1
DESIGN                         : 1/1
SCANCHAINS                     : 5/5
1
icc2_shell> check_design -checks pre_placement_stage
****************************************
 Report : check_design 
 Options: { pre_placement_stage }
 Design : system
 Version: O-2018.06-SP1
 Date   : Tue Aug 26 08:22:52 2025
****************************************

Running mega-check 'pre_placement_stage': 
    Running atomic-check 'design_mismatch'
    Running atomic-check 'scan_chain'
    Running atomic-check 'mv_design'
    Running atomic-check 'rp_constraints'
    Running atomic-check 'timing'
    Running atomic-check 'hier_pre_placement'

  *** EMS Message summary ***
  ----------------------------------------------------------------------------------------------------
  Rule         Type   Count      Message
  ----------------------------------------------------------------------------------------------------
  TCK-001      Warn   194        The reported endpoint '%endpoint' is unconstrained. Reason: '%re...
  TCK-012      Warn   7          The input port '%port' has no clock_relative delay specified. Mo...
  ----------------------------------------------------------------------------------------------------
  Total 201 EMS messages : 0 errors, 201 warnings, 0 info.
  ----------------------------------------------------------------------------------------------------

  *** Non-EMS message summary ***
  ----------------------------------------------------------------------------------------------------
  Rule         Type   Count      Message
  ----------------------------------------------------------------------------------------------------
  NDMUI-173           1          There are no relative placement groups in the design.
  PVT-032             1          Corner %s: no PVT mismatches.
  ----------------------------------------------------------------------------------------------------
  Total 2 non-EMS messages : 0 errors, 0 warnings, 2 info.
  ----------------------------------------------------------------------------------------------------

Information: EMS database is saved to file 'check_design.ems'.
Information: Non-EMS messages are saved into file 'check_design2025Aug26082252.log'.
1
icc2_shell> 
icc2_shell> set_app_option  -name place.coarse.congestion_driven_max_util -value 0.7
place.coarse.congestion_driven_max_util 0.7
icc2_shell> set_app_options -name opt.common.user_instance_name_prefix -value "PLACE_"
opt.common.user_instance_name_prefix PLACE_
icc2_shell> set_app_options -name opt.common.max_fanout   -value 20
opt.common.max_fanout 20
icc2_shell> set_app_options -name opt.tie_cell.max_fanout -value 20
opt.tie_cell.max_fanout 20
icc2_shell> 
icc2_shell> get_lib_cell */NA*
{saed90nm_max/NAND2X0 saed90nm_max/NAND2X1 saed90nm_max/NAND2X2 saed90nm_max/NAND2X4 saed90nm_max/NAND3X0 saed90nm_max/NAND3X1 saed90nm_max/NAND3X2 saed90nm_max/NAND3X4 saed90nm_max/NAND4X0 saed90nm_max/NAND4X1}
icc2_shell> get_lib_cell */IN*
{saed90nm_max/INVX0 saed90nm_max/INVX1 saed90nm_max/INVX16 saed90nm_max/INVX2 saed90nm_max/INVX32 saed90nm_max/INVX4 saed90nm_max/INVX8}
icc2_shell> 
icc2_shell> 
icc2_shell> add_spare_cells -cell_name SpareCell  -lib_cell "*/NAND2X2 */INVX1"  -num_instances 5
The total needed area to add new spare cells is 78.3360.
****************************************
Report : ECO add_spare_cells Summary
Design : SerDes_pl
Version: O-2018.06-SP1
Date   : Tue Aug 26 08:22:52 2025
****************************************
Total 10 spare cells are added.

Library Cell saed90nm_max/NAND2X2:
    Add    5 cells in the voltage Area DEFAULT_VA

Library Cell saed90nm_max/INVX1:
    Add    5 cells in the voltage Area DEFAULT_VA
1
icc2_shell> 
icc2_shell> spread_spare_cells -cells [get_cells Spare*] -random_distribution
The spare cells are spread successfully.
1
icc2_shell> place_eco_cells -cells [get_cells Spare*] -legalize_only


********  Legalize ECO Cells  ********

nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Begin building search trees for block SerDes.dlib:SerDes_pl.design
Done building search trees for block SerDes.dlib:SerDes_pl.design (time 0s)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 56 total shapes.
Layer M2: cached 0 shapes out of 0 total shapes.
Cached 728 vias out of 2693 total vias.

Legalizing Top Level Design system ... 
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
       25344         1467        Yes DEFAULT_VA

Warning: max_legality_failures=5000 ignored.
        To use it, set limit_legality_checks to true.
Warning: max_legality_check_range=500 ignored.
        To use it, set limit_legality_checks to true.
Warning: standard cell transmitter/enc/enc_inst_5b/U6 is fixed but not placed on rows. All advanced rules will be ignored for this cell.
Warning: standard cell receiver/dec/dec_4b_3b/U27 is fixed but not placed on rows. All advanced rules will be ignored for this cell.
Warning: standard cell receiver/dec/dec_6b_5b/U66 is fixed but not placed on rows. All advanced rules will be ignored for this cell.
Warning: standard cell receiver/dec/dec_6b_5b/U69 is fixed but not placed on rows. All advanced rules will be ignored for this cell.
Warning: standard cell transmitter/serial/U19 is fixed but not placed on rows. All advanced rules will be ignored for this cell.
Warning: standard cell transmitter/enc/enc_inst_3b/U63 is fixed but not placed on rows. All advanced rules will be ignored for this cell.
Warning: standard cell transmitter/enc/enc_inst_3b/U65 is fixed but not placed on rows. All advanced rules will be ignored for this cell.
Warning: standard cell transmitter/enc/enc_inst_3b/U67 is fixed but not placed on rows. All advanced rules will be ignored for this cell.
Warning: standard cell transmitter/enc/enc_inst_3b/U69 is fixed but not placed on rows. All advanced rules will be ignored for this cell.
Warning: standard cell transmitter/enc/enc_inst_5b/U5 is fixed but not placed on rows. All advanced rules will be ignored for this cell.
...
Warning: 1457 standard cells were fixed but not placed on rows. All advanced rules will be ignored for those cells.
Starting legalizer.
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (0 sec)
Legalization complete (0 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                   1467
number of references:                39
number of site rows:                 55
number of locations attempted:      141
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

number of cells aggregated:          10 (85 total sites)
avg row height over cells:        2.880 um
rms cell displacement:            0.798 um ( 0.28 row height)
rms weighted cell displacement:   0.798 um ( 0.28 row height)
max cell displacement:            1.131 um ( 0.39 row height)
avg cell displacement:            0.711 um ( 0.25 row height)
avg weighted cell displacement:   0.711 um ( 0.25 row height)
number of cells moved:               10
number of large displacements:        0
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: SpareCell_4 (NAND2X2)
  Input location: (170.263,137.711)
  Legal location: (170.2,138.84)
  Displacement:   1.131 um ( 0.39 row height)
Cell: SpareCell_0 (NAND2X2)
  Input location: (84.0135,73.6552)
  Legal location: (84.12,72.6)
  Displacement:   1.061 um ( 0.37 row height)
Cell: SpareCell_2 (NAND2X2)
  Input location: (26.2853,148.535)
  Legal location: (26.2,147.48)
  Displacement:   1.058 um ( 0.37 row height)
Cell: SpareCell_3 (NAND2X2)
  Input location: (111.922,158.034)
  Legal location: (111.96,159)
  Displacement:   0.967 um ( 0.34 row height)
Cell: SpareCell_0_4 (INVX1)
  Input location: (141.366,143.798)
  Legal location: (141.4,144.6)
  Displacement:   0.803 um ( 0.28 row height)
Cell: SpareCell_0_1 (INVX1)
  Input location: (171.329,51.8896)
  Legal location: (171.48,52.44)
  Displacement:   0.571 um ( 0.20 row height)
Cell: SpareCell_0_0 (INVX1)
  Input location: (16.2472,80.8212)
  Legal location: (16.28,81.24)
  Displacement:   0.420 um ( 0.15 row height)
Cell: SpareCell_0_2 (INVX1)
  Input location: (86.8489,98.2631)
  Legal location: (87,98.52)
  Displacement:   0.298 um ( 0.10 row height)
Cell: SpareCell_0_3 (INVX1)
  Input location: (143.005,155.844)
  Legal location: (143,156.12)
  Displacement:   0.276 um ( 0.10 row height)
Cell: SpareCell_1 (NAND2X2)
  Input location: (129.692,43.6909)
  Legal location: (129.56,43.8)
  Displacement:   0.171 um ( 0.06 row height)

****************************************
Report : ECO Legalize Displacement
Design : SerDes_pl
Version: O-2018.06-SP1
Date   : Tue Aug 26 08:22:52 2025
****************************************

avg cell displacement:    0.675 um ( 0.23 row height)
max cell displacement:    1.131 um ( 0.39 row height)
std deviation:            0.351 um ( 0.12 row height)
number of cell moved:        10 cells (out of 10 cells)

10
icc2_shell> 
icc2_shell> set spare_cells [get_cells Spare*]
{SpareCell_0 SpareCell_0_0 SpareCell_0_1 SpareCell_0_2 SpareCell_0_3 SpareCell_0_4 SpareCell_1 SpareCell_2 SpareCell_3 SpareCell_4}
icc2_shell> connect_pg_net -all_blocks -automatic
icc2_shell> 
icc2_shell> set_attribute [get_lib_cells saed90nm_max/TIEH] dont_use false
Information: The design specific attribute override for lib_cell 'saed90nm_max:TIEH.timing' is set in the current block 'SerDes_pl', because the actual library setting may not be overwritten. (ATTR-12)
{saed90nm_max/TIEH}
icc2_shell> set_attribute [get_lib_cells saed90nm_max/TIEH] dont_touch false
Information: The design specific attribute override for lib_cell 'saed90nm_max:TIEH.timing' is set in the current block 'SerDes_pl', because the actual library setting may not be overwritten. (ATTR-12)
{saed90nm_max/TIEH}
icc2_shell> set_lib_cell_purpose -include all {saed90nm_max/TIEH}
Information: The design specific attribute override for lib_cell 'saed90nm_max:TIEH.timing' is set in the current block 'SerDes_pl', because the actual library setting may not be overwritten. (ATTR-12)
1
icc2_shell> 
icc2_shell> set_attribute [get_lib_cells saed90nm_max/TIEL] dont_use false
Information: The design specific attribute override for lib_cell 'saed90nm_max:TIEL.timing' is set in the current block 'SerDes_pl', because the actual library setting may not be overwritten. (ATTR-12)
{saed90nm_max/TIEL}
icc2_shell> set_attribute [get_lib_cells saed90nm_max/TIEL] dont_touch false
Information: The design specific attribute override for lib_cell 'saed90nm_max:TIEL.timing' is set in the current block 'SerDes_pl', because the actual library setting may not be overwritten. (ATTR-12)
{saed90nm_max/TIEL}
icc2_shell> set_lib_cell_purpose -include all {saed90nm_max/TIEL}
Information: The design specific attribute override for lib_cell 'saed90nm_max:TIEL.timing' is set in the current block 'SerDes_pl', because the actual library setting may not be overwritten. (ATTR-12)
1
icc2_shell> 
icc2_shell> 
? ? ? 
icc2_shell> add_tie_cells -objects $spare_cells   -tie_low_lib_cells  saed90nm_max/TIEL   -tie_high_lib_cells saed90nm_max/TIEH       -legalize
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_pl.design'. (TIM-125)
Information: Design Average RC for design SerDes_pl  (NEX-011)
Information: r = 0.525077 ohm/um, via_r = 0.867127 ohm/cut, c = 0.071124 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.875991 ohm/cut, c = 0.079239 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (150000 150000) (1750000 1734000)
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 2
Information: The RC mode used is VR for design 'system'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1497, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 0, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
WARNING: The "-legalize" option is being deprecated. Please stop using this option.
Use advanced legalizer engine : 0
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 56 total shapes.
Layer M2: cached 0 shapes out of 0 total shapes.
Cached 728 vias out of 2693 total vias.
------------------------
Begin tie-cell insertion
INFO: debug level = 0
INFO: max fanout = 20
INFO: max diameter (in user unit) = 57.60
INFO: Available logic one lib cells: TIEH 
INFO: Available logic zero lib cells: TIEL 
INFO: Tie cell support for abstract block enabled
INFO: Detached 15 constant pins off ground net VSS
INFO: Found 15 large capacitance pins each requiring one tie-cell.
INFO: Added 15 tie-low cells
1
icc2_shell> set_dont_touch $spare_cells
1
icc2_shell> set_fixed_objects $spare_cells
1
icc2_shell> 
icc2_shell> connect_pg_net -net "VDD" [get_pins -hierarchical "*/VDD*"]
icc2_shell> connect_pg_net -net "VSS" [get_pins -hierarchical "*/VSS"]
icc2_shell> connect_pg_net -all_blocks -automatic
icc2_shell> 
icc2_shell> check_pg_drc > ../report/before_placement_drc_spare.rpt
icc2_shell> 
icc2_shell> 
? ? 
icc2_shell> create_placement  -effort high    -timing_driven -buffering_aware_timing_driven   -congestion -congestion_effort  medium   -incremental
--------------
running create_placement

Create Placement Options:
Effort:                        high_effort         
Timing Driven:                 true                
Buffering Aware Timing Driven: true                
Seed locs:                     true                
Incremental:                   true                
Congestion:                    true                
Congestion Effort:             medium              

Printing options for 'place.coarse.*' (non-default only)
place.coarse.congestion_driven_max_util                 :        0.7                 

Start transferring placement data.
Completed transferring placement data.
Use advanced legalizer engine : 0
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used    5  Alloctr    5  Proc 1274 
Printing options for 'route.common.*'

Printing options for 'route.global.*'
global.deterministic                                    :        on                  
global.placement_timing_driven_mode                     :        false               
global.timing_driven                                    :        false               

Begin global routing.
Warning: Ignore contact DIFFCON. (ZRT-015)
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M9
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Error: Cell sclk_mux/U1 is not placed. (ZRT-064)
Warning: Ignore net fun_sclk's connection to port IN1 (cell sclk_mux/U1). (ZRT-065)
Warning: Ignore net n14's connection to port IN2 (cell sclk_mux/U1). (ZRT-065)
Warning: Ignore net n19's connection to port S (cell sclk_mux/U1). (ZRT-065)
Warning: Ignore net sclk's connection to port Q (cell sclk_mux/U1). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell sclk_mux/U1). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell sclk_mux/U1). (ZRT-065)
Error: Cell pclk_mux/U1 is not placed. (ZRT-064)
Warning: Ignore net fun_pclk's connection to port IN1 (cell pclk_mux/U1). (ZRT-065)
Warning: Ignore net n13's connection to port IN2 (cell pclk_mux/U1). (ZRT-065)
Warning: Ignore net n18's connection to port S (cell pclk_mux/U1). (ZRT-065)
Warning: Ignore net pclk's connection to port Q (cell pclk_mux/U1). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell pclk_mux/U1). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell pclk_mux/U1). (ZRT-065)
Error: Cell rst_mux/U3 is not placed. (ZRT-064)
Warning: Ignore net fun_rst_n's connection to port IN1 (cell rst_mux/U3). (ZRT-065)
Warning: Ignore net scan_rst's connection to port IN2 (cell rst_mux/U3). (ZRT-065)
Warning: Ignore net n17's connection to port S (cell rst_mux/U3). (ZRT-065)
Warning: Ignore net reset_n's connection to port Q (cell rst_mux/U3). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell rst_mux/U3). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell rst_mux/U3). (ZRT-065)
Error: Cell transmitter/serial/U26 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n13's connection to port IN1 (cell transmitter/serial/U26). (ZRT-065)
Warning: Ignore net transmitter/serial/n35's connection to port IN2 (cell transmitter/serial/U26). (ZRT-065)
Warning: Ignore net transmitter/serial/n14's connection to port IN3 (cell transmitter/serial/U26). (ZRT-065)
Warning: Ignore net transmitter/serial/n243's connection to port IN4 (cell transmitter/serial/U26). (ZRT-065)
Warning: Ignore net transmitter/serial/n11's connection to port Q (cell transmitter/serial/U26). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U26). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U26). (ZRT-065)
Error: Cell transmitter/serial/U27 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n15's connection to port IN1 (cell transmitter/serial/U27). (ZRT-065)
Warning: Ignore net transmitter/serial/n16's connection to port IN2 (cell transmitter/serial/U27). (ZRT-065)
Warning: Ignore net transmitter/serial/n17's connection to port IN3 (cell transmitter/serial/U27). (ZRT-065)
Warning: Ignore net transmitter/serial/n18's connection to port IN4 (cell transmitter/serial/U27). (ZRT-065)
Warning: Ignore net transmitter/serial/n14's connection to port Q (cell transmitter/serial/U27). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U27). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U27). (ZRT-065)
Error: Cell transmitter/serial/U30 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n23's connection to port IN1 (cell transmitter/serial/U30). (ZRT-065)
Warning: Ignore net transmitter/serial/n24's connection to port IN2 (cell transmitter/serial/U30). (ZRT-065)
Warning: Ignore net transmitter/serial/n25's connection to port IN3 (cell transmitter/serial/U30). (ZRT-065)
Warning: Ignore net transmitter/serial/n26's connection to port IN4 (cell transmitter/serial/U30). (ZRT-065)
Warning: Ignore net transmitter/serial/n13's connection to port Q (cell transmitter/serial/U30). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U30). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U30). (ZRT-065)
Error: Cell transmitter/serial/U37 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n190's connection to port IN1 (cell transmitter/serial/U37). (ZRT-065)
Warning: Ignore net transmitter/serial/n215's connection to port IN2 (cell transmitter/serial/U37). (ZRT-065)
Warning: Ignore net transmitter/serial/n244's connection to port IN3 (cell transmitter/serial/U37). (ZRT-065)
Warning: Ignore net transmitter/serial/n217's connection to port IN4 (cell transmitter/serial/U37). (ZRT-065)
Warning: Ignore net transmitter/serial/n41's connection to port QN (cell transmitter/serial/U37). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U37). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U37). (ZRT-065)
Error: Cell transmitter/serial/data_out_reg is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n37's connection to port D (cell transmitter/serial/data_out_reg). (ZRT-065)
Warning: Ignore net transmitter/serial/n9's connection to port SI (cell transmitter/serial/data_out_reg). (ZRT-065)
Warning: Ignore net scan_en's connection to port SE (cell transmitter/serial/data_out_reg). (ZRT-065)
Warning: Ignore net sclk's connection to port CLK (cell transmitter/serial/data_out_reg). (ZRT-065)
Warning: Ignore net transmitter/serial/n202's connection to port RSTB (cell transmitter/serial/data_out_reg). (ZRT-065)
Warning: Ignore net data_out_s's connection to port Q (cell transmitter/serial/data_out_reg). (ZRT-065)
Warning: Ignore net transmitter/serial/n250's connection to port QN (cell transmitter/serial/data_out_reg). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/data_out_reg). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/data_out_reg). (ZRT-065)
Error: Cell transmitter/serial/counter_reg[1] is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n32's connection to port D (cell transmitter/serial/counter_reg[1]). (ZRT-065)
Warning: Ignore net transmitter/serial/n251's connection to port SI (cell transmitter/serial/counter_reg[1]). (ZRT-065)
Warning: Ignore net scan_en's connection to port SE (cell transmitter/serial/counter_reg[1]). (ZRT-065)
Warning: Ignore net sclk's connection to port CLK (cell transmitter/serial/counter_reg[1]). (ZRT-065)
Warning: Ignore net transmitter/serial/n192's connection to port RSTB (cell transmitter/serial/counter_reg[1]). (ZRT-065)
Warning: Ignore net transmitter/serial/n8's connection to port Q (cell transmitter/serial/counter_reg[1]). (ZRT-065)
Warning: Ignore net transmitter/serial/n252's connection to port QN (cell transmitter/serial/counter_reg[1]). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/counter_reg[1]). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/counter_reg[1]). (ZRT-065)
Error: Cell transmitter/serial/counter_reg[0] is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n34's connection to port D (cell transmitter/serial/counter_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/n7's connection to port SI (cell transmitter/serial/counter_reg[0]). (ZRT-065)
Warning: Ignore net scan_en's connection to port SE (cell transmitter/serial/counter_reg[0]). (ZRT-065)
Warning: Ignore net sclk's connection to port CLK (cell transmitter/serial/counter_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/serial/n203's connection to port RSTB (cell transmitter/serial/counter_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/serial/n251's connection to port Q (cell transmitter/serial/counter_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/serial/n35's connection to port QN (cell transmitter/serial/counter_reg[0]). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/counter_reg[0]). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/counter_reg[0]). (ZRT-065)
Error: Cell transmitter/serial/counter_reg[2] is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n31's connection to port D (cell transmitter/serial/counter_reg[2]). (ZRT-065)
Warning: Ignore net transmitter/serial/n8's connection to port SI (cell transmitter/serial/counter_reg[2]). (ZRT-065)
Warning: Ignore net scan_en's connection to port SE (cell transmitter/serial/counter_reg[2]). (ZRT-065)
Warning: Ignore net sclk's connection to port CLK (cell transmitter/serial/counter_reg[2]). (ZRT-065)
Warning: Ignore net transmitter/serial/n204's connection to port RSTB (cell transmitter/serial/counter_reg[2]). (ZRT-065)
Warning: Ignore net transmitter/serial/n5's connection to port Q (cell transmitter/serial/counter_reg[2]). (ZRT-065)
Warning: Ignore net transmitter/serial/n253's connection to port QN (cell transmitter/serial/counter_reg[2]). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/counter_reg[2]). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/counter_reg[2]). (ZRT-065)
Error: Cell transmitter/serial/counter_reg[3] is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n33's connection to port D (cell transmitter/serial/counter_reg[3]). (ZRT-065)
Warning: Ignore net transmitter/serial/n5's connection to port SI (cell transmitter/serial/counter_reg[3]). (ZRT-065)
Warning: Ignore net scan_en's connection to port SE (cell transmitter/serial/counter_reg[3]). (ZRT-065)
Warning: Ignore net sclk's connection to port CLK (cell transmitter/serial/counter_reg[3]). (ZRT-065)
Warning: Ignore net transmitter/serial/n201's connection to port RSTB (cell transmitter/serial/counter_reg[3]). (ZRT-065)
Warning: Ignore net transmitter/serial/n9's connection to port Q (cell transmitter/serial/counter_reg[3]). (ZRT-065)
Warning: Ignore net transmitter/serial/n30's connection to port QN (cell transmitter/serial/counter_reg[3]). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/counter_reg[3]). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/counter_reg[3]). (ZRT-065)
Error: Cell transmitter/serial/U3 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n195's connection to port INP (cell transmitter/serial/U3). (ZRT-065)
Warning: Ignore net transmitter/serial/n189's connection to port ZN (cell transmitter/serial/U3). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U3). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U3). (ZRT-065)
Error: Cell transmitter/serial/U4 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n189's connection to port INP (cell transmitter/serial/U4). (ZRT-065)
Warning: Ignore net transmitter/serial/n190's connection to port ZN (cell transmitter/serial/U4). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U4). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U4). (ZRT-065)
Error: Cell transmitter/serial/U5 is not placed. (ZRT-064)
Warning: Ignore net transmitter/valid's connection to port INP (cell transmitter/serial/U5). (ZRT-065)
Warning: Ignore net transmitter/serial/n191's connection to port ZN (cell transmitter/serial/U5). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U5). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U5). (ZRT-065)
Error: Cell transmitter/serial/U6 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n200's connection to port INP (cell transmitter/serial/U6). (ZRT-065)
Warning: Ignore net transmitter/serial/n192's connection to port ZN (cell transmitter/serial/U6). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U6). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U6). (ZRT-065)
Error: Cell transmitter/serial/U7 is not placed. (ZRT-064)
Warning: Ignore net transmitter/valid's connection to port INP (cell transmitter/serial/U7). (ZRT-065)
Warning: Ignore net transmitter/serial/n193's connection to port ZN (cell transmitter/serial/U7). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U7). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U7). (ZRT-065)
Error: Cell transmitter/serial/U8 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n191's connection to port INP (cell transmitter/serial/U8). (ZRT-065)
Warning: Ignore net transmitter/serial/n194's connection to port ZN (cell transmitter/serial/U8). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U8). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U8). (ZRT-065)
Error: Cell transmitter/serial/U9 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n193's connection to port INP (cell transmitter/serial/U9). (ZRT-065)
Warning: Ignore net transmitter/serial/n195's connection to port ZN (cell transmitter/serial/U9). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U9). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U9). (ZRT-065)
Error: Cell transmitter/serial/U10 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n193's connection to port INP (cell transmitter/serial/U10). (ZRT-065)
Warning: Ignore net transmitter/serial/n196's connection to port ZN (cell transmitter/serial/U10). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U10). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U10). (ZRT-065)
Error: Cell transmitter/serial/U11 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n200's connection to port INP (cell transmitter/serial/U11). (ZRT-065)
Warning: Ignore net transmitter/serial/n197's connection to port ZN (cell transmitter/serial/U11). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U11). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U11). (ZRT-065)
Error: Cell transmitter/serial/U12 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n197's connection to port INP (cell transmitter/serial/U12). (ZRT-065)
Warning: Ignore net transmitter/serial/n198's connection to port ZN (cell transmitter/serial/U12). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U12). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U12). (ZRT-065)
Error: Cell transmitter/serial/U13 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n197's connection to port INP (cell transmitter/serial/U13). (ZRT-065)
Warning: Ignore net transmitter/serial/n199's connection to port ZN (cell transmitter/serial/U13). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U13). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U13). (ZRT-065)
Error: Cell transmitter/serial/U14 is not placed. (ZRT-064)
Warning: Ignore net transmitter/n5's connection to port INP (cell transmitter/serial/U14). (ZRT-065)
Warning: Ignore net transmitter/serial/n200's connection to port ZN (cell transmitter/serial/U14). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U14). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U14). (ZRT-065)
Error: Cell transmitter/serial/U15 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n199's connection to port INP (cell transmitter/serial/U15). (ZRT-065)
Warning: Ignore net transmitter/serial/n201's connection to port ZN (cell transmitter/serial/U15). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U15). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U15). (ZRT-065)
Error: Cell transmitter/serial/U16 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n198's connection to port INP (cell transmitter/serial/U16). (ZRT-065)
Warning: Ignore net transmitter/serial/n202's connection to port ZN (cell transmitter/serial/U16). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U16). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U16). (ZRT-065)
Error: Cell transmitter/serial/U17 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n199's connection to port INP (cell transmitter/serial/U17). (ZRT-065)
Warning: Ignore net transmitter/serial/n203's connection to port ZN (cell transmitter/serial/U17). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U17). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U17). (ZRT-065)
Error: Cell transmitter/serial/U18 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n198's connection to port INP (cell transmitter/serial/U18). (ZRT-065)
Warning: Ignore net transmitter/serial/n204's connection to port ZN (cell transmitter/serial/U18). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U18). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U18). (ZRT-065)
Error: Cell transmitter/serial/U19 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n223's connection to port IN1 (cell transmitter/serial/U19). (ZRT-065)
Warning: Ignore net transmitter/serial/n246's connection to port IN2 (cell transmitter/serial/U19). (ZRT-065)
Warning: Ignore net transmitter/serial/n36's connection to port Q (cell transmitter/serial/U19). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U19). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U19). (ZRT-065)
Error: Cell transmitter/serial/U20 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n36's connection to port INP (cell transmitter/serial/U20). (ZRT-065)
Warning: Ignore net transmitter/serial/n205's connection to port ZN (cell transmitter/serial/U20). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U20). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U20). (ZRT-065)
Error: Cell transmitter/serial/U21 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n205's connection to port IN1 (cell transmitter/serial/U21). (ZRT-065)
Warning: Ignore net transmitter/serial/n29's connection to port IN2 (cell transmitter/serial/U21). (ZRT-065)
Warning: Ignore net transmitter/serial/n195's connection to port IN3 (cell transmitter/serial/U21). (ZRT-065)
Warning: Ignore net transmitter/serial/n210's connection to port Q (cell transmitter/serial/U21). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U21). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U21). (ZRT-065)
Error: Cell transmitter/serial/U22 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n214's connection to port IN1 (cell transmitter/serial/U22). (ZRT-065)
Warning: Ignore net transmitter/serial/n194's connection to port IN2 (cell transmitter/serial/U22). (ZRT-065)
Warning: Ignore net transmitter/serial/n219's connection to port IN3 (cell transmitter/serial/U22). (ZRT-065)
Warning: Ignore net transmitter/serial/n239's connection to port IN4 (cell transmitter/serial/U22). (ZRT-065)
Warning: Ignore net transmitter/serial/n38's connection to port Q (cell transmitter/serial/U22). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U22). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U22). (ZRT-065)
Error: Cell transmitter/serial/U23 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n40's connection to port IN1 (cell transmitter/serial/U23). (ZRT-065)
Warning: Ignore net transmitter/serial/n238's connection to port IN2 (cell transmitter/serial/U23). (ZRT-065)
Warning: Ignore net transmitter/serial/n41's connection to port IN3 (cell transmitter/serial/U23). (ZRT-065)
Warning: Ignore net transmitter/serial/n32's connection to port QN (cell transmitter/serial/U23). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U23). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U23). (ZRT-065)
Error: Cell transmitter/serial/U24 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n205's connection to port INP (cell transmitter/serial/U24). (ZRT-065)
Warning: Ignore net transmitter/serial/n206's connection to port ZN (cell transmitter/serial/U24). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U24). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U24). (ZRT-065)
Error: Cell transmitter/serial/U25 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n219's connection to port INP (cell transmitter/serial/U25). (ZRT-065)
Warning: Ignore net transmitter/serial/n207's connection to port ZN (cell transmitter/serial/U25). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U25). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U25). (ZRT-065)
Error: Cell transmitter/serial/U28 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n239's connection to port INP (cell transmitter/serial/U28). (ZRT-065)
Warning: Ignore net transmitter/serial/n208's connection to port ZN (cell transmitter/serial/U28). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U28). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U28). (ZRT-065)
Error: Cell transmitter/serial/U29 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n38's connection to port INP (cell transmitter/serial/U29). (ZRT-065)
Warning: Ignore net transmitter/serial/n209's connection to port ZN (cell transmitter/serial/U29). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U29). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U29). (ZRT-065)
Error: Cell transmitter/serial/U31 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n30's connection to port IN1 (cell transmitter/serial/U31). (ZRT-065)
Warning: Ignore net transmitter/dataout_10b[0]'s connection to port IN2 (cell transmitter/serial/U31). (ZRT-065)
Warning: Ignore net transmitter/serial/n19's connection to port IN3 (cell transmitter/serial/U31). (ZRT-065)
Warning: Ignore net transmitter/serial/n18's connection to port QN (cell transmitter/serial/U31). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U31). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U31). (ZRT-065)
Error: Cell transmitter/serial/U32 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n250's connection to port IN1 (cell transmitter/serial/U32). (ZRT-065)
Warning: Ignore net transmitter/serial/n210's connection to port IN2 (cell transmitter/serial/U32). (ZRT-065)
Warning: Ignore net transmitter/serial/n11's connection to port IN3 (cell transmitter/serial/U32). (ZRT-065)
Warning: Ignore net transmitter/serial/n228's connection to port IN4 (cell transmitter/serial/U32). (ZRT-065)
Warning: Ignore net transmitter/serial/n37's connection to port QN (cell transmitter/serial/U32). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U32). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U32). (ZRT-065)
Error: Cell transmitter/serial/U33 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n221's connection to port IN1 (cell transmitter/serial/U33). (ZRT-065)
Warning: Ignore net transmitter/serial/n209's connection to port IN2 (cell transmitter/serial/U33). (ZRT-065)
Warning: Ignore net transmitter/serial/n248's connection to port IN3 (cell transmitter/serial/U33). (ZRT-065)
Warning: Ignore net transmitter/serial/n226's connection to port IN4 (cell transmitter/serial/U33). (ZRT-065)
Warning: Ignore net transmitter/serial/n40's connection to port IN5 (cell transmitter/serial/U33). (ZRT-065)
Warning: Ignore net transmitter/serial/n225's connection to port IN6 (cell transmitter/serial/U33). (ZRT-065)
Warning: Ignore net transmitter/serial/n31's connection to port QN (cell transmitter/serial/U33). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U33). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U33). (ZRT-065)
Error: Cell transmitter/serial/U34 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n230's connection to port INP (cell transmitter/serial/U34). (ZRT-065)
Warning: Ignore net transmitter/serial/n211's connection to port ZN (cell transmitter/serial/U34). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U34). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U34). (ZRT-065)
Error: Cell transmitter/serial/U35 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n211's connection to port INP (cell transmitter/serial/U35). (ZRT-065)
Warning: Ignore net transmitter/serial/n212's connection to port ZN (cell transmitter/serial/U35). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U35). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U35). (ZRT-065)
Error: Cell transmitter/serial/U36 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n242's connection to port INP (cell transmitter/serial/U36). (ZRT-065)
Warning: Ignore net transmitter/serial/n213's connection to port ZN (cell transmitter/serial/U36). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U36). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U36). (ZRT-065)
Error: Cell transmitter/serial/U38 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n213's connection to port INP (cell transmitter/serial/U38). (ZRT-065)
Warning: Ignore net transmitter/serial/n214's connection to port ZN (cell transmitter/serial/U38). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U38). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U38). (ZRT-065)
Error: Cell transmitter/serial/U39 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n206's connection to port INP (cell transmitter/serial/U39). (ZRT-065)
Warning: Ignore net transmitter/serial/n215's connection to port ZN (cell transmitter/serial/U39). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U39). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U39). (ZRT-065)
Error: Cell transmitter/serial/U40 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n237's connection to port INP (cell transmitter/serial/U40). (ZRT-065)
Warning: Ignore net transmitter/serial/n216's connection to port ZN (cell transmitter/serial/U40). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U40). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U40). (ZRT-065)
Error: Cell transmitter/serial/U41 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n216's connection to port INP (cell transmitter/serial/U41). (ZRT-065)
Warning: Ignore net transmitter/serial/n217's connection to port ZN (cell transmitter/serial/U41). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U41). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U41). (ZRT-065)
Error: Cell transmitter/serial/U42 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n207's connection to port INP (cell transmitter/serial/U42). (ZRT-065)
Warning: Ignore net transmitter/serial/n218's connection to port ZN (cell transmitter/serial/U42). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U42). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U42). (ZRT-065)
Error: Cell transmitter/serial/U43 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n252's connection to port INP (cell transmitter/serial/U43). (ZRT-065)
Warning: Ignore net transmitter/serial/n219's connection to port ZN (cell transmitter/serial/U43). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U43). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U43). (ZRT-065)
Error: Cell transmitter/serial/U44 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n240's connection to port INP (cell transmitter/serial/U44). (ZRT-065)
Warning: Ignore net transmitter/serial/n220's connection to port ZN (cell transmitter/serial/U44). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U44). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U44). (ZRT-065)
Error: Cell transmitter/serial/U45 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n224's connection to port INP (cell transmitter/serial/U45). (ZRT-065)
Warning: Ignore net transmitter/serial/n221's connection to port ZN (cell transmitter/serial/U45). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U45). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U45). (ZRT-065)
Error: Cell transmitter/serial/U46 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n241's connection to port INP (cell transmitter/serial/U46). (ZRT-065)
Warning: Ignore net transmitter/serial/n222's connection to port ZN (cell transmitter/serial/U46). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U46). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U46). (ZRT-065)
Error: Cell transmitter/serial/U47 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n253's connection to port INP (cell transmitter/serial/U47). (ZRT-065)
Warning: Ignore net transmitter/serial/n223's connection to port ZN (cell transmitter/serial/U47). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U47). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U47). (ZRT-065)
Error: Cell transmitter/serial/U48 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n222's connection to port INP (cell transmitter/serial/U48). (ZRT-065)
Warning: Ignore net transmitter/serial/n224's connection to port ZN (cell transmitter/serial/U48). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U48). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U48). (ZRT-065)
Error: Cell transmitter/serial/U49 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n223's connection to port INP (cell transmitter/serial/U49). (ZRT-065)
Warning: Ignore net transmitter/serial/n225's connection to port ZN (cell transmitter/serial/U49). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U49). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U49). (ZRT-065)
Error: Cell transmitter/serial/U50 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n22's connection to port INP (cell transmitter/serial/U50). (ZRT-065)
Warning: Ignore net transmitter/serial/n226's connection to port ZN (cell transmitter/serial/U50). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U50). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U50). (ZRT-065)
Error: Cell transmitter/serial/U51 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n226's connection to port INP (cell transmitter/serial/U51). (ZRT-065)
Warning: Ignore net transmitter/serial/n227's connection to port ZN (cell transmitter/serial/U51). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U51). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U51). (ZRT-065)
Error: Cell transmitter/serial/U52 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n210's connection to port INP (cell transmitter/serial/U52). (ZRT-065)
Warning: Ignore net transmitter/serial/n228's connection to port ZN (cell transmitter/serial/U52). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U52). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U52). (ZRT-065)
Error: Cell transmitter/serial/U53 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n19's connection to port INP (cell transmitter/serial/U53). (ZRT-065)
Warning: Ignore net transmitter/serial/n229's connection to port ZN (cell transmitter/serial/U53). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U53). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U53). (ZRT-065)
Error: Cell transmitter/serial/U54 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n229's connection to port INP (cell transmitter/serial/U54). (ZRT-065)
Warning: Ignore net transmitter/serial/n230's connection to port ZN (cell transmitter/serial/U54). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U54). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U54). (ZRT-065)
Error: Cell transmitter/serial/U55 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n245's connection to port INP (cell transmitter/serial/U55). (ZRT-065)
Warning: Ignore net transmitter/serial/n231's connection to port ZN (cell transmitter/serial/U55). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U55). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U55). (ZRT-065)
Error: Cell transmitter/serial/U56 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n231's connection to port INP (cell transmitter/serial/U56). (ZRT-065)
Warning: Ignore net transmitter/serial/n232's connection to port ZN (cell transmitter/serial/U56). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U56). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U56). (ZRT-065)
Error: Cell transmitter/serial/U57 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n231's connection to port INP (cell transmitter/serial/U57). (ZRT-065)
Warning: Ignore net transmitter/serial/n233's connection to port ZN (cell transmitter/serial/U57). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U57). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U57). (ZRT-065)
Error: Cell transmitter/serial/U58 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n251's connection to port INP (cell transmitter/serial/U58). (ZRT-065)
Warning: Ignore net transmitter/serial/n234's connection to port ZN (cell transmitter/serial/U58). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U58). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U58). (ZRT-065)
Error: Cell transmitter/serial/U59 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n214's connection to port INP (cell transmitter/serial/U59). (ZRT-065)
Warning: Ignore net transmitter/serial/n235's connection to port ZN (cell transmitter/serial/U59). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U59). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U59). (ZRT-065)
Error: Cell transmitter/serial/U60 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n252's connection to port INP (cell transmitter/serial/U60). (ZRT-065)
Warning: Ignore net transmitter/serial/n236's connection to port ZN (cell transmitter/serial/U60). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U60). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U60). (ZRT-065)
Error: Cell transmitter/serial/U61 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n236's connection to port INP (cell transmitter/serial/U61). (ZRT-065)
Warning: Ignore net transmitter/serial/n237's connection to port ZN (cell transmitter/serial/U61). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U61). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U61). (ZRT-065)
Error: Cell transmitter/serial/U62 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n236's connection to port INP (cell transmitter/serial/U62). (ZRT-065)
Warning: Ignore net transmitter/serial/n238's connection to port ZN (cell transmitter/serial/U62). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U62). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U62). (ZRT-065)
Error: Cell transmitter/serial/U63 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n9's connection to port INP (cell transmitter/serial/U63). (ZRT-065)
Warning: Ignore net transmitter/serial/n239's connection to port ZN (cell transmitter/serial/U63). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U63). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U63). (ZRT-065)
Error: Cell transmitter/serial/U64 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n230's connection to port IN1 (cell transmitter/serial/U64). (ZRT-065)
Warning: Ignore net transmitter/dataout_10b[1]'s connection to port IN2 (cell transmitter/serial/U64). (ZRT-065)
Warning: Ignore net transmitter/serial/n30's connection to port IN3 (cell transmitter/serial/U64). (ZRT-065)
Warning: Ignore net transmitter/serial/n26's connection to port QN (cell transmitter/serial/U64). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U64). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U64). (ZRT-065)
Error: Cell transmitter/serial/U65 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n253's connection to port INP (cell transmitter/serial/U65). (ZRT-065)
Warning: Ignore net transmitter/serial/n240's connection to port ZN (cell transmitter/serial/U65). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U65). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U65). (ZRT-065)
Error: Cell transmitter/serial/U66 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n240's connection to port INP (cell transmitter/serial/U66). (ZRT-065)
Warning: Ignore net transmitter/serial/n241's connection to port ZN (cell transmitter/serial/U66). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U66). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U66). (ZRT-065)
Error: Cell transmitter/serial/U67 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n234's connection to port INP (cell transmitter/serial/U67). (ZRT-065)
Warning: Ignore net transmitter/serial/n242's connection to port ZN (cell transmitter/serial/U67). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U67). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U67). (ZRT-065)
Error: Cell transmitter/serial/U68 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n235's connection to port INP (cell transmitter/serial/U68). (ZRT-065)
Warning: Ignore net transmitter/serial/n243's connection to port ZN (cell transmitter/serial/U68). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U68). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U68). (ZRT-065)
Error: Cell transmitter/serial/U69 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n234's connection to port INP (cell transmitter/serial/U69). (ZRT-065)
Warning: Ignore net transmitter/serial/n244's connection to port ZN (cell transmitter/serial/U69). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U69). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U69). (ZRT-065)
Error: Cell transmitter/serial/U70 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n208's connection to port INP (cell transmitter/serial/U70). (ZRT-065)
Warning: Ignore net transmitter/serial/n245's connection to port ZN (cell transmitter/serial/U70). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U70). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U70). (ZRT-065)
Error: Cell transmitter/serial/U71 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n232's connection to port INP (cell transmitter/serial/U71). (ZRT-065)
Warning: Ignore net transmitter/serial/n246's connection to port ZN (cell transmitter/serial/U71). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U71). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U71). (ZRT-065)
Error: Cell transmitter/serial/U72 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n233's connection to port INP (cell transmitter/serial/U72). (ZRT-065)
Warning: Ignore net transmitter/serial/n247's connection to port ZN (cell transmitter/serial/U72). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U72). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U72). (ZRT-065)
Error: Cell transmitter/serial/U73 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n232's connection to port INP (cell transmitter/serial/U73). (ZRT-065)
Warning: Ignore net transmitter/serial/n248's connection to port ZN (cell transmitter/serial/U73). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U73). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U73). (ZRT-065)
Error: Cell transmitter/serial/U75 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n235's connection to port IN1 (cell transmitter/serial/U75). (ZRT-065)
Warning: Ignore net transmitter/serial/n196's connection to port IN2 (cell transmitter/serial/U75). (ZRT-065)
Warning: Ignore net transmitter/serial/n243's connection to port IN3 (cell transmitter/serial/U75). (ZRT-065)
Warning: Ignore net transmitter/serial/n228's connection to port IN4 (cell transmitter/serial/U75). (ZRT-065)
Warning: Ignore net transmitter/serial/n34's connection to port QN (cell transmitter/serial/U75). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U75). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U75). (ZRT-065)
Error: Cell transmitter/serial/U76 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n27's connection to port IN1 (cell transmitter/serial/U76). (ZRT-065)
Warning: Ignore net transmitter/serial/n28's connection to port IN2 (cell transmitter/serial/U76). (ZRT-065)
Warning: Ignore net transmitter/serial/n237's connection to port IN3 (cell transmitter/serial/U76). (ZRT-065)
Warning: Ignore net transmitter/serial/n25's connection to port Q (cell transmitter/serial/U76). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U76). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U76). (ZRT-065)
Error: Cell transmitter/serial/U77 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n20's connection to port IN1 (cell transmitter/serial/U77). (ZRT-065)
Warning: Ignore net transmitter/serial/n21's connection to port IN2 (cell transmitter/serial/U77). (ZRT-065)
Warning: Ignore net transmitter/serial/n238's connection to port IN3 (cell transmitter/serial/U77). (ZRT-065)
Warning: Ignore net transmitter/serial/n17's connection to port Q (cell transmitter/serial/U77). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U77). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U77). (ZRT-065)
Error: Cell transmitter/serial/U78 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n225's connection to port IN1 (cell transmitter/serial/U78). (ZRT-065)
Warning: Ignore net transmitter/serial/n209's connection to port IN2 (cell transmitter/serial/U78). (ZRT-065)
Warning: Ignore net transmitter/serial/n39's connection to port IN3 (cell transmitter/serial/U78). (ZRT-065)
Warning: Ignore net transmitter/serial/n245's connection to port IN4 (cell transmitter/serial/U78). (ZRT-065)
Warning: Ignore net transmitter/serial/n33's connection to port QN (cell transmitter/serial/U78). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U78). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U78). (ZRT-065)
Error: Cell transmitter/serial/U79 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n220's connection to port IN1 (cell transmitter/serial/U79). (ZRT-065)
Warning: Ignore net transmitter/serial/n218's connection to port IN2 (cell transmitter/serial/U79). (ZRT-065)
Warning: Ignore net transmitter/serial/n22's connection to port QN (cell transmitter/serial/U79). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U79). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U79). (ZRT-065)
Error: Cell transmitter/serial/U80 is not placed. (ZRT-064)
Warning: Ignore net transmitter/dataout_10b[9]'s connection to port IN1 (cell transmitter/serial/U80). (ZRT-065)
Warning: Ignore net transmitter/serial/n248's connection to port IN2 (cell transmitter/serial/U80). (ZRT-065)
Warning: Ignore net transmitter/serial/n23's connection to port QN (cell transmitter/serial/U80). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U80). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U80). (ZRT-065)
Error: Cell transmitter/serial/U81 is not placed. (ZRT-064)
Warning: Ignore net transmitter/dataout_10b[8]'s connection to port IN1 (cell transmitter/serial/U81). (ZRT-065)
Warning: Ignore net transmitter/serial/n246's connection to port IN2 (cell transmitter/serial/U81). (ZRT-065)
Warning: Ignore net transmitter/serial/n15's connection to port QN (cell transmitter/serial/U81). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U81). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U81). (ZRT-065)
Error: Cell transmitter/serial/U82 is not placed. (ZRT-064)
Warning: Ignore net transmitter/dataout_10b[4]'s connection to port IN1 (cell transmitter/serial/U82). (ZRT-065)
Warning: Ignore net transmitter/serial/n227's connection to port IN2 (cell transmitter/serial/U82). (ZRT-065)
Warning: Ignore net transmitter/serial/n16's connection to port QN (cell transmitter/serial/U82). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U82). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U82). (ZRT-065)
Error: Cell transmitter/serial/U83 is not placed. (ZRT-064)
Warning: Ignore net transmitter/dataout_10b[5]'s connection to port IN1 (cell transmitter/serial/U83). (ZRT-065)
Warning: Ignore net transmitter/serial/n227's connection to port IN2 (cell transmitter/serial/U83). (ZRT-065)
Warning: Ignore net transmitter/serial/n24's connection to port QN (cell transmitter/serial/U83). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U83). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U83). (ZRT-065)
Error: Cell transmitter/serial/U84 is not placed. (ZRT-064)
Warning: Ignore net scan_out_4's connection to port IN1 (cell transmitter/serial/U84). (ZRT-065)
Warning: Ignore net transmitter/serial/n224's connection to port IN2 (cell transmitter/serial/U84). (ZRT-065)
Warning: Ignore net transmitter/serial/n21's connection to port QN (cell transmitter/serial/U84). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U84). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U84). (ZRT-065)
Error: Cell transmitter/serial/U85 is not placed. (ZRT-064)
Warning: Ignore net transmitter/dataout_10b[3]'s connection to port IN1 (cell transmitter/serial/U85). (ZRT-065)
Warning: Ignore net transmitter/serial/n241's connection to port IN2 (cell transmitter/serial/U85). (ZRT-065)
Warning: Ignore net transmitter/serial/n28's connection to port QN (cell transmitter/serial/U85). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U85). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U85). (ZRT-065)
Error: Cell transmitter/serial/U86 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n216's connection to port IN1 (cell transmitter/serial/U86). (ZRT-065)
Warning: Ignore net transmitter/serial/n247's connection to port IN2 (cell transmitter/serial/U86). (ZRT-065)
Warning: Ignore net transmitter/serial/n29's connection to port QN (cell transmitter/serial/U86). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U86). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U86). (ZRT-065)
Error: Cell transmitter/serial/U87 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n212's connection to port IN1 (cell transmitter/serial/U87). (ZRT-065)
Warning: Ignore net transmitter/serial/n10's connection to port IN2 (cell transmitter/serial/U87). (ZRT-065)
Warning: Ignore net transmitter/serial/n39's connection to port QN (cell transmitter/serial/U87). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U87). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U87). (ZRT-065)
Error: Cell transmitter/serial/U88 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n194's connection to port INP (cell transmitter/serial/U88). (ZRT-065)
Warning: Ignore net transmitter/serial/n10's connection to port ZN (cell transmitter/serial/U88). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U88). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U88). (ZRT-065)
Error: Cell transmitter/serial/U89 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n5's connection to port IN1 (cell transmitter/serial/U89). (ZRT-065)
Warning: Ignore net transmitter/serial/n8's connection to port IN2 (cell transmitter/serial/U89). (ZRT-065)
Warning: Ignore net transmitter/serial/n19's connection to port QN (cell transmitter/serial/U89). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U89). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U89). (ZRT-065)
Error: Cell transmitter/serial/U90 is not placed. (ZRT-064)
Warning: Ignore net transmitter/serial/n242's connection to port IN1 (cell transmitter/serial/U90). (ZRT-065)
Warning: Ignore net transmitter/serial/n247's connection to port IN2 (cell transmitter/serial/U90). (ZRT-065)
Warning: Ignore net transmitter/serial/n196's connection to port IN3 (cell transmitter/serial/U90). (ZRT-065)
Warning: Ignore net transmitter/serial/n40's connection to port Q (cell transmitter/serial/U90). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U90). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U90). (ZRT-065)
Error: Cell transmitter/serial/U91 is not placed. (ZRT-064)
Warning: Ignore net transmitter/dataout_10b[6]'s connection to port IN1 (cell transmitter/serial/U91). (ZRT-065)
Warning: Ignore net transmitter/serial/n222's connection to port IN2 (cell transmitter/serial/U91). (ZRT-065)
Warning: Ignore net transmitter/serial/n20's connection to port QN (cell transmitter/serial/U91). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U91). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U91). (ZRT-065)
Error: Cell transmitter/serial/U92 is not placed. (ZRT-064)
Warning: Ignore net transmitter/dataout_10b[7]'s connection to port IN1 (cell transmitter/serial/U92). (ZRT-065)
Warning: Ignore net transmitter/serial/n221's connection to port IN2 (cell transmitter/serial/U92). (ZRT-065)
Warning: Ignore net transmitter/serial/n27's connection to port QN (cell transmitter/serial/U92). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/serial/U92). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/serial/U92). (ZRT-065)
Error: Cell transmitter/enc/kin_ff/q_reg[0] is not placed. (ZRT-064)
Warning: Ignore net kin's connection to port D (cell transmitter/enc/kin_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/dataout_10b[9]'s connection to port SI (cell transmitter/enc/kin_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net scan_en's connection to port SE (cell transmitter/enc/kin_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net pclk's connection to port CLK (cell transmitter/enc/kin_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/enc/n83's connection to port RSTB (cell transmitter/enc/kin_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/enc/kin_reg's connection to port Q (cell transmitter/enc/kin_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/enc/kin_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/enc/kin_ff/q_reg[0]). (ZRT-065)
Error: Cell transmitter/enc/k_err_ff/q_reg[0] is not placed. (ZRT-064)
Warning: Ignore net transmitter/enc/k_err_in's connection to port D (cell transmitter/enc/k_err_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net data_out_s's connection to port SI (cell transmitter/enc/k_err_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net scan_en's connection to port SE (cell transmitter/enc/k_err_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net pclk's connection to port CLK (cell transmitter/enc/k_err_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/enc/n93's connection to port RSTB (cell transmitter/enc/k_err_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net k_err's connection to port Q (cell transmitter/enc/k_err_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/enc/k_err_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/enc/k_err_ff/q_reg[0]). (ZRT-065)
Error: Cell transmitter/enc/curr_dis_ff/q_reg[0] is not placed. (ZRT-064)
Warning: Ignore net transmitter/enc/rdispout_in's connection to port D (cell transmitter/enc/curr_dis_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/enc/n43's connection to port SI (cell transmitter/enc/curr_dis_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net scan_en's connection to port SE (cell transmitter/enc/curr_dis_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net pclk's connection to port CLK (cell transmitter/enc/curr_dis_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/enc/n94's connection to port RSTB (cell transmitter/enc/curr_dis_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net transmitter/enc/n105's connection to port Q (cell transmitter/enc/curr_dis_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net VDD's connection to port VDD (cell transmitter/enc/curr_dis_ff/q_reg[0]). (ZRT-065)
Warning: Ignore net VSS's connection to port VSS (cell transmitter/enc/curr_dis_ff/q_reg[0]). (ZRT-065)
Warning: Found 1457 unplaced cells (ZRT-611)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 pitch 0.320 may be too small: wire/via-down 0.315, wire/via-up 0.330. (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 pitch 0.320 may be too small: wire/via-down 0.360, wire/via-up 0.320. (ZRT-026)
Current Stage stats:
[End of Read DB] Elapsed real time: 0:00:00 
[End of Read DB] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Read DB] Stage (MB): Used   66  Alloctr   67  Proc   29 
[End of Read DB] Total (MB): Used   71  Alloctr   72  Proc 1304 
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00,0.00,190.00,188.40)
Number of routing layers = 9
layer M1, dir Hor, min width = 0.14, min space = 0.14 pitch = 0.32
layer M2, dir Ver, min width = 0.16, min space = 0.16 pitch = 0.32
layer M3, dir Hor, min width = 0.16, min space = 0.16 pitch = 0.64
layer M4, dir Ver, min width = 0.16, min space = 0.16 pitch = 0.64
layer M5, dir Hor, min width = 0.16, min space = 0.16 pitch = 1.28
layer M6, dir Ver, min width = 0.16, min space = 0.16 pitch = 1.28
layer M7, dir Hor, min width = 0.16, min space = 0.16 pitch = 2.56
layer M8, dir Ver, min width = 0.16, min space = 0.16 pitch = 3.84
layer M9, dir Hor, min width = 0.45, min space = 0.45 pitch = 5.12
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Tech Data] Total (MB): Used   72  Alloctr   72  Proc 1304 
Net statistics:
Total number of nets     = 56
Number of nets to route  = 15
Number of single or zero port nets = 39
2 nets are fully connected,
 of which 2 are detail routed and 0 are global routed.
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   72  Alloctr   72  Proc 1304 
Average gCell capacity  8.25     on layer (1)    M1
Average gCell capacity  8.38     on layer (2)    M2
Average gCell capacity  4.30     on layer (3)    M3
Average gCell capacity  4.20     on layer (4)    M4
Average gCell capacity  2.16     on layer (5)    M5
Average gCell capacity  2.13     on layer (6)    M6
Average gCell capacity  1.09     on layer (7)    M7
Average gCell capacity  0.56     on layer (8)    M8
Average gCell capacity  0.38     on layer (9)    M9
Average number of tracks per gCell 9.06  on layer (1)    M1
Average number of tracks per gCell 9.00  on layer (2)    M2
Average number of tracks per gCell 4.55  on layer (3)    M3
Average number of tracks per gCell 4.52  on layer (4)    M4
Average number of tracks per gCell 2.29  on layer (5)    M5
Average number of tracks per gCell 2.27  on layer (6)    M6
Average number of tracks per gCell 1.15  on layer (7)    M7
Average number of tracks per gCell 0.77  on layer (8)    M8
Average number of tracks per gCell 0.58  on layer (9)    M9
Number of gCells = 38610
Current Stage stats:
[End of Build Congestion map] Elapsed real time: 0:00:00 
[End of Build Congestion map] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Congestion map] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Congestion map] Total (MB): Used   72  Alloctr   73  Proc 1304 
Total stats:
[End of Build Data] Elapsed real time: 0:00:00 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Data] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Data] Total (MB): Used   72  Alloctr   73  Proc 1304 
Current Stage stats:
[End of Blocked Pin Detection] Elapsed real time: 0:00:00 
[End of Blocked Pin Detection] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Blocked Pin Detection] Stage (MB): Used    0  Alloctr    0  Proc    2 
[End of Blocked Pin Detection] Total (MB): Used   72  Alloctr   73  Proc 1307 
Information: Using 1 threads for routing. (ZRT-444)
placement fast mode ON
multi gcell levels ON

Start GR phase 0
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:00 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Initial Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Initial Routing] Total (MB): Used   72  Alloctr   73  Proc 1307 
Initial. Routing result:
Initial. Both Dirs: Overflow =     0 Max = 0 GRCs =     0 (0.00%)
Initial. H routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. V routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M1         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 48.44
Initial. Layer M1 wire length = 0.00
Initial. Layer M2 wire length = 42.97
Initial. Layer M3 wire length = 5.47
Initial. Layer M4 wire length = 0.00
Initial. Layer M5 wire length = 0.00
Initial. Layer M6 wire length = 0.00
Initial. Layer M7 wire length = 0.00
Initial. Layer M8 wire length = 0.00
Initial. Layer M9 wire length = 0.00
Initial. Total Number of Contacts = 36
Initial. Via VIA12C count = 30
Initial. Via VIA23C count = 6
Initial. Via VIA34C count = 0
Initial. Via VIA45C count = 0
Initial. Via VIA56C count = 0
Initial. Via VIA67C count = 0
Initial. Via VIA78C count = 0
Initial. Via VIA89C count = 0
Initial. completed.

Start GR phase 1
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used   72  Alloctr   73  Proc 1307 
phase1. Routing result:
phase1. Both Dirs: Overflow =     0 Max = 0 GRCs =     0 (0.00%)
phase1. H routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. V routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M1         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 48.44
phase1. Layer M1 wire length = 0.00
phase1. Layer M2 wire length = 42.97
phase1. Layer M3 wire length = 5.47
phase1. Layer M4 wire length = 0.00
phase1. Layer M5 wire length = 0.00
phase1. Layer M6 wire length = 0.00
phase1. Layer M7 wire length = 0.00
phase1. Layer M8 wire length = 0.00
phase1. Layer M9 wire length = 0.00
phase1. Total Number of Contacts = 36
phase1. Via VIA12C count = 30
phase1. Via VIA23C count = 6
phase1. Via VIA34C count = 0
phase1. Via VIA45C count = 0
phase1. Via VIA56C count = 0
phase1. Via VIA67C count = 0
phase1. Via VIA78C count = 0
phase1. Via VIA89C count = 0
phase1. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:00 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Whole Chip Routing] Stage (MB): Used    0  Alloctr    0  Proc    3 
[End of Whole Chip Routing] Total (MB): Used   72  Alloctr   73  Proc 1307 

Information: Global Routing terminated early: true (ZRT-103)

Congestion utilization per direction:
Average vertical track utilization   =  0.08 %
Peak    vertical track utilization   = 42.86 %
Average horizontal track utilization =  0.01 %
Peak    horizontal track utilization = 12.50 %

Current Stage stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used    0  Alloctr    0  Proc    0 
[GR: Done] Total (MB): Used   72  Alloctr   73  Proc 1307 
GR Total stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used   67  Alloctr   67  Proc   32 
[GR: Done] Total (MB): Used   72  Alloctr   73  Proc 1307 
Writing out congestion map...
Updating congestion ...
Updating congestion ...
[DBOUT] Elapsed real time: 0:00:00 
[DBOUT] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DBOUT] Stage (MB): Used  -67  Alloctr  -67  Proc    0 
[DBOUT] Total (MB): Used    4  Alloctr    5  Proc 1307 
Final total stats:
[End of Global Routing] Elapsed real time: 0:00:00 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Global Routing] Stage (MB): Used    0  Alloctr    0  Proc   32 
[End of Global Routing] Total (MB): Used    4  Alloctr    5  Proc 1307 
Information: 0.00% of design has horizontal routing density above target_routing_density of 0.80.
Information: 0.02% of design has vertical routing density above target_routing_density of 0.80.
Running placement using 1 thread(s)
Information: Automatic density control has selected the following settings: max_density 0.60, congestion_driven_max_util 0.70. (PLACE-027)
coarse place 100% done.
Information: Reducing cell density for 0.0% of the movable cells to alleviate congestion. This changes the average cell density in non-congested areas from 0.51 to 0.51. (PLACE-030)
Information: Coarse placer weighted wire length estimate = 7.07298e+07
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_pl.design'. (TIM-125)
Information: Design Average RC for design SerDes_pl  (NEX-011)
Information: r = 0.524979 ohm/um, via_r = 0.867113 ohm/cut, c = 0.074128 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.875991 ohm/cut, c = 0.082018 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (150000 150000) (1750000 1734000)
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 2
Information: The RC mode used is VR for design 'system'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1512, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 1, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
eLpp: using low effort
Warning: turning eLpp off because no active dynamic power scenarios were found
Start transferring placement data.
Information: Automatic timing control is enabled.
DTDP placement: scenario=default
Completed transferring placement data.
Running placement using 1 thread(s)
Information: Automatic density control has selected the following settings: max_density 0.60, congestion_driven_max_util 0.70. (PLACE-027)
coarse place 50% done.
coarse place 60% done.
coarse place 70% done.
coarse place 80% done.
coarse place 90% done.
coarse place 100% done.
Information: Coarse placer weighted wire length estimate = 2.7817e+08
Start DFT optimization
Information: The stitching and editing of coupling caps is turned OFF for design 'SerDes.dlib:SerDes_pl.design'. (TIM-125)
Information: Design Average RC for design SerDes_pl  (NEX-011)
Information: r = 0.523977 ohm/um, via_r = 0.866965 ohm/cut, c = 0.084505 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.875991 ohm/cut, c = 0.096710 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (150000 150000) (1750000 1734000)
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 2
Information: The RC mode used is VR for design 'system'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 1512, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 10, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
START_FUNC: check_dft          CPU:      7 s ( 0.00 hr) ELAPSE:      8 s ( 0.00 hr) MEM-PEAK:   241 Mb Tue Aug 26 08:22:54 2025
DFT: number of valid scan chains : 5
DFT: number of failed scan chains : 0
END_FUNC: check_dft            CPU:      7 s ( 0.00 hr) ELAPSE:      8 s ( 0.00 hr) MEM-PEAK:   241 Mb Tue Aug 26 08:22:54 2025
DFT: repartition_method: physical_aware
DFT: reordering_method: timing_friendly
APSINFO: No multi-Vth libcells found, turning off percentage LVT optimization flow
START_FUNC: opt_dft            CPU:      8 s ( 0.00 hr) ELAPSE:      8 s ( 0.00 hr) MEM-PEAK:   260 Mb Tue Aug 26 08:22:55 2025
Running DFT optimization using 1 thread(s)
START_FUNC: dft_repartition    CPU:      8 s ( 0.00 hr) ELAPSE:      8 s ( 0.00 hr) MEM-PEAK:   260 Mb Tue Aug 26 08:22:55 2025
END_FUNC: dft_repartition      CPU:      8 s ( 0.00 hr) ELAPSE:      8 s ( 0.00 hr) MEM-PEAK:   260 Mb Tue Aug 26 08:22:55 2025
START_FUNC: dft_reorder        CPU:      8 s ( 0.00 hr) ELAPSE:      8 s ( 0.00 hr) MEM-PEAK:   260 Mb Tue Aug 26 08:22:55 2025
END_FUNC: dft_reorder          CPU:      8 s ( 0.00 hr) ELAPSE:      8 s ( 0.00 hr) MEM-PEAK:   260 Mb Tue Aug 26 08:22:55 2025
END_FUNC: opt_dft              CPU:      8 s ( 0.00 hr) ELAPSE:      8 s ( 0.00 hr) MEM-PEAK:   260 Mb Tue Aug 26 08:22:55 2025
DFT: pre-opt wirelength:  4924.895800
DFT: post-opt wirelength: 2190.479600
DFT: Timing on scan path is likely to be met after proper buffering.
START_FUNC: check_dft          CPU:      8 s ( 0.00 hr) ELAPSE:      8 s ( 0.00 hr) MEM-PEAK:   260 Mb Tue Aug 26 08:22:55 2025
DFT: number of valid scan chains : 5
DFT: number of failed scan chains : 0
END_FUNC: check_dft            CPU:      8 s ( 0.00 hr) ELAPSE:      8 s ( 0.00 hr) MEM-PEAK:   260 Mb Tue Aug 26 08:22:55 2025
End DFT optimization
1
icc2_shell> 
icc2_shell> legalize_placement -incremental
----------------------------------------------------------------
running legalize_placement
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 56 total shapes.
Layer M2: cached 0 shapes out of 0 total shapes.
Cached 728 vias out of 2693 total vias.
Design has no advanced rules
Checking legality
Checking cell legality:
0%....10%....20%....30%....40%....50%....60%....70%....80%....90%....100%
Sorting rows.
Checking spacing rule legality.
0%....10%....20%....30%....40%....50%....60%....70%....80%....90%....100%
Checking packing rule legality.


****************************************
  Report : Legality
****************************************

VIOLATIONS BY CATEGORY:
   MOVABLE  APP-FIXED USER-FIXED  DESCRIPTION
       376          0          0  Two objects overlap.
         0          0          0  A cell violates a pnet.
         0          0          0  A cell is illegal at a site.
      1472          0          0  A cell is not aligned with a site.
         0          0          0  A cell has an illegal orientation.
         0          0          0  A cell spacing rule is violated.
         0          0          0  A layer rule is violated.
         0          0          0  A cell is in the wrong region.
         0          0          0  Two cells violate cts margins.
         0          0          0  Two cells violate coloring.

      1848          0          0  TOTAL

TOTAL 1848 Violations.

VIOLATIONS BY SUBCATEGORY:
     MOVABLE  APP-FIXED USER-FIXED  DESCRIPTION

       376          0          0    Two objects overlap.
         376          0          0    Two cells overlap.
           0          0          0    Two cells have overlapping keepout margins.
           0          0          0    A cell overlaps a blockage.
           0          0          0    A cell keepout margin overlaps a blockage.

         0          0          0    A cell violates a pnet.

         0          0          0    A cell is illegal at a site.
           0          0          0    A cell violates pin-track alignment rules.
           0          0          0    A cell is illegal at a site.
           0          0          0    A cell violates legal index rule.
           0          0          0    A cell has the wrong variant for its location.

      1472          0          0    A cell is not aligned with a site.
        1472          0          0    A cell is not aligned with the base site.
           0          0          0    A cell is not aligned with an overlaid site.

         0          0          0    A cell has an illegal orientation.

         0          0          0    A cell spacing rule is violated.
           0          0          0    A spacing rule is violated in a row.
           0          0          0    A spacing rule is violated between adjacent rows.
           0          0          0    A cell violates vertical abutment rule.
           0          0          0    A cell violates metal spacing rule.

         0          0          0    A layer rule is violated.
           0          0          0    A layer VTH rule is violated.
           0          0          0    A layer OD rule is violated.
           0          0          0    A layer OD max-width rule is violated.
           0          0          0    A layer ALL_OD corner rule is violated.
           0          0          0    A layer max-vertical-length rule is violated.
           0          0          0    A layer TPO rule is violated.
           0          0          0    Filler cell insertion cannot satisfy layer rules.

         0          0          0    A cell is in the wrong region.
           0          0          0    A cell is outside its hard bound.
           0          0          0    A cell is in the wrong voltage area.
           0          0          0    A cell violates an exclusive movebound.

         0          0          0    Two cells violate cts margins.

         0          0          0    Two cells violate coloring.

Information: Legalizing 1472 cells and 0 out of total 1482 cells will remain unchanged during legalization
Information: 10 cells were skipped due to unplaced or fixed status
Information: The net parasitics of block system are cleared. (TIM-123)
nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 56 total shapes.
Layer M2: cached 0 shapes out of 0 total shapes.
Cached 728 vias out of 2693 total vias.

Legalizing Top Level Design system ... 
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
       25344         1482        Yes DEFAULT_VA

Starting legalizer.
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (0 sec)
Legalization complete (0 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                   1482
number of references:                40
number of site rows:                 55
number of locations attempted:    21077
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

number of cells aggregated:        1472 (13969 total sites)
avg row height over cells:        2.880 um
rms cell displacement:            0.838 um ( 0.29 row height)
rms weighted cell displacement:   0.838 um ( 0.29 row height)
max cell displacement:            1.988 um ( 0.69 row height)
avg cell displacement:            0.730 um ( 0.25 row height)
avg weighted cell displacement:   0.730 um ( 0.25 row height)
number of cells moved:             1472
number of large displacements:        0
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: transmitter/enc/controller/U17 (INVX0)
  Input location: (103.922,83.2275)
  Legal location: (103.96,81.24)
  Displacement:   1.988 um ( 0.69 row height)
Cell: transmitter/enc/controller/U33 (NOR2X0)
  Input location: (102.207,83.4548)
  Legal location: (100.44,84.12)
  Displacement:   1.888 um ( 0.66 row height)
Cell: transmitter/enc/enc_inst_3b/U90 (INVX0)
  Input location: (112.268,62.4586)
  Legal location: (111.32,61.08)
  Displacement:   1.673 um ( 0.58 row height)
Cell: transmitter/enc/enc_inst_5b/U152 (INVX0)
  Input location: (139.353,68.4483)
  Legal location: (140.44,69.72)
  Displacement:   1.673 um ( 0.58 row height)
Cell: transmitter/enc/enc_inst_5b/U326 (NOR2X0)
  Input location: (127.954,82.7128)
  Legal location: (128.6,81.24)
  Displacement:   1.608 um ( 0.56 row height)
Cell: transmitter/enc/enc_inst_5b/U143 (INVX0)
  Input location: (127.622,79.9506)
  Legal location: (126.68,81.24)
  Displacement:   1.597 um ( 0.55 row height)
Cell: transmitter/enc/enc_inst_5b/U205 (INVX0)
  Input location: (150.651,137.258)
  Legal location: (150.68,138.84)
  Displacement:   1.582 um ( 0.55 row height)
Cell: transmitter/enc/enc_inst_3b/U100 (INVX0)
  Input location: (95.8572,94.1339)
  Legal location: (96.6,92.76)
  Displacement:   1.562 um ( 0.54 row height)
Cell: transmitter/enc/enc_inst_5b/U259 (INVX0)
  Input location: (139.345,71.0381)
  Legal location: (138.52,69.72)
  Displacement:   1.555 um ( 0.54 row height)
Cell: transmitter/enc/enc_inst_3b/U96 (INVX0)
  Input location: (112.457,59.764)
  Legal location: (113.24,61.08)
  Displacement:   1.531 um ( 0.53 row height)

Legalization succeeded.
Total Legalizer CPU: 0.436
----------------------------------------------------------------
1
icc2_shell> check_pg_drc  > ../report/drc_legalized.rpt
icc2_shell> 
icc2_shell> connect_pg_net -net "VDD" [get_pins -hierarchical "*/VDD*"]
icc2_shell> connect_pg_net -net "VSS" [get_pins -hierarchical "*/VSS"]
icc2_shell> check_pg_drc > ../report/After_placement_drc.rpt
icc2_shell> 
icc2_shell> check_legality -verbose  > ../report/legality.rpt
icc2_shell> check_routability   > ../report/routeability.rpt
icc2_shell> report_utilization > ../report/utilization.rpt
icc2_shell> check_pg_drc  > ../report/drc_final.rpt
icc2_shell> report_design > ../report/design.rpt
icc2_shell> report_cell   > ../report/cells.rpt
icc2_shell> report_timing > ../report/timing.rpt
icc2_shell> 
icc2_shell> write_def ../output/${design}.def
****************************************
Report : Data Mismatches
Version: O-2018.06-SP1
Date   : Tue Aug 26 08:22:57 2025
****************************************
No mismatches exist on the design.
---------------------------------------
Number of Written DEF Constructs
---------------------------------------
VERSION                        : 1
DIVIDERCHAR                    : 1
BUSBITCHARS                    : 1
DESIGN                         : 1
UNITS                          : 1
PROPERTYDEFINITIONS            : 1
DIEAREA                        : 1
ROW                            : 55
TRACKS                         : 18
VIAS                           : 11
COMPONENTS                     : 1482
PINS                           : 41
PINPROPERTIES                  : 39
SPECIALNETS                    : 2
NETS                           : 1516
SCANCHAINS                     : 5
1
icc2_shell> write_verilog -include {all} ../output/${design}.v
Warning: Net name 'n13' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'n15' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'n346' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'kout2' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'code_err2' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'disp_err_dff' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'dftopt18' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'dftopt22' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'n43' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'n5' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'n251' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'n7' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'dftopt1' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'dftopt7' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'dftopt14' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'scan_out_1' is renamed to 'hvoHier_scan_out_1' in module 'system' in output file. (VW-010)
Warning: Net name 'scan_out_2' is renamed to 'hvoHier_scan_out_2' in module 'system' in output file. (VW-010)
Warning: Net name 'scan_out_3' is renamed to 'hvoHier_scan_out_3' in module 'system' in output file. (VW-010)
Warning: Net name 'scan_out_4' is renamed to 'hvoHier_scan_out_4' in module 'system' in output file. (VW-010)
Warning: Net name 'scan_out_5' is renamed to 'hvoHier_scan_out_5' in module 'system' in output file. (VW-010)
Warning: Net name 'data_out_s' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'dftopt0' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'dftopt13' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'dftopt18' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
Warning: Net name 'dftopt22' is omitted from the output file, because the net name does not match a connected port name. The net is implicitly renamed to match one of its connected ports. (VW-007)
1
icc2_shell> save_block ;
Information: Saving block 'SerDes.dlib:SerDes_pl.design'
1
icc2_shell> start_gui
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
1
icc2_shell> check_pg_drc
Command check_pg_drc started  at Tue Aug 26 08:23:33 2025
Command check_pg_drc finished at Tue Aug 26 08:23:33 2025
CPU usage for check_pg_drc: 0.22 seconds ( 0.00 hours)
Elapsed time for check_pg_drc: 0.22 seconds ( 0.00 hours)
No errors found.
icc2_shell> check_pg_connectivity
Loading cell instances...
Number of Standard Cells: 1482
Number of Macro Cells: 0
Number of IO Pad Cells: 0
Number of Blocks: 0
Loading P/G wires and vias...
Number of VDD Wires: 44
Number of VDD Vias: 1240
Number of VDD Terminals: 0
Number of VSS Wires: 46
Number of VSS Vias: 1453
Number of VSS Terminals: 0
**************Verify net VDD connectivity*****************
  Number of floating wires: 0
  Number of floating vias: 0
  Number of floating std cells: 0
  Number of floating hard macros: 0
  Number of floating I/O pads: 0
  Number of floating terminals: 0
  Number of floating hierarchical blocks: 0
************************************************************
**************Verify net VSS connectivity*****************
  Number of floating wires: 0
  Number of floating vias: 0
  Number of floating std cells: 0
  Number of floating hard macros: 0
  Number of floating I/O pads: 0
  Number of floating terminals: 0
  Number of floating hierarchical blocks: 0
************************************************************
Overall runtime: 0 seconds.
icc2_shell> exit
Maximum memory usage for this session: 313.79 MB
CPU usage for this session:     15 seconds (  0.00 hours)
Elapsed time for this session:     81 seconds (  0.02 hours)
Thank you for using IC Compiler II.

