#@ # 
#@ # Running icc2_shell Version O-2018.06-SP1 for linux64 -- Jul 17, 2018
#@ # Date:   Tue Aug 26 08:30:04 2025
#@ # Run by: ICer@IC_EDA
#@ 

sh rm /home/ICer/SerDes/pnr/setup/script/SerDes.dlib/SerDes_cts/design.ndm.lock
set design SerDes
set design_lib_path /home/ICer/SerDes/pnr/setup/script
open_block $design_lib_path/${design}.dlib:${design}_cts.design
copy_block -from_block ${design}.dlib:${design}_cts.design -to_block ${design}_routing
current_block ${design}_routing.design
report_qor -summary
check_design -checks pre_route_stage
suppress_message -force CMD-013
suppress_message -force CMD-013; report_design_mismatch -check_design >> /home/ICer/SerDes/pnr/routing/script/check_design2025Aug26083016.log
suppress_message -force CMD-013; check_scan_chain >> /home/ICer/SerDes/pnr/routing/script/check_design2025Aug26083016.log
suppress_message -force CMD-013; check_mv_design >> /home/ICer/SerDes/pnr/routing/script/check_design2025Aug26083016.log
suppress_message -force CMD-013; design_extraction_check >> /home/ICer/SerDes/pnr/routing/script/check_design2025Aug26083016.log
suppress_message -force CMD-013; check_timing >> /home/ICer/SerDes/pnr/routing/script/check_design2025Aug26083016.log
suppress_message -force CMD-013; check_routability >> /home/ICer/SerDes/pnr/routing/script/check_design2025Aug26083016.log
suppress_message -force CMD-013; check_hier_design -stage pre_route >> /home/ICer/SerDes/pnr/routing/script/check_design2025Aug26083016.log
unsuppress_message CMD-013
global_route_opt
route_global
check_pg_drc
route_track
check_pg_drc
route_detail
check_pg_drc
check_routes
set FillerCells " */SHFILL1*"
create_stdcell_fillers -lib_cells $FillerCells
connect_pg_net -net "VDD" [get_pins -hierarchical "*/VDD*"]
connect_pg_net -net "VSS" [get_pins -hierarchical "*/VSS"]
check_pg_drc
check_routes -drc true
remove_stdcell_fillers_with_violation
check_legality
write_verilog  ../output/${design}_routing_Netlist.v
write_sdc -output ../output/${design}_routing_SDC.sdc
write_parasitics -format SPEF -output ../output/${design}_Routing_Spef.spef
write_def ../output/${design}_Routing_def.def
write_gds -view design -lib_cell_view frame -output_pin all -fill include -exclude_empty_block -long_names -keep_data_type ../../GDS/${design}_Routing_GDS.gds
check_pg_drc
check_routes -drc true
start_gui
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
win_set_filter -visible -class cell -filter {hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-77}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region pin_blockage block_shielding topology_node topology_edge core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {cell_array hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-77}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region pin_blockage topology_node topology_edge edit_group shape via placement_blockage }
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
win_set_filter -visible -class routing_blockage -layer {4 25 28}
win_set_filter -visible -class shape -filter {} -layer {4 25 28}
win_set_filter -visible -class via -filter {} -layer {4 25 28}
win_set_filter -visible -class terminal -filter {}  -layer {4 25 28}
win_set_filter -class routing_blockage -layer {4 25 28}
win_set_filter -class shape -filter {} -layer {4 25 28}
win_set_filter -class via -filter {} -layer {4 25 28}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {114.845 128.130}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {99.940 125.320}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {99.940 125.320}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {99.940 125.320}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {99.940 125.320}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {101.320 123.020}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {95.695 121.560}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {95.695 121.560}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {95.695 121.560}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {95.700 121.565}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {95.685 121.580}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {95.685 121.605}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {95.640 121.635}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {95.640 121.635}
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
win_set_filter -visible -class routing_blockage -layer {}
win_set_filter -visible -class shape -filter {} -layer {}
win_set_filter -visible -class via -filter {} -layer {}
win_set_filter -visible -class terminal -filter {}  -layer {}
win_set_filter -class routing_blockage -layer {}
win_set_filter -class shape -filter {} -layer {}
win_set_filter -class via -filter {} -layer {}
gui_zoom -window [gui_get_current_window -view] -full
report_timing -delay_type max -max_paths 100 > ../report/setup.rpt
report_timing -delay_type min -max_paths 100 > ../report/hold.rpt
exit
