#@ # 
#@ # Running icc2_shell Version O-2018.06-SP1 for linux64 -- Jul 17, 2018
#@ # Date:   Tue Aug 26 08:15:17 2025
#@ # Run by: ICer@IC_EDA
#@ 

set offset 2
set width 3
set spacing 5
set horiz_top M9
set vert_top M8
set mesh2_horiz_top M7
set mesh2_vert_top M6
set mesh_width 5
set mesh_pitch 15
set mesh_offset 1
set design SerDes
sh rm /home/ICer/SerDes/pnr/setup/script/SerDes.dlib/SerDes_fp/design.ndm.lock
set design_lib_path /home/ICer/SerDes/pnr/setup/script
open_block $design_lib_path/${design}.dlib:${design}_fp.design
copy_block -from_block ${design}.dlib:${design}_fp.design -to_block ${design}_pp
current_block ${design}_pp.design
remove_ignored_layers -all -max_routing_layer -min_routing_layer
report_ignored_layers
create_net -power VDD
create_net -ground VSS
connect_pg_net -net VDD [get_pins -hierarchical *\VDD]
connect_pg_net -net VSS [get_pins -hierarchical *\VSS]
set_app_option -name plan.pgroute.auto_connect_pg_net -value true
create_pg_region ring_region -core -expand_by_edge "{{side:1} {offset:$offset}} {{side:2} {offset:$offset}} {{side:3} {offset:$offset}} {{side:4} {offset:$offset}}"
create_pg_ring_pattern ring_pattern -horizontal_layer $horiz_top -vertical_layer $vert_top  -horizontal_spacing $spacing -vertical_spacing $spacing -horizontal_width $width -vertical_width $width
set_pg_strategy ring_strategy -pg_regions {ring_region} -pattern {{name:ring_pattern} {nets: "VSS VDD"}}
compile_pg -strategies ring_strategy
start_gui
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
win_set_filter -visible -class cell -filter {hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-77}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region pin_blockage block_shielding topology_node topology_edge core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {cell_array hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-77}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region pin_blockage topology_node topology_edge edit_group shape via placement_blockage }
check_pg_drc
check_pg_connectivity
create_pg_mesh_pattern mesh1  -layers {{{vertical_layer: M8} {width:2} {spacing:interleaving} {pitch:25} {offset:1} {trim:true}} {{horizontal_layer: M9} {width:2} {spacing:interleaving} {pitch:25} {offset:1} {trim: true}}}
set_pg_strategy mesh_strat1 -core -pattern {{pattern: mesh1} {nets: "VSS VDD"}} -extension {stop:outermost_ring}
compile_pg -strategies mesh_strat1
check_pg_drc
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showPin -value true
win_set_select_class -visible {cell pin port bound routing_blockage shaping_blockage pg_region pin_blockage block_shielding topology_node topology_edge core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_select_class {cell pin port bound routing_blockage shaping_blockage pg_region pin_blockage topology_node topology_edge edit_group shape via placement_blockage }
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {9.315 52.620}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {3.340 43.400}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-38.435 -9.845}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-27.375 -4.930}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-4.440 -0.835}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-4.440 -0.525}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-4.950 -0.160}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-5.155 -0.075}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {-7.575 3.135}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-7.565 3.040}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-7.565 3.040}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-7.680 2.925}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {-7.125 2.935}
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start RulerTool
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-7.665 2.970} -scale 0.0064
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-7.680 2.800} -scale 0.0064
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
create_pg_std_cell_conn_pattern std_cell_rail -layers M1 -rail_width 0.16
set_pg_strategy rails_M1 -core -pattern {{name: std_cell_rail} {nets: "VDD VSS"} }
compile_pg -strategies rails_M1
gui_zoom -window [gui_get_current_window -view] -full
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
win_set_filter -visible -class pin -filter {} -layer {25 28}
win_set_filter -visible -class routing_blockage -layer {25 28}
win_set_filter -visible -class shape -filter {} -layer {25 28}
win_set_filter -visible -class via -filter {} -layer {25 28}
win_set_filter -visible -class terminal -filter {}  -layer {25 28}
win_set_filter -class pin -filter {} -layer {25 28}
win_set_filter -class routing_blockage -layer {25 28}
win_set_filter -class shape -filter {} -layer {25 28}
win_set_filter -class via -filter {} -layer {25 28}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {5.520 178.905}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {5.800 178.570}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {22.180 178.570}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {22.180 178.570}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {22.180 178.570}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {22.080 178.465}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {12.400 176.780}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {12.350 176.830}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {110.450 144.780}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {110.245 144.980}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {109.835 144.980}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {69.695 67.160}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {32.420 42.580}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {32.625 42.785}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {32.420 57.430}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {28.735 58.050}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {28.585 58.045}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {28.380 58.070}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {28.065 58.090}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {28.065 58.115}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {28.065 58.115}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {28.065 58.115}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {28.540 57.870}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {28.565 57.795}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {28.985 56.580}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {29.140 56.375}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {29.140 56.295}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {28.985 55.865}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {27.810 53.150}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {27.810 53.150}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {28.495 58.330}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {28.475 58.320}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {28.475 58.320}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {28.475 58.320}
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
win_set_filter -visible -class pin -filter {} -layer {4 25 28}
win_set_filter -visible -class routing_blockage -layer {4 25 28}
win_set_filter -visible -class shape -filter {} -layer {4 25 28}
win_set_filter -visible -class via -filter {} -layer {4 25 28}
win_set_filter -visible -class terminal -filter {}  -layer {4 25 28}
win_set_filter -class pin -filter {} -layer {4 25 28}
win_set_filter -class routing_blockage -layer {4 25 28}
win_set_filter -class shape -filter {} -layer {4 25 28}
win_set_filter -class via -filter {} -layer {4 25 28}
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
win_set_filter -visible -class pin -filter {} -layer {25 28}
win_set_filter -visible -class routing_blockage -layer {25 28}
win_set_filter -visible -class shape -filter {} -layer {25 28}
win_set_filter -visible -class via -filter {} -layer {25 28}
win_set_filter -visible -class terminal -filter {}  -layer {25 28}
win_set_filter -class pin -filter {} -layer {25 28}
win_set_filter -class routing_blockage -layer {25 28}
win_set_filter -class shape -filter {} -layer {25 28}
win_set_filter -class via -filter {} -layer {25 28}
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {29.345 58.575}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {29.345 58.575}
win_set_filter -visible -class pin -filter {} -layer {}
win_set_filter -visible -class routing_blockage -layer {}
win_set_filter -visible -class shape -filter {} -layer {}
win_set_filter -visible -class via -filter {} -layer {}
win_set_filter -visible -class terminal -filter {}  -layer {}
win_set_filter -class pin -filter {} -layer {}
win_set_filter -class routing_blockage -layer {}
win_set_filter -class shape -filter {} -layer {}
win_set_filter -class via -filter {} -layer {}
gui_zoom -window [gui_get_current_window -view] -full
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {89.075 156.590}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {47.580 153.995}
check_pg_drc  > ../report/pg_drc.rpt
check_pg_connectivity > ../report/pg_connectivity.rpt
analyze_power_plan -report_track_utilization_only > ../report/track_utilization.rpt
report_utilization > ../report/utilization.rpt
report_qor > ../report/qor.rpt  ; #optional
report_timing > ../report/timing.rpt ; #optional
# ================================================ #
# =================== End_Step =================== #
# ================================================ #
write_def ../output/cv32e40p_top.def
write_verilog -include {all} ../output/cv32e40p_top.v
write_sdc -output ../output/cv32e40p_top.sdc
save_block ;
report_timing
report_timing -max_paths 20
exit
